          01 CON.      
            10 TACDGENT         PIC X(4).   
            10 TACENTRO         PIC X(4).   
            10 TACUENTA         PIC X(12).  
            10 TAPRODUC         PIC X(2).   
            10 TASUBPRO         PIC X(4).   
            10 TASECPRO         PIC S9(5)V USAGE COMP-3.          
            10 TASECSIT         PIC S9(3)V USAGE COMP-3.          
            10 TAFECINI         PIC X(10).  
            10 TANUMPER         PIC X(8).   
            10 TAFECFIN         PIC X(10).  
            10 TAFECBAJ         PIC X(10).  
            10 TAPERING         PIC X(1).   
            10 TARESIVA         PIC X(2).   
            10 TACONIVA         PIC X(1).   
            10 TACEREXC         PIC X(1).   
            10 TAFECINE         PIC X(10).  
            10 TAFECVEE         PIC X(10).  
            10 TARESGAN         PIC X(1).   
            10 TACERNOR         PIC X(1).   
            10 TAPORNOR         PIC S9(3)V9(2) USAGE COMP-3.      
            10 TAFECINC         PIC X(10).  
            10 TAFECVEC         PIC X(10).  
            10 TACEREXE         PIC X(1).   
            10 TAAJUINF         PIC X(1).   
            10 TATIPINB         PIC X(3).   
            10 TANUMINB         PIC X(20).  
            10 TAMAREMP         PIC X(1).   
            10 TAMAREND         PIC X(1).   
            10 TAMARAUT         PIC X(1).   
            10 TAULTPRE         PIC X(6).   
            10 TAAGERET         PIC X(1).   
            10 TACERARE         PIC X(1).   
            10 TAPOREXC         PIC S9(3)V9(2) USAGE COMP-3.      
            10 TADNRPRE         PIC X(8).   
            10 TAMARCA1         PIC X(1).   
            10 TAMARCA2         PIC X(1).   
            10 TARESIMPCRE      PIC X(1).   
            10 TARESIMPDEB      PIC X(1).   
            10 TACERPAC         PIC X(1).   
            10 TAPACFIS         PIC X(1).   
            10 TACERRAD         PIC X(1).   
            10 TAPORREDSEL      PIC S9(3)V9(2) USAGE COMP-3.      
            10 TAVIGFINSEL      PIC X(10).  
            10 TAPORREDIBR      PIC S9(3)V9(2) USAGE COMP-3.      
            10 TAVIGFINIBR      PIC X(10).  
            10 ENTIDAD-UMO      PIC X(4).   
            10 CENTRO-UMO       PIC X(4).   
            10 NETNAME-UMO      PIC X(8).   
            10 USERID-UMO       PIC X(8).   
            10 TIMEST-UMO       PIC X(26).  
            10 TAIVAEXC         PIC X(1).