       01  SDO.
               15  ENTIDAD                PIC X(04).
               15  CENTRO-ALTA            PIC X(04).
               15  CUENTA                 PIC X(12).
               15  DIVISA-ORI             PIC X(03).
               15  FECHA                  PIC X(10).
               15  SALDO                  PIC S9(13)V99 COMP-3.
               15  SALDO-FINAN            PIC S9(13)V99 COMP-3.
               15  SALDO-DISPO            PIC S9(13)V99 COMP-3.
               15  SALDO-TRASP            PIC S9(13)V99 COMP-3.
               15  SALDO-CANJE            PIC S9(13)V99 COMP-3.
               15  SALDO-REMESAS          PIC S9(13)V99 COMP-3.
               15  SALDO-TRAS-CANJE       PIC S9(13)V99 COMP-3.
               15  DISP-TOTAL-ACU         PIC S9(13)V99 COMP-3.
               15  DIAS-SALDO             PIC S9(03)V   COMP-3.
               15  INT-ACREED             PIC S9(03)V9(5) COMP-3.
               15  INT-ACREED-MAX         PIC S9(03)V9(5) COMP-3.
               15  INTE-PER-ACRE          PIC S9(13)V99 COMP-3.
               15  INTE-PER-DEUD          PIC S9(13)V99 COMP-3.
               15  INTE-PER-EXCE          PIC S9(13)V99 COMP-3.
               15  IND-NAT-TRASP          PIC X(01).
               15  DIVISA-DEST            PIC X(03).
               15  RET-SALDO-LIQ          PIC S9(13)V99 COMP-3.
               15  DIAS-SOBREGIRO-D1      PIC S9(03)V   COMP-3.
               15  DIAS-SOBREGIRO-D       PIC S9(03)V   COMP-3.
               15  CUPO-SOBREGIRO         PIC S9(13)V99 COMP-3.
               15  IND-DESB-MANUAL        PIC X(01).
               15  CUPO-CANJE             PIC S9(13)V99 COMP-3.
               15  CUPO-REMESAS           PIC S9(13)V99 COMP-3.
               15  SALDO-CA               PIC S9(13)V99 COMP-3.
               15  SALDO-CC               PIC S9(13)V99 COMP-3.
               15  ENTIDAD-UMO            PIC X(04).
               15  CENTRO-UMO             PIC X(04).
               15  USERID-UMO             PIC X(08).
               15  NETNAME-UMO            PIC X(08).
               15  TIMEST-UMO             PIC X(26).