           01  WAPRP065.
               10 NRO_EMPR    				PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR  			PIC S9(1)V COMP-3.
               10 NRO_PROD    				PIC S9(3)V COMP-3.
               10 NRO_INSTAN  				PIC S9(2)V COMP-3.
               10 TPO_ENVIO   				PIC X(3).
               10 FEC_ALTA_ENVIO  			PIC X(10).
               10 NRO_ENVIO   				PIC S9(5)V COMP-3.
               10 COD_FORM_PGO  			PIC S9(2)V COMP-3.
               10 COD_MONE    				PIC S9(1)V COMP-3.
               10 FEC_DISP    				PIC X(10).
               10 IDE_CTA_CD_CC  			PIC X(31).
               10 IMP         				PIC S9(13)V9(2) COMP-3.
               10 IMP_BAJA    				PIC S9(13)V9(2) COMP-3.
               10 FEC_EMISION_CALC  		PIC X(10).
               10 IDE_USER_ALTA  			PIC X(10).
               10 IDE_TERM_ALTA  			PIC X(5).
               10 FEC_HRA_ULT_MODF  		PIC X(26).
               10 IDE_USER_ULT_MODF  		PIC X(10).
               10 IDE_TERM_ULT_MODF  		PIC X(5).
               10 FEC_VTO_ACT  				PIC X(10).
               10 CAN_INTENTOS  			PIC S9(3)V COMP-3.
               10 COD_ESTADO  				PIC X(3).
               10 CAN_MOV     				PIC S9(9)V COMP-3.
               10 CAN_MOV_BAJA  			PIC S9(9)V COMP-3.
               10 CAN_MOV_REINGRE  			PIC S9(9)V COMP-3.
               10 IMP_MOV_REINGRE  			PIC S9(13)V9(2) COMP-3.
               10 IDE_USER_ESTADO  			PIC X(10).
               10 IDE_TERM_ESTADO  			PIC X(5).
               10 TIM_ESTADO  				PIC X(26).
