
           02  ISEC.
                10  PER_PERIODO     	PIC 9(06).
                10  NUM_EJECUCION     	PIC 9(01).
                10  COD_APLICATIVO    	PIC X(02).
                10  NUP               	PIC X(08).
                10  ENTIDAD           	PIC X(04).
                10  CEN_CENTRO        	PIC X(04).
                10  CTA_CUENTA        	PIC X(12).
                10  PRO_PRODUCTO      	PIC X(02).
                10  SPR_SUBPRODUCTO   	PIC X(04).
                10  DIV_DIVISA        	PIC X(03).
                10  NUM_IDENTIFICACION	PIC 9(05).
                10  TIP_GTIA          	PIC X(01).
                10  COD_GTIA          	PIC X(02).
                10  TIP_DOC           	PIC X(02).
                10  COD_NUM_DOC       	PIC X(11).
                10  COD_CLA_EFD       	PIC X(02).
                10  COD_MIPYME       	PIC X(02).
                10  TIP_CLIENTE       	PIC X(01).
                10  TIP_TASA_OPER    	PIC X(01).
                10  TAS_OPER          	PIC S9(03)V9(02) COMP-3.
                10  IND_MIPYME        	PIC X(01).
                10  FEC_FINALIZA_CTO  	PIC X(10).
                10  DIA_ATRASO        	PIC 9(04).
                10  COD_MARCA_TIP_RUB 	PIC X(01).
                10  COD_RUBRO_ALTAIR  	PIC X(15).
                10  COD_RUBRO_BCRA    	PIC X(15).
                10  COD_RUBRO_CARGABAL	PIC X(15).
                10  COD_CONCEPTO      	PIC X(02).
                10  IMP_DEUDA        	PIC S9(15)V9(02) COMP-3.
                10  IMP_PREV          	PIC S9(15)V9(02) COMP-3.
                10  COD_DEST_FONDOS   	PIC X(05).
                10  FEC_ORI_OPER      	PIC X(10).
                10  FEC_PRI_VTO_IMP  	PIC X(10).
                10  CAP_ORIGINAL      	PIC S9(15)V9(02) COMP-3.
                10  FILLER			    PIC X(109).
