           02  RGO.
               10  LENGTH             PIC S9(08) BINARY.
               10  SUBJECT-CODE       PIC X(01).
               10  TENANT-ID          PIC S9(08) BINARY.
               10  ID                 PIC S9(03) BINARY.
               10  PROC-MODE          PIC X(10).
               10  COMP-EST-EXPT-ID   PIC X(05).
               10  PROC-DATE-CYMD     PIC 9(08) BINARY.
               10  CUSTOMER-ID        PIC X(20).
               10  PREV-CUSTOMER-ID   PIC X(20).
               10  ACCOUNT-ID         PIC X(20).
               10  PREV-ACCOUNT-ID    PIC X(20).
               10  CALL-TYPE          PIC X(01).
               10  SAMPL-FTR          PIC S9(06) BINARY.
               10  CO-PROD-TYPE       PIC 9(01).
               10  VERIFICATION-ID    PIC X(33).
               10  GO-LENGTH          PIC S9(08) BINARY.
               10  GO-SUBJECT-CODE    PIC X(01).
               10  GO-SUBSEGMENT-CODE PIC X(01).
               10  GO-HD-TENANT-ID    PIC S9(08) BINARY.
               10  GO-HD-SPID         PIC S9(03) BINARY.
               10  GO-HD-PROC-DATE-CYM PIC 9(06) BINARY.
               10  GO-RDG-LOWLMT      PIC S9(04) BINARY.
               10  GO-RDG-UPLMT       PIC S9(04) BINARY.
               10  GO-ACCT            PIC X(20).
               10  GO-PREV-ACCT-ID    PIC X(20).
               10  GO-PROD            PIC X(03).
               10  GO-RANDOM-NUMBER   PIC S9(02) BINARY.
               10  GO-TOB             PIC S9(04) BINARY.
               10  GO-CLOSE-CATEGORY  PIC 9(01).
               10  GO-WRITE-OFF-CATEGORY PIC 9(01).
               10  GO-CAT             PIC 9(02).
               10  GO-NEW-CATEGORY    PIC 9(02).
               10  GO-BALANCE         PIC S9(9) BINARY.
               10  GO-BALANCE-FLAG    PIC 9.
               10  GO-CASH-BALANCE    PIC S9(9) BINARY.
               10  GO-CURE-CATEGORY   PIC 9.
               10  GO-DEBITS-VALUE    PIC S9(9) BINARY.
               10  GO-DEBITS-1        PIC S9(9) BINARY.
               10  GO-DEBITS-2        PIC S9(9) BINARY.
               10  GO-DEBITS-3        PIC S9(9) BINARY.
               10  GO-CREDITS-VALUE   PIC S9(9) BINARY.
               10  GO-CREDITS-1       PIC S9(9) BINARY.
               10  GO-CREDITS-2       PIC S9(9) BINARY.
               10  GO-CREDITS-3       PIC S9(9) BINARY.
               10  GO-DECL-TXN-1-CNT  PIC S9(4) BINARY.
               10  GO-DECL-TXN-1-VAL  PIC S9(9) BINARY.
               10  GO-DECL-TXN-2-CNT  PIC S9(4) BINARY.
               10  GO-DECL-TXN-2-VAL  PIC S9(9) BINARY.
               10  GO-APRV-TXN-NUM    PIC S9(4) BINARY.
               10  GO-APRV-TXN-VAL    PIC S9(9) BINARY.
               10  GO-LIM-VALUE-1     PIC S9(9) BINARY.
               10  GO-LIM-BALANCE-1   PIC S9(9) BINARY.
               10  GO-LIM-PREV-VALUE-1 PIC S9(9) BINARY.
               10  GO-LIM-VALUE-2     PIC S9(9) BINARY.
               10  GO-LIM-BALANCE-2   PIC S9(9) BINARY.
               10  GO-LIM-PREV-VALUE-2 PIC S9(9) BINARY.
               10  GO-LIM-VALUE-3     PIC S9(9) BINARY.
               10  GO-LIM-BALANCE-3   PIC S9(9) BINARY.
               10  GO-PAY-CATEGORY    PIC 9(01).
               10  GO-FACILITY-1      PIC 9(01).
               10  GO-FACILITY-2      PIC 9(01).
               10  GO-FACILITY-3      PIC 9(01).
               10  GO-FACILITY-4      PIC 9(01).
               10  GO-FACILITY-RENEWAL PIC 9(01).
               10  GO-CREDIT-INTEREST PIC S9(9) BINARY.
               10  GO-DEBIT-INTEREST-1 PIC S9(9) BINARY.
               10  GO-DEBIT-INTEREST-2 PIC S9(9) BINARY.
               10  GO-FEES-1           PIC S9(9) BINARY.
               10  GO-FEES-2           PIC S9(9) BINARY.
               10  GO-FEES-3           PIC S9(9) BINARY.
               10  GO-FEES-4           PIC S9(9) BINARY.
               10  GO-FEES-5           PIC S9(9) BINARY.
               10  GO-EXPOSURE         PIC S9(9) BINARY.
               10  GO-PREV-CAT         PIC 9(02).
               10  GO-PROFIT           PIC S9(09) BINARY.
               10  GO-PROVISION        PIC S9(09) BINARY.
               10  GO-BLOCK-CODE       PIC X(04).
               10  GO-CU-RAW-SCORE     PIC S9(07) BINARY.
               10  GO-CU-ALIGNED-SCORE PIC S9(07) BINARY.
               10  GO-RISK-FACTOR      PIC S9(01)V9(07) BINARY.
               10  GO-HD-SAMPL-FTR     PIC S9(06) BINARY.
               10  GO-HD-PROC-MODE     PIC X(10).
