          02  AUX.
            10 ENTIDAD                   PIC X(04).
            10 OFICINA                   PIC X(04).
            10 CUENTA                    PIC X(12).
            10 PAIS_RE                   PIC X(03).
            10 INT_DOCUMENT              PIC S9(13)V9(04) COMP-3.
            10 INT_DOCUMENT_SAL          PIC S9(13)V9(04) COMP-3.
            10 TIPOGAR_INDEX_INI         PIC X(1).
            10 COEFICI_VISUAL            PIC X(4).
            10 FECCAL_INDEX_INI          PIC X(10).
            10 VALCOEF1_INDEX_INI        PIC S9(3)V9(8)  COMP-3.
            10 VALCOEF2_INDEX_INI        PIC S9(3)V9(8)  COMP-3.
            10 FACTOR_INDEX_INI          PIC S9(3)V9(6)  COMP-3.
            10 FECCAL_INDEX_ULT          PIC X(10).
            10 VALCOEF1_INDEX_ULT        PIC S9(3)V9(8)  COMP-3.
            10 VALCOEF2_INDEX_ULT        PIC S9(3)V9(8)  COMP-3.
            10 FACTOR_INDEX_ULT          PIC S9(3)V9(6)  COMP-3.
            10 IMPAJUST_SAL_ULT          PIC S9(13)V9(4) COMP-3.
            10 IMPAJUST_SAL_ACUM         PIC S9(13)V9(4) COMP-3.
            10 CODCONLI_AJUSAL           PIC X(3).
            10 COEFICI_INDEX_ACT         PIC X(4).
            10 SALDO_AJUSTE              PIC S9(13)V9(4) COMP-3.
            10 ENTIDAD_UMO               PIC X(04).
            10 CENTRO_UMO                PIC X(04).
            10 USERID_UMO                PIC X(08).
            10 NETNAME_UMO               PIC X(08).
            10 TIMEST_UMO                PIC X(26).
            10 POR_CFT_ORI               PIC S9(3)V9(6)  COMP-3.
            10 POR_CFT_ACT               PIC S9(3)V9(6)  COMP-3.
            10 IND_MIPYME                   PIC X(01).
            10 CFTNA_SIMP_ORI               PIC S9(3)V9(6)  COMP-3.
            10 CFTNA_SIMP_ACT               PIC S9(3)V9(6)  COMP-3.