           01  PEDT028.
               10 PECDGENT    PIC X(4).
               10 PENUMPER    PIC X(8).
               10 PESECREF    PIC S9(3)V USAGE COMP-3.
               10 PETIPDOC    PIC X(2).
               10 PENUMDOC    PIC X(11).
               10 PETIPREL    PIC X(2).
               10 PEPRIAPE    PIC X(20).
               10 PESEGAPE    PIC X(20).
               10 PENOMCON    PIC X(40).
               10 PEINDPER    PIC X(1).
               10 PEPRETEL    PIC X(7).
               10 PETELCON    PIC X(10).
               10 PEANECON    PIC X(20).
               10 PEEMAILC    PIC X(50).
               10 PESECDOM    PIC S9(3)V USAGE COMP-3.
               10 PEUSUALT    PIC X(8).
               10 PEFECALT    PIC X(10).
               10 PEUSUMOD    PIC X(8).
               10 PETERMOD    PIC X(4).
               10 PESUCMOD    PIC X(4).
               10 PEHSTAMP    PIC X(26).
               10 PEOBSERV_LEN  PIC S9(4) USAGE COMP.
               10 PEOBSERV_TEXT  PIC X(300).