          02  MOV.
            10 CUENTA              PIC X(12).
            10 OFICINA             PIC X(4).
            10 ENTIDAD             PIC X(4).
            10 NIO                 PIC X(24).
            10 CODCONLI            PIC X(3).
            10 NUM-SECUENCIA       PIC S9(3)V USAGE COMP-3.
            10 COD-EVENTO          PIC X(4).
            10 TIPO-MOV            PIC X(1).
            10 FEOPER           PIC X(10).
            10 FECONTA          PIC X(10).
            10 FEVALOR          PIC X(10).
            10 FELIQ            PIC X(10).
            10 CLAOPER          PIC X(2).
            10 ENTIOPE          PIC X(4).
            10 OFIOPE           PIC X(4).
            10 IMPMOVI          PIC S9(13)V9(4) USAGE COMP-3.
            10 COD-DIVISA       PIC X(3).
            10 TIP-CAMBIO-OPE   PIC S9(6)V9(5) USAGE COMP-3.
            10 SALREAL          PIC S9(13)V9(4) USAGE COMP-3.
            10 UGYINCOR         PIC X(1).
            10 UGYINDIF         PIC X(1).
            10 NUN-INCIDEN      PIC S9(9)V USAGE COMP-3.
            10 IND-FORMPAGO       PIC X(1).
            10 IMP-PAGO           PIC S9(13)V9(4) USAGE COMP-3.
            10 COD-DIVI-PAGO      PIC X(3).
            10 COD-ENTCHEQU PIC X(4).
            10 COD-OFICHEQU PIC X(4).
            10 COD-CTACHEQU PIC X(12).
            10 NUM-DOCCHEQU   PIC S9(13) USAGE COMP-3.
            10 TIP-DOCCHEQU   PIC X(2).
            10 FEC-DISPCHEQU  PIC X(10).
            10 COD-PLAZA      PIC X(8).
            10 ENTIDAD-PAG    PIC X(4).
            10 CENTRO-PAG     PIC X(4).
            10 CUENTA-PAG     PIC X(12).
            10 DIGICCC1-PAG   PIC X(1).
            10 DIGICCC2-PAG   PIC X(1).
            10 TASA-ANT          PIC S9(03)V9(6) USAGE COMP-3.
            10 TASA-NUEVA        PIC S9(03)V9(6) USAGE COMP-3.
            10 INDRETRO          PIC X(1).
            10 FECRETRO          PIC X(10).
            10 ENTIDAD-RETRO  PIC X(4).
            10 CENTRO-RETRO   PIC X(4).
            10 USERID-RETRO   PIC X(8).
            10 NETNAME-RETRO  PIC X(8).
            10 TIMESTAMP-RETRO  PIC X(26).
            10 PRE-TABLA         PIC X(4).
            10 NOM-CAMPO         PIC X(20).
            10 VALOR-ANT         PIC X(20).
            10 VALOR-NUE         PIC X(20).
            10 COD-TRANSACCION      PIC X(4).
            10 ENTIDAD-UMO       PIC X(4).
            10 CENTRO-UMO        PIC X(4).
            10 USERID-UMO        PIC X(8).
            10 NETNAME-UMO       PIC X(8).
            10 TIMESTAMP         PIC X(26).