       02 CGR.
         03 GARANTIA_NRO                    PIC X(7).
         03 ID_CONTRATO                     PIC X(12).
         03 LIABILITY                       PIC X(3).
         03 CODIGO_REFERENCIA               PIC X(30).
         03 BANCO_EMISOR                    PIC X(35).
         03 NUP_BANCO_EMISOR                PIC X(08).
         03 BIC_BANCO_EMISOR                PIC X(15).
         03 ORDENANTE                       PIC X(35).
         03 CUIT_ORDENANTE                  PIC X(15).
         03 BENEFICIARIO                    PIC X(35).
         03 NUP_BENEFICIARIO                PIC X(08).
         03 CUIT_BENEFICIARIO               PIC X(15).
         03 IMPORTE_ORIGINAL                PIC S9(13)V99 COMP-3.
         03 SALDO_MONEDA_ORIGEN             PIC S9(13)V99 COMP-3.
         03 SALDO_PESOS                     PIC S9(13)V99 COMP-3.
         03 MONEDA                          PIC X(30).
         03 FECHA_EMISION                   PIC X(10).
         03 FECHA_VTO                       PIC X(10).
         03 SBLC_NRO                        PIC X(7).
         03 SBLC_ID_CONTRATO                PIC X(12).
         03 SBLC_LIABILITY                  PIC X(3).
         03 SBLC_CODIGO_REFERENCIA          PIC X(30).
         03 SBLC_BANCO_EMISOR               PIC X(35).
         03 SBLC_NUP_BANCO_EMISOR           PIC X(08).
         03 SBLC_BIC_BANCO_EMISOR           PIC X(15).
         03 SBLC_BENEFICIARIO               PIC X(35).
         03 SBLC_NUP_BENEFICIARIO           PIC X(08).
         03 SBLC_CUIT_BENEFICIARIO          PIC X(15).
         03 SBLC_ORDENANTE                  PIC X(35).
         03 SBLC_CTA_ORDENANTE              PIC X(15).
         03 SBLC_FECHA_EMISION              PIC X(10).
         03 SLBC_FECHA_VTO                  PIC X(10).