           01 610.
			   10 EMPRESA              PIC S9999V USAGE COMP-3.
			   10 NUCTA                PIC X(15).
			   10 INDREVAL             PIC X(1).
			   10 INDCTAREG            PIC X(1).
			   10 HACTADET             PIC X(1).
			   10 HACTARENT            PIC X(1).
			   10 HACTAINT             PIC X(15).
			   10 HACTAAJU             PIC X(15).
			   10 HACTARES             PIC X(15).
			   10 HACTAREG             PIC X(15).
			   10 HACTAIND             PIC X(15).
			   10 HACSD1               PIC X(3).
			   10 HACSD2               PIC X(3).
			   10 HACSD3               PIC X(3).
			   10 HACIA1               PIC X(1).
			   10 HACIA2               PIC X(1).
			   10 HACIA3               PIC X(1).
			   10 HAF4305              PIC S99    USAGE COMP-3.
			   10 INDREAJ              PIC X(2).