           01  WASPE006.
               10 IDE_PGO                   PIC X(19).
               10 COD_DOCUM                 PIC S9(3)V COMP-3.
               10 NRO_DOCUM                 PIC S9(2)V COMP-3.
               10 NRO_SEC_DOCUM             PIC S9(2)V COMP-3.
               10 NRO_EMPR                  PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR              PIC S9(1)V COMP-3.
               10 NRO_PROD                  PIC S9(3)V COMP-3.
               10 NRO_INSTAN                PIC S9(2)V COMP-3.
               10 FEC_ALTA_ENVIO            PIC X(10).
               10 NRO_ENVIO                 PIC S9(5)V COMP-3.
               10 COD_EST                   PIC X(3).
               10 NRO_EMISION               PIC S9(8)V COMP-3.
               10 NRO_SUC_DIST              PIC X(3).
               10 TPO_DIST                  PIC X(3).
               10 NRO_EMPR_DIST             PIC S9(5)V COMP-3.
               10 FEC_EMISION               PIC X(10).
               10 FEC_EMISION_CALC          PIC X(10).
               10 DES_DETALL_IMPRE_LEN      PIC S9(4) COMP.
               10 DES_DETALL_IMPRE_TEXT     PIC X(600).
               10 IDE_USER_ALTA             PIC X(10).
               10 IDE_TERM_ALTA             PIC X(10).
               10 FEC_HRA_ULT_MODF          PIC X(26).
               10 IDE_USER_ULT_MODF         PIC X(10).
               10 IDE_TERM_ULT_MODF         PIC X(5).
