           01  WAPRP029.
                   10 TPO_PIEZA   PIC X(3).
                   10 NRO_EMISION  PIC S9(8)V COMP-3.
                   10 NRO_EMPR    PIC S9(11)V COMP-3.
                   10 NRO_DIG_EMPR  PIC S9(1)V COMP-3.
                   10 NRO_PROD    PIC S9(3)V COMP-3.
                   10 NRO_INSTAN  PIC S9(2)V COMP-3.
                   10 IDE_PGO     PIC X(19).
                   10 NRO_SUC_DIST  PIC X(3).
                   10 TPO_DIST    PIC X(3).
                   10 NRO_EMPR_DIST  PIC S9(5)V COMP-3.
                   10 NOM_ARCHIVO  PIC X(20).
                   10 TPO_DESTINO  PIC X(2).
                   10 NOM_DESTINO  PIC X(100).
                   10 CAN_INSTR   PIC S9(5)V COMP-3.
                   10 CAN_DAI     PIC S9(5)V COMP-3.
                   10 NOM_CLTE    PIC X(30).
                   10 NRO_CUIT_CLTE  PIC S9(11)V COMP-3.
                   10 COD_EST_PIEZA  PIC X(3).
                   10 IDE_USER_ALTA  PIC X(10).
                   10 IDE_TERM_ALTA  PIC X(10).
                   10 FEC_HRA_ULT_MODF  PIC X(26).
                   10 IDE_USER_ULT_MODF  PIC X(10).
                   10 IDE_TERM_ULT_MODF  PIC X(5).
