       ******************************************************************
      * DCLGEN TABLE(BGTCPPR)                                          *
      *        LIBRARY(OPI.CPF.DCLGEN(BGTCPPR))                        *
      *        ACTION(REPLACE)                                         *
      *        APOST                                                   *
      * ... IS THE BGGTPAB COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
      ******************************************************************

      ******************************************************************
      * COBOL DECLARATION FOR TABLE OPIGD1.BGTCPPR                     *
      ******************************************************************
       01 PPR.
           10 PLAN                            PIC X(04).
           10 CONCEPTO                        PIC X(04).
           10 PCO-ECU-PER                     PIC X(01).
           10 PCO-ECU-SOP                     PIC X(01).
           10 FECHA-DESDE                     PIC X(10).
           10 FECHA-HASTA                     PIC X(10).
           10 COMISION                        PIC X(04).
           10 ENTIDAD-UMO                     PIC X(4).
           10 CENTRO-UMO                      PIC X(4).
           10 USERID-UMO                      PIC X(8).
           10 NETNAME-UMO                     PIC X(8).
           10 TIMEST-UMO                      PIC X(26).
      ******************************************************************
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 16      *
      ******************************************************************