      ******************************************************************
      * COPY PARA LA hadt006                                           *        
      *   TABLA CON LOS PLAZOS QUE ORIGINALMENTE PROVENIAN DE OTRA     *        
      *      DIVISA                                                    *        
      ******************************************************************        
      * PETICION  :03_02964_0A                                         *
      * FECHA     :09_07_2003                                          *
      * MODIFACION:ALTEC_0001                                          *
           01  060.                                                  
               10 EMPRESA         PIC S9999V USAGE COMP-3.           
               10 NUMAS           PIC S9999999V USAGE COMP-3.        
               10 NUMASOFI        PIC S999999999V USAGE COMP-3.      
               10 NUMAP           PIC S9999999V USAGE COMP-3.        
               10 FECON           PIC X(10).                         
               10 FEPROC          PIC X(10).                         
               10 HAYCLAUT        PIC X(1).                          
               10 NUCTA           PIC X(15).                         
               10 CEOPE           PIC S9999V USAGE COMP-3.           
               10 CEORIGEN        PIC S9999V USAGE COMP-3.           
               10 CEDESTIN        PIC S9999V USAGE COMP-3.           
               10 CODDIV          PIC X(3).                          
               10 HATDVISA        PIC X(1).                          
               10 NUMOD           PIC S9999999V USAGE COMP-3.        
               10 NUMOH           PIC S9999999V USAGE COMP-3.        
               10 IMPD            PIC S9999999999999V99 USAGE COMP-3.
               10 IMPH            PIC S9999999999999V99 USAGE COMP-3.
               10 IMPDDIV         PIC S9999999999999V99 USAGE COMP-3.
               10 IMPHDIV         PIC S9999999999999V99 USAGE COMP-3.
               10 CORRECCIO       PIC X(1).                          
               10 HAYCNONL        PIC X(1).                          
               10 TIPCAMB         PIC S999999999V999999 USAGE COMP-3.
               10 HAYNUMDO        PIC X(1).                          
               10 NUMDO           PIC X(12).                         
               10 REFDOC          PIC X(12).                         
               10 FALTPART        PIC X(10).
               10 FILLER_1        PIC X(1).
               10 CLACON          PIC X(3).                          
               10 DESCON          PIC X(14).                         
               10 TIPAPUN         PIC X(1).                          
               10 IONBATCH        PIC X(1).                          
               10 HANAPANU        PIC S9999999V USAGE COMP-3.        
               10 OBSERV          PIC X(30).                         
               10 OBSERV2         PIC X(30).                         
               10 CODUSU          PIC X(8).  
               10 NUMTER          PIC X(4).  
               10 HORATR          PIC X(8).
               10 FILLER_2        PIC X(1).
               10 ESTADAS         PIC X(1).  
               10 USUAUTOR        PIC X(8).  
               10 TERAUTOR        PIC X(4).  
               10 HORAUTOR        PIC X(8).
               10 FILLER_3        PIC X(1).



  
