02  BGTCTMO.                                  
    05 TMO-CLAVE.                             
       10 TMO-CONCEPTO              PIC X(04).
       10 TMO-COMISION              PIC X(04).
       10 TMO-FECHA-DESDE           PIC X(10).
       10 TMO-CODIGO                PIC X(04).
    05 TMO-DATOS.                             
       10 TMO-FECHA-HASTA           PIC X(10).
    05 TMO-STAMP.                             
       10 TMO-ENTIDAD-UMO           PIC X(04).
       10 TMO-CENTRO-UMO            PIC X(04).
       10 TMO-USERID-UMO            PIC X(08).
       10 TMO-NETNAME-UMO           PIC X(08).
       10 TMO-TIMEST-UMO            PIC X(26).