       ******************************************************************
      * DCLGEN TABLE(BGTCTMO)                                          *
      *        LIBRARY(OPI.CPF.DCLGEN(BGTCTMO))                        *
      *        ACTION(REPLACE)                                         *
      *        APOST                                                   *
      * ... IS THE BGTCTMO COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
      ******************************************************************

      ******************************************************************
      * COBOL DECLARATION FOR TABLE OPIGD1.BGDTOBS                     *
      ******************************************************************
       02 TMO.
           10 CONCEPTO                        PIC X(04).
           10 COMISION                        PIC X(04).
           10 FECHA-DESDE                     PIC X(10).
           10 CODIGO                          PIC X(04).
           10 FECHA-HASTA                     PIC X(10).
           10 ENTIDAD-UMO                     PIC X(04).
           10 CENTRO-UMO                      PIC X(04).
           10 USERID-UMO                      PIC X(08).
           10 NETNAME-UMO                     PIC X(08).
           10 TIMEST-UMO                      PIC X(26).
      ******************************************************************
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 10      *
      ******************************************************************