           01  WAPRP032.
               10 NRO_EMPR    		PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR  	PIC S9(1)V COMP-3.
               10 NRO_PROD    		PIC S9(3)V COMP-3.
               10 NRO_INSTAN  		PIC S9(2)V COMP-3.
               10 TPO_ENVIO   		PIC X(3).
               10 FEC_ALTA_ENVIO  	PIC X(10).
               10 NRO_ENVIO   		PIC S9(5)V COMP-3.
               10 COD_CANAL   		PIC S9(3)V COMP-3.
               10 COD_ESTADO  		PIC X(3).
               10 CAN_DOC_ACEPT  	PIC S9(9)V COMP-3.
               10 CAN_DOC_RECH  	PIC S9(9)V COMP-3.
               10 CAN_DOC_INF  		PIC S9(9)V COMP-3.
               10 CAN_PGO     		PIC S9(9)V COMP-3.
               10 CAN_OTR_IMPRE  	PIC S9(9)V COMP-3.
               10 CAN_LIQ     		PIC S9(9)V COMP-3.
               10 IMP_ACEPT   		PIC S9(13)V9(2) COMP-3.
               10 IMP_RECH    		PIC S9(13)V9(2) COMP-3.
               10 IMP_INF     		PIC S9(13)V9(2) COMP-3.
               10 FEC_AUTZ    		PIC X(10).
               10 IDE_USER_AUTZ  	PIC X(10).
               10 COD_MOT_RECH  	PIC X(3).
               10 FEC_BAJ_ENVIO  	PIC X(10).
               10 IDE_USER_BAJA  	PIC X(10).
               10 MAR_VUELCO  		PIC X(1).
               10 MAR_SOLI_IMPRE  	PIC X(1).
               10 MAR_CTRL_FIRMA  	PIC X(1).
               10 MAR_AUTZ    			PIC X(1).
               10 NRO_SUC_ORIG_ACDO  	PIC S9(4)V COMP-3.
               10 FEC_MAX_BAJA  		PIC X(10).
               10 FEC_CONFIRM  			PIC X(10).
               10 IDE_USER_ALTA  		PIC X(10).
               10 IDE_TERM_ALTA  		PIC X(10).
               10 FEC_HRA_ULT_MODF  	PIC X(26).
               10 IDE_USER_ULT_MODF  	PIC X(10).
               10 IDE_TERM_ULT_MODF  	PIC X(5).
               10 MAR_ACT_DEUD  		PIC X(1).
               10 NRO_ULT_REND  		PIC S9(5)V COMP-3.
               10 PER_ENVI    			PIC S9(6)V COMP-3.
               10 FEC_DDE     			PIC X(10).
               10 FEC_HTA     			PIC X(10).
               10 COD_CPTO_ENV  		PIC S9(5)V COMP-3.
