02  BGTCPLC.                                    
    05 PLC-CLAVE.                               
       10 PLC-PLAN                  PIC X(04).  
       10 PLC-CONCEPTO              PIC X(04).  
       10 PLC-CANAL                 PIC X(02).  
       10 PLC-FECHA-DESDE           PIC X(10).  
    05 PLC-DATOS.                               
       10 PLC-COMISION              PIC X(04).  
       10 PLC-FECHA-HASTA           PIC X(10).  
    05 PLC-STAMP.                               
       10 PLC-ENTIDAD-UMO           PIC X(04).  
       10 PLC-CENTRO-UMO            PIC X(04).  
       10 PLC-USERID-UMO            PIC X(08).  
       10 PLC-NETNAME-UMO           PIC X(08).  
       10 PLC-TIMEST-UMO            PIC X(26).