      ******************************************************************        
      * INTERFAZ A RIO 46                                              *        
      * DATOS DE LA MDDTCAC                                            *        
      ******************************************************************        
       02  MDEC160C.                                                            
           10 COD_ENTIGEN               PIC X(4).                      
           10 IDF_CANCELAC              PIC X(24).                     
           10 COD_ENTIDAD               PIC X(4).                      
           10 COD_CENTRO                PIC X(4).                      
           10 NUM_CONTRATO              PIC X(12).                     
           10 COD_PRODUCTO              PIC X(2).                      
           10 COD_SUBPRODU              PIC X(4).                      
           10 COD_DIVISA                PIC X(3).                      
           10 NUM_POSICION              PIC X(11).                     
           10 NUM_ORDENJUD              PIC X(11).                     
           10 COD_ORDENJUD              PIC X(3).                      
           10 NUM_ANOAUTO               PIC X(4).                      
           10 NUM_JUZGADO               PIC X(11).                     
           10 IMP_CANCCTO               PIC 9(13)V9(4).                
           10 IMP_CANCGASC              PIC 9(13)V9(4).                
           10 IND_PDTEPROC              PIC X(1).                      
           10 FEC_RENDICIO              PIC X(10).                     
           10 COD_TIPADMINA             PIC X(1).                      
           10 COD_TIPADMIN              PIC X(1).                      
           10 SDO_INTEDOCA              PIC 9(13)V9(4).                
           10 SDO_INTEDOCU              PIC 9(13)V9(4).                