	      02 AGT.
            10 ENTIDAD          PIC X(4).
            10 COD-AGENTE       PIC X(4).
            10 TIP-AGENTE       PIC X(3).
            10 EST-AGENTE       PIC X(1).
            10 DES-AGENTE       PIC X(60).
            10 NUM-CLIENTE      PIC X(8).
            10 FECALTA          PIC X(10).
            10 FEC-ULTLIQ       PIC X(10).
            10 FEC-PROLIQ       PIC X(10).
            10 PER-LIQUIDAC     PIC X(4).
            10 IND-LIQUIDAC     PIC X(1).
            10 TIP-LIQUIDAC     PIC X(1).
            10 TIP-COMISION     PIC X(1).
            10 IND-PLANMAYO     PIC X(1).
            10 COD-DIVISA-TEMP  PIC X(3).
            10 FEC-FINAVAL-TEMP PIC X(10).
            10 COD-DIVISA-PERM  PIC X(3).
            10 FEC-FINAVAL-PERM PIC X(10).
            10 CUP-MAXAVAL      PIC S9(13)V9(4) USAGE COMP-3.
            10 CUP-DISAVAL      PIC S9(13)V9(4) USAGE COMP-3.
            10 CUP-MAXAVAL-TEMP PIC S9(13)V9(4) USAGE COMP-3.
            10 CUP-DISAVAL-TEMP PIC S9(13)V9(4) USAGE COMP-3.
            10 CUP-MAXAVAL-PERM PIC S9(13)V9(4) USAGE COMP-3.
            10 CUP-DISAVAL-PERM PIC S9(13)V9(4) USAGE COMP-3.
            10 NUM-CUENTA       PIC X(12).
            10 COD-OFICINA      PIC X(4).
            10 COD-ENTIDAD      PIC X(4).
            10 DIVISA           PIC X(3).
            10 NUM-CUENTA-ALT   PIC X(12).
            10 COD-OFICINA-ALT  PIC X(4).
            10 COD-ENTIDAD-ALT  PIC X(4).
            10 DIVISA-ALT       PIC X(3).
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 USERID-UMO       PIC X(8).
            10 NETNAME-UMO      PIC X(8).
            10 TIMEST-UMO       PIC X(26).