          02 BKT.
            03  ID-MOV                        PIC 9(08).
            03  FRECUENCIA                    PIC X(01).
            03  PROD-CTBLE                    PIC X(02).
            03  SUBPROD                       PIC X(04).
            03  TIPOINFO                      PIC X(01).
            03  COD-MOV                       PIC 9(02).
            03  SUBCOD-MOV                    PIC 9(02).
            03  FEC-OPERACION                 PIC X(08).
            03  FEC-BAJA                      PIC X(08).
            03  FEC-VTO                       PIC X(08).
            03  FEC-PAGO                      PIC X(08).
            03  DEB-CRED                      PIC X(01).
            03  IMP-ALTA-OPERAC-MO            PIC 9(16)V99.
            03  IMP-OPERAC-SALDO              PIC 9(16)V99.
            03  IMP-OPERAC-ML                 PIC 9(16)V99.
            03  IMP-TIPO-CAMBIO-DIA           PIC 9(05)V9(5).
            03  IMP-TIPO-CAMBIO-OPE           PIC 9(05)V9(5).
            03  ESP-CANT                      PIC 9(16)V99.
            03  ESP-TIPO                      PIC 9(03).
            03  COD-MONEDA                    PIC 9(03).
            03  CTA-TIPO                      PIC 9(01).
            03  CTA-OPERAC                    PIC X(12).
            03  CTA-SUC                       PIC X(04).
            03  ACCOUNTING                    PIC X(15).
            03  NRO-OPERAC                    PIC X(19).
            03  TIPO-OPER                     PIC X(03).
            03  ESTADO                        PIC X(01).
            03  NRO-CORRELATIVO               PIC 9(02).
            03  NRO-CTA-BANCA-PRIVADA         PIC X(08).
            03  NUP                           PIC X(08).
            03  SUC-TRAN                      PIC X(04).
            03  CANAL-TRAN                    PIC X(02).
            03  ENTIDAD-JURID                 PIC X(02).
            03  NRO-BKT                       PIC X(10).
            03  BCO-CORR                      PIC X(30).
            03  BCO-CORR-COD                  PIC X(11).
            03  BCO-CORR-COD-PAIS             PIC X(02).
            03  BCO-CORR-PAIS                 PIC X(35).
            03  BCO-CORR-CIUDAD               PIC X(50).
            03  BCO-CORR-DOM                  PIC X(50).
            03  BENE-EXTERIOR                 PIC X(50).
            03  BENE-COD-PAIS                 PIC X(02).
            03  BENE-DOM                      PIC X(100).
            03  ORIGEN                        PIC X(15).
            03  TIPO-MOV                      PIC X(10).
            03  FEC-PROC                      PIC X(08).
            03  FEC-PROCESO                   PIC X(08).
            03  WRKR-ORIG                     PIC X(07).
            03  WRKR-REL                      PIC X(07).
            03  COMI-MONTO-MIN                PIC 9(16)V9(2).
            03  COMI-MONTO-MAX                PIC 9(16)V9(2).
            03  COMI-PORCENT                  PIC 9(06)V9(7).
            03  ZONA                          PIC X(03).
            03  SEGMENTO                      PIC X(03).
            03  BANCA                         PIC X(03).
            03  BCO-CORR-RIO                  PIC X(11).
            03  BCO-CORR-NOM                  PIC X(30).
            03  BCO-CORR-NOM-COD-PAIS         PIC X(02).
            03  COD-MOVIM                     PIC X(10).
            03  COD-NEMONICO                  PIC X(05).
            03  NOM-CLI                       PIC X(50).
            03  FILLER                        PIC X(449).