	  ******************************************************************
      * COBOL DECLARATION FOR TABLE AALD5.GUDTTRA                      *
      ******************************************************************
       01  WAGUCTRA.
           10 COD_ENTIDAD  PIC X(4).
           10 COD_CENTRO   PIC X(4).
           10 NUM_CONTRATO PIC X(12).
           10 COD_PRODUCTO PIC X(2).
           10 COD_SUBPRODU PIC X(4).
           10 COD_DIVISA   PIC X(3).
           10 COD_ENTIDADD PIC X(4).
           10 COD_CENTROD  PIC X(4).
           10 NUM_CONTRATD PIC X(12).
           10 COD_PRODUCTD PIC X(2).
           10 COD_SUBPRODD PIC X(4).
           10 COD_DIVISAD  PIC X(3).
           10 FEC_TRASPASO PIC X(10).
           10 COD_CENTOPER PIC X(4).
           10 COD_CENTOPED PIC X(4).
           10 FEC_PROCESO  PIC X(10).
           10 TXT_RELLENO  PIC X(44).
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 17      *        
      ******************************************************************        
