	      01 ISEC4060.
            10 PERIODO          PIC  X(06).
            10 EJECUCION        PIC  X(01).
            10 ENTIDAD          PIC  X(04).
            10 CENTRO           PIC  X(04).
            10 CUENTA           PIC  X(12).
            10 PRODUCTO         PIC  X(02).
            10 SUBPRODUCTO      PIC  X(04).
            10 DIVISA           PIC  X(03).
            10 NUP              PIC  X(08).
            10 IMP_PREVISION_CTO    PIC S9(15)V9(02) COMP-3.
            10 POR_PREVISION_CTO    PIC S9(03)V9(02) COMP-3.
            10 IMP_DEUDA_TOT_CTO    PIC S9(15)V9(02) COMP-3.
            10 FILLER                        PIC  X(35).