        01  WARCE003.
               10 IDE_PGO     			PIC X(19).
               10 NRO_EMPR    			PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR  		PIC S9(1)V COMP-3.
               10 NRO_PROD    			PIC S9(3)V COMP-3.
               10 NRO_INSTAN  			PIC S9(2)V COMP-3.
               10 NRO_CLTE    			PIC X(22).
               10 COD_LST_PRE  			PIC S9(5)V COMP-3.
               10 NRO_SUC     			PIC S9(3)V COMP-3.
               10 NRO_BCO_CORRS  		PIC S9(3)V COMP-3.
               10 FEC_PGO     			PIC X(10).
               10 HRA_PGO     			PIC X(8).
               10 COD_FP_COM_3RA  		PIC S9(2)V COMP-3.
               10 TPO_CTA_COM_3RA  		PIC S9(1)V COMP-3.
               10 NRO_SUCCTA_COM_3RA  	PIC S9(3)V COMP-3.
               10 NRO_CTA_COM_3RA  		PIC S9(7)V COMP-3.
               10 NRO_DV_CTA_COM_3RA  	PIC S9(1)V COMP-3.
               10 IMP_PGO_COM_3RA  		PIC S9(13)V9(2) COMP-3.
               10 CAN_DOC     			PIC S9(4)V COMP-3.
               10 TOT_PGO     			PIC S9(13)V9(2) COMP-3.
               10 TOT_INT_PUNI  		PIC S9(13)V9(2) COMP-3.
               10 TOT_BONF    			PIC S9(13)V9(2) COMP-3.
               10 IMP_COTIZ_DL_VEND  	PIC S9(13)V9(2) COMP-3.
               10 IMP_COTIZ_DL_COMP  	PIC S9(13)V9(2) COMP-3.
               10 COD_TRN     			PIC X(4).
               10 IMP_COM_3RA  			PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_3RA_DISCR  	PIC S9(13)V9(2) COMP-3.
               10 IMP_IVA_3RA  			PIC S9(7)V9(2) COMP-3.
               10 IMP_IVA_ADIC_3RA  	PIC S9(7)V9(2) COMP-3.
               10 IMP_ING_BRU_3RA  		PIC S9(7)V9(2) COMP-3.
               10 NOM_CLTE    			PIC X(30).
               10 NRO_CUIT_CLTE  		PIC S9(11)V COMP-3.
               10 COD_ING_BRU  			PIC X(1).
               10 COD_COND_IVA  		PIC X(1).
               10 NRO_COB_INFINITY  	PIC S9(9)V COMP-3.
               10 IMP_COM_EMPR  		PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_EMPR_DISCR  	PIC S9(13)V9(2) COMP-3.
               10 IMP_IVA_EMPR  		PIC S9(7)V9(2) COMP-3.
               10 IMP_IVA_ADIC_EMPR  	PIC S9(7)V9(2) COMP-3.
               10 IMP_ING_BRU_EMPR  	PIC S9(7)V9(2) COMP-3.
               10 NRO_ULT_REND  		PIC S9(5)V COMP-3.
               10 FEC_ULT_REND  		PIC X(10).
               10 COD_EST_RENDICION  	PIC X(1).
               10 CAN_DOC_PDTES_ACR  	PIC S9(4)V COMP-3.
               10 COD_EST_PGO  			PIC X(3).
               10 FEC_EST_PGO  			PIC X(10).
               10 MAR_PROCESAM  		PIC X(1).
               10 FEC_ALTA_ENVIO  		PIC X(10).
               10 NRO_ENVIO   			PIC S9(5)V COMP-3.
               10 NRO_ORIG_INF  		PIC X(19).
               10 CAN_OTR_IMPRE  		PIC S9(4)V COMP-3.
               10 CAN_LIQ     			PIC S9(4)V COMP-3.
               10 CAN_DOC_PDTES_EMIT  	PIC S9(4)V COMP-3.
               10 MAR_INH_BAJA  		PIC X(1).
               10 FEC_BAJA    			PIC X(10).
               10 IDE_USER_BAJA  		PIC X(10).
               10 IDE_USER_ALTA  		PIC X(10).
               10 IDE_TERM_ALTA  		PIC X(10).
               10 FEC_HRA_ULT_MODF  	PIC X(26).
               10 IDE_USER_ULT_MODF  	PIC X(10).
               10 IDE_TERM_ULT_MODF  	PIC X(5).
               10 COD_CANAL          	PIC X(3).
               10 COD_SUB_CANAL      	PIC X(2).
