           01  PEDT082.
               10 PECDGENT    PIC X(4).
               10 PENUMPER    PIC X(8).
               10 PESECNOM    PIC S9(3)V USAGE COMP-3.
               10 PETIPNOM    PIC X(3).
               10 PEUSUALT    PIC X(8).
               10 PEFECALT    PIC X(10).
               10 PEUSUMOD    PIC X(8).
               10 PETERMOD    PIC X(4).
               10 PESUCMOD    PIC X(4).
               10 PEHSTAMP    PIC X(26).
               10 PENOMADI_LEN  PIC S9(4) USAGE COMP.
               10 PENOMADI_TEXT  PIC X(120).