05 BGTCPAB.                                                  
   10 PAB-NUM-CONVENIO     PIC S9(07)     USAGE COMP-3.      
   10 PAB-CONCEPTO         PIC X(04).                        
   10 PAB-PORC-SUSCRIPTOR  PIC S9(3)V9(5) USAGE COMP-3.      
   10 PAB-PORC-ENTIDAD     PIC S9(3)V9(5) USAGE COMP-3.      
   10 PAB-PORC-CLIENTE     PIC S9(3)V9(5) USAGE COMP-3.      
   10 PAB-CCC-SUSCRIPTOR.                                    
      15 PAB-ENTIDAD       PIC X(04).                        
      15 PAB-CENTRO-ALTA   PIC X(04).                        
      15 PAB-CUENTA        PIC X(12).                        
   10 PAB-DIVISA           PIC X(03).                        
   10 PAB-INDESTA          PIC X(01).                        
      88 PAB-INDESTA-A    VALUES 'A'.                        
      88 PAB-INDESTA-D    VALUES 'D'.                        
   10 PAB-FECHA-EST        PIC X(10).                        
   10 PAB-ENTIDAD-UMO      PIC X(04).                        
   10 PAB-CENTRO-UMO       PIC X(04).                        
   10 PAB-USERID-UMO       PIC X(08).                        
   10 PAB-NETNAME-UMO      PIC X(08).                        
   10 PAB-TIMEST-UMO       PIC X(26).           