           02  DST.
               10  LENGTH             PIC S9(08) BINARY.
               10  TENANT-ID          PIC S9(08) BINARY.
               10  CUSTOMER-ID        PIC  X(20).
               10  REC-ID             PIC  X(02).
               10  REC-ID-NUM         PIC  9(02).
               10  REC-SEQ-NUM        PIC  9(02).
               10  SCRD-ID                 PIC S9(04) BINARY.
               10  RAW-SCORE               PIC S9(07) BINARY.
               10  ALIGNED-SCORE           PIC S9(07) BINARY.
               10  CA-SCRD-ID              PIC S9(04) BINARY.
               10  CA-RAW-SCORE            PIC S9(07) BINARY.
               10  CA-ALIGNED-SCORE        PIC S9(07) BINARY.
               10  RV-SCRD-ID              PIC S9(04) BINARY.
               10  RV-RAW-SCORE            PIC S9(07) BINARY.
               10  RV-ALIGNED-SCORE        PIC S9(07) BINARY.
               10  LN-SCRD-ID              PIC S9(04) BINARY.
               10  LN-RAW-SCORE            PIC S9(07) BINARY.
               10  LN-ALIGNED-SCORE        PIC S9(07) BINARY.
               10  MG-SCRD-ID              PIC S9(04) BINARY.
               10  MG-RAW-SCORE            PIC S9(07) BINARY.
               10  MG-ALIGNED-SCORE        PIC S9(07) BINARY.
               10  DP-SCRD-ID              PIC S9(04) BINARY.
               10  DP-RAW-SCORE            PIC S9(07) BINARY.
               10  DP-ALIGNED-SCORE        PIC S9(07) BINARY.
               10  SCRD-ID-HIST            PIC S9(04) BINARY.
               10  RAW-SCORE-HIST          PIC S9(07) BINARY.
               10  ALIGNED-SCORE-HIST      PIC S9(07) BINARY.
               10  CA-SCRD-ID-HIST         PIC S9(04) BINARY.
               10  CA-RAW-SCORE-HIST       PIC S9(07) BINARY.
               10  CA-ALIGNED-SCORE-HIST   PIC S9(07) BINARY.
               10  RV-SCRD-ID-HIST         PIC S9(04) BINARY.
               10  RV-RAW-SCORE-HIST       PIC S9(07) BINARY.
               10  RV-ALIGNED-SCORE-HIST   PIC S9(07) BINARY.
               10  LN-SCRD-ID-HIST         PIC S9(04) BINARY.
               10  LN-RAW-SCORE-HIST       PIC S9(07) BINARY.
               10  LN-ALIGNED-SCORE-HIST   PIC S9(07) BINARY.
               10  MG-SCRD-ID-HIST         PIC S9(04) BINARY.
               10  MG-RAW-SCORE-HIST       PIC S9(07) BINARY.
               10  MG-ALIGNED-SCORE-HIST   PIC S9(07) BINARY.
               10  DP-SCRD-ID-HIST         PIC S9(04) BINARY.
               10  DP-RAW-SCORE-HIST       PIC S9(07) BINARY.
               10  DP-ALIGNED-SCORE-HIST   PIC S9(07) BINARY.
