02  BGCTCPC.                                  
    05 CPC-CLAVE.                             
       10 CPC-CONCEPTO              PIC X(04).
       10 CPC-COMISION              PIC X(04).
       10 CPC-CANAL                 PIC X(02).
       10 CPC-FECHA-DESDE           PIC X(10).
    05 CPC-DATOS.                             
       10 CPC-FECHA-HASTA           PIC X(10).
    05 CPC-STAMP.                             
       10 CPC-ENTIDAD-UMO           PIC X(04).
       10 CPC-CENTRO-UMO            PIC X(04).
       10 CPC-USERID-UMO            PIC X(08).
       10 CPC-NETNAME-UMO           PIC X(08).
       10 CPC-TIMEST-UMO            PIC X(26).