          02  NCC.
            10 ENTIDAD             PIC X(04).
            10 OFICINA             PIC X(04).
            10 CUENTA              PIC X(12).
            10 FELIQ               PIC X(10).
            10 NUMREC              PIC S9(5)V USAGE COMP-3.
            10 FEFIDEV             PIC X(10).
            10 CAPINIRE            PIC S9(13)V9(4) COMP-3.
            10 INTINIRE            PIC S9(13)V9(4) COMP-3.
            10 SALTEOR             PIC S9(13)V9(4) COMP-3.
            10 IMP-INT-DEV         PIC S9(13)V9(4) COMP-3.
            10 ENTIDAD-UMO      PIC X(04).
            10 CENTRO-UMO       PIC X(04).
            10 USERID-UMO       PIC X(08).
            10 NETNAME-UMO      PIC X(08).
            10 TIMEST-UMO       PIC X(26).