       02 UVA.
          10 ENTIDAD            PIC X(04).
          10 OFICINA            PIC X(04).
          10 CUENTA             PIC X(12).
          10 FELIQ              PIC X(10).
          10 ESTADO             PIC X(01).
          10 IMP-DIFERENCIA     PIC S9(13)V9(4) COMP-3.
          10 RECIBOS-PEND       PIC X(04).
          10 ENTIDAD-UMO     PIC X(04).
          10 CENTRO-UMO      PIC X(04).
          10 USERID-UMO      PIC X(08).
          10 NETNAME-UMO     PIC X(08).
          10 TIMESTAMP       PIC X(26).
          10 IND-RECIBO         PIC X(01).
          10 IMP-BENEFICIO      PIC S9(13)V9(4) COMP-3.
          10 IMP-ALTA           PIC S9(13)V9(4) COMP-3.
          10 IMP-ALTA2          PIC S9(13)V9(4) COMP-3.
          10 FEALTA-NVO-PRES    PIC X(10).
