           01  WAPRP055.
               10 NRO_EMPR    			PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR  		PIC S9(1)V COMP-3.
               10 NRO_PROD    			PIC S9(3)V COMP-3.
               10 NRO_INSTAN  			PIC S9(2)V COMP-3.
               10 DES_ACDO    			PIC X(30).
               10 NRO_DDN_TEL  			PIC S9(5)V COMP-3.
               10 NRO_CARAC_TEL  		PIC S9(5)V COMP-3.
               10 NRO_TEL     			PIC S9(7)V COMP-3.
               10 COD_MONE    			PIC S9(1)V COMP-3.
               10 NRO_ENT_ORIG_ACDO  	PIC S9(4)V COMP-3.
               10 NRO_SUC_ORIG_ACDO  	PIC S9(4)V COMP-3.
               10 MAR_COM     			PIC X(1).
               10 MAR_COBR_COM  		PIC X(1).
               10 NRO_ULT_REND  		PIC S9(5)V COMP-3.
               10 MAR_INF_DATANET  		PIC X(1).
               10 MAR_DEUDA   			PIC X(1).
               10 MAR_FORM_PGO  		PIC X(1).
               10 MAR_REND    			PIC X(1).
               10 MAR_RECAU   			PIC X(1).
               10 MAR_PAGO    			PIC X(1).
               10 COD_PLAN_CONTB  		PIC S9(5)V COMP-3.
               10 FEC_ULT_RECEP_DEUD  	PIC X(10).
               10 ESTADO      			PIC X(3).
               10 FEC_ALT_ACDO  		PIC X(10).
               10 FEC_BAJ_ACDO  		PIC X(10).
               10 COD_MOT_BAJ_ACDO  	PIC S9(2)V COMP-3.
               10 MAR_CONFIRMING  		PIC X(1).
               10 MAR_FACTORING  		PIC X(1).
               10 MAR_FLOAT   			PIC X(1).
               10 MAR_CTRL_FIRMA  		PIC X(1).
               10 MAR_FORZ_BATCH  		PIC X(1).
               10 MAR_INH_SOLI_IMPRE  	PIC X(1).
               10 MAR_CTRL_SDO  		PIC X(1).
               10 MAR_USO     			PIC X(1).
               10 IDE_USER_ALTA  		PIC X(10).
               10 IDE_TERM_ALTA  		PIC X(10).
               10 FEC_HRA_ULT_MODF  	PIC X(26).
               10 IDE_USER_ULT_MODF  	PIC X(10).
               10 IDE_TERM_ULT_MODF  	PIC X(5).
               10 MAR_AUT_AUTOMAT 		PIC X(1).
               10 MAR_ENTR_CANAL  		PIC X(1).
               10 MAR_TIPO_DIST   		PIC X(1).
