
      ****************************************************************
      *    COPY GTTCRGO                                              *
      *        TABLA QUE CONTIENE LAS RELACIONES ENTRE LA GARANTIA   *
      *        Y LAS OPERACIONES DE CREDITO.                         *
      *                                                              *
      *    COD-ENTIDAD   :  ENTIDAD                                  *
      *    NUM-GARANTIA  :  N� GARANTIA                              *
      *    NUM-CTACONT   :  N� OPERACION DEL CONTRATO                *
      *    COD-OFICONT   :  OFICINA DEL CONTRATO                     *
      *    COD-ENTCONT   :  ENTIDAD DEL CONTRATO                     *
      *    COD-DIVCONT   :  CODIGO DE DIVISA DEL CONTRATO            *
      *    COD-PRODUCTO  :  CODIGO DE PRODUCTO DEL CONTRATO          *
      *    COD-SUBPROD   :  CODIGO DE SUBPRODUCTO DEL CONTRATO       *
      *    FEC-BAJRELAC  :  FECHA BAJA DE RELACION                   *
      *    FEC-ALTRELAC  :  FECHA ALTA RELACION                      *
      *    TIP-COBERTUR  :  TIPO DE COBERTURA.(GENERICA, ESPECIFICA, *
      *                     PARCIAL,...)                             *
      *    TIP-RELACION  :  TIPO RELACION.(AUTOMATICA, MANUAL, ...)  *
      *    IND-PRINCIPA  :  INDICADOR DE GTIA. PRINCIPAL DE UNA      *
      *                     OPERACION                                *
      *    IMP-DEUDA     :  IMPORTE DEUDA                            *
      *    POR-CUBIERTO  :  PORCENTAJE CUBIERTO                      *
      *    IMP-CUBIERTO  :  IMPORTE CUBIERTO                         *
      *    ENTIDAD-UMO   :  ENTIDAD ULTIMA MODIFICACION              *
      *    CENTRO-UMO    :  CENTRO DE ULTIMA MODIFICACION            *
      *    USERID-UMO    :  USUARIO ULTIMA MODIFICACION              *
      *    NETNAME-UMO   :  TERMINAL ULTIMA MODIFICACION             *
      *    TIMEST-UMO    :  FECHA Y HORA ULTIMA MODIFICACION         *
      ****************************************************************

           02  GTTCRGO.
                   10  RGO_COD_ENTIDAD         PIC X(4).
                   10  RGO_NUM_GARANTIA        PIC S9(9) COMP-3.
                   10  RGO_CONTRATO.
                       15  RGO_NUM_CTACONT     PIC X(12).
                       15  RGO_COD_OFICONT     PIC X(4).
                       15  RGO_COD_ENTCONT     PIC X(4).
                       15  RGO_COD_DIVCONT     PIC X(3).
                       15  RGO_COD_PRODUCTO    PIC X(2).
                       15  RGO_COD_SUBPROD     PIC X(4).
                   10  RGO_FEC_BAJRELAC        PIC X(10).
                   10  RGO_FEC_ALTRELAC        PIC X(10).
                   10  RGO_TIP_COBERTUR        PIC X(3).
                   10  RGO_TIP_RELACION        PIC X(3).
                   10  RGO_IND_PRINCIPA        PIC X(1).
                   10  RGO_IMP_DEUDA           PIC S9(13)V9(4) COMP-3.
                   10  RGO_POR_CUBIERTO        PIC S9(3)V9(6) COMP-3.
                   10  RGO_IMP_CUBIERTO        PIC S9(13)V9(4) COMP-3.
                   10  RGO_ENTIDAD_UMO         PIC X(4).
                   10  RGO_CENTRO_UMO          PIC X(4).
                   10  RGO_USERID_UMO          PIC X(8).
                   10  RGO_NETNAME_UMO         PIC X(8).
                   10  RGO_TIMEST_UMO          PIC X(26).