           01  WAPRP040.
               10 NRO_LISTA   			PIC S9(5)V COMP-3.
               10 NRO_PROD    			PIC S9(3)V COMP-3.
               10 DES_CARAC_COM  		PIC X(20).
               10 TPO_COM     			PIC X(1).
               10 COD_PER_COBR_COM  	PIC X(1).
               10 MAR_DISC_COM  		PIC X(1).
               10 FEC_HRA_ULT_MODF  	PIC X(26).
               10 IDE_USER_ULT_MODF  	PIC X(10).
               10 IDE_TERM_ULT_MODF  	PIC X(5).
               10 TPO_DEBITO  			PIC X(1).
