           01  WAPRP039.
               10 NRO_LISTA          PIC S9(5)V COMP-3.
               10 NRO_PROD           PIC S9(3)V COMP-3.
               10 DES_CARACT_REC     PIC X(20).
               10 MAR_PGO_PARC       PIC X(1).
               10 MAR_ACR_LIN        PIC X(1).
               10 MAR_BCO_CORRS      PIC X(1).
               10 COD_PER_PGO        PIC X(1).
               10 MAR_CPD_CUST       PIC X(1).
               10 NRO_LIM_VTO_CPD    PIC S9(3)V COMP-3.
               10 FEC_HRA_ULT_MODF   PIC X(26).
               10 IDE_USER_ULT_MODF  PIC X(10).
               10 IDE_TERM_ULT_MODF  PIC X(5).
               10 MAR_REDEP_CHEQ     PIC X(1).
               10 MAR_PGO_INTEG      PIC X(1).
               10 PORC_ACEPT_DNF     PIC S9(3)V99 COMP-3.
               10 MAR_ECHEQ_ACEP     PIC X(1).
               10 MAR_ECHEQ_TERCEROS PIC X(1).
               10 MAR_ECHEQ_CLTE     PIC X(1).
               10 MAR_ECHEQ_FACTURA  PIC X(1).
               10 FREC_INT           PIC S9(4)V COMP-3.
