     01 PPC.
     05 NUM-PROPUES                 PIC S9(9) COMP-3.
     05 ENTIDAD                     PIC X(04).
     05 CENTRO-ALTA                 PIC X(04).
     05 NUM-CONTRATO                PIC X(12).
     05 DIVISA                      PIC X(03).
     05 PRODUCTO                    PIC X(02).
     05 SUBPRODU                    PIC X(04).
     05 IND-PARTICIPACION           PIC X.
     05 IND-PROD-INICIO             PIC X.
     05 SALDO-CIERRE                PIC S9(13)V9(2) COMP-3.
     05 FECHA-SALDO                 PIC X(10).
         05 ENTIDAD-UMO             PIC X(04).
         05 CENTRO-UMO              PIC X(04).
         05 USERID-UMO              PIC X(08).
         05 NETNAME-UMO             PIC X(08).
         05 TIMEST-UMO              PIC X(26).