            01  TCDT081.
                 10 FHCAMBIO        PIC X(10).
                 10 CDDIVISS        PIC X(3).
                 10 INDDIVBI        PIC X(1).
                 10 INDCOT          PIC X(1).
                 10 CAMBFIX         PIC S999999V99999 COMP-3.
                 10 CAMBBAJO        PIC S999999V99999 COMP-3.
                 10 CAMBALTO        PIC S999999V99999 COMP-3.
                 10 SEGMENTO        PIC X(3).
                 10 ULTMOD          PIC X(26).
                 10 BANCULMO        PIC S9999V COMP-3.
                 10 OFICULMO        PIC S9999V COMP-3.
                 10 NUMTER          PIC X(4).
                 10 USULTMOD        PIC X(8).
                 10 TCCENTIT        PIC S9999V COMP-3.


