01  BGTCCAC.                                
    05  CAC-CCC.                            
        10  CAC-ENTIDAD         PIC X(4).   
        10  CAC-CENTRO-ALTA     PIC X(4).   
        10  CAC-CUENTA          PIC X(12).  
        10  CAC-DIVISA          PIC X(3).   
    05  CAC-CAMPANIA            PIC X(4).   
    05  CAC-FECHA-DESDE         PIC X(10).  
                                            
    05  CAC-FECHA-HASTA         PIC X(10).  
    05  CAC-STAMP.                          
        10  CAC-ENTIDAD-UMO     PIC X(4).   
        10  CAC-CENTRO-UMO      PIC X(4).   
        10  CAC-USERID-UMO      PIC X(8).   
        10  CAC-NETNAME-UMO     PIC X(8).   
        10  CAC-TIMEST-UMO      PIC X(26).