       ******************************************************************
      * DCLGEN TABLE(BGTCCAC)                                          *
      *        LIBRARY(OPI.CPF.DCLGEN(BGTCCAC))                        *
      *        ACTION(REPLACE)                                         *
      *        APOST                                                   *
      * ... IS THE BGTCCAC COMMAND THAT MADE THE FOLLOWING STATEMENTS   *
      ******************************************************************

      ******************************************************************
      * COBOL DECLARATION FOR TABLE OPIGD1.BGTCCAC                     *
      ******************************************************************
       01 CAC.
           10 ENTIDAD                           PIC X(4).
           10 CENTRO-ALTA                       PIC X(4).
           10 CUENTA                            PIC X(12).
           10 DIVISA                            PIC X(3).
           10 CAMPANIA                          PIC X(4).
           10 FECHA-DESDE                       PIC X(10).
           10 FECHA-HASTA                       PIC X(10).
           10 ENTIDAD-UMO                       PIC X(4).
           10 CENTRO-UMO                        PIC X(4).
           10 USERID-UMO                        PIC X(8).
           10 NETNAME-UMO                       PIC X(8).
           10 TIMEST-UMO                        PIC X(26).
      ******************************************************************
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 12      *
      ******************************************************************.