
        01  S02.
            05  NRO-TARJETA           PIC 9(16).
            05  REL-APLICACION        PIC X(04).
            05  REL-COD-SUC           PIC 9(03).
            05  REL-TIPO-CTA          PIC 9(01).
            05  REL-NRO-CTA           PIC 9(13) COMP-3.
            05  REL-NRO-FIRM          PIC 9(02).
            05  TIPO-CUENTA           PIC 9(01).
            05  CUENTA-TC             PIC 9(11).
            05  COD-SUCURSAL          PIC 9(03).
            05  ESTADO-TARJETA        PIC 9(02).
            05  FECHA-ALTA            PIC 9(08) COMP-3.
            05  MOTIVO-ALTA           PIC 9(01).
            05  NRO-SOLICITUD         PIC 9(11) COMP-3.
            05  CAMPANIA-ID           PIC X(06).
            05  CAMPANIA-NRO-SHOT     PIC 9(02).
            05  VIG-DES-AA            PIC 9(04).
            05  VIG-DES-MM            PIC 9(02).
            05  VIG-HAS-AA            PIC 9(04).
            05  VIG-HAS-MM            PIC 9(02).
            05  ULT-MODIF-FEC         PIC 9(08) COMP-3.
            05  ULT-MODIF-ORIG        PIC X(03).
            05  ULT-MODIF-HORA        PIC 9(06).
            05  ULT-MODIF-USERID      PIC X(08).
            05  TIPO-TARJETA          PIC X.
            05  MARCA-WOMEN           PIC X(1).
            05  FILLER                PIC X(2).
            05  NO-RENOV-MOTIVO       PIC 9(01).
            05  NO-RENOV-FECHA        PIC 9(08) COMP-3.
            05  FEC-BAJA              PIC 9(08) COMP-3.
            05  MOTIVO-BAJA           PIC 9(01).
            05  NRO-CTA-EMP           PIC 9(07) COMP-3.
            05  MCA-HABILIT           PIC 9(01).
            05  MCA-CARGO             PIC 9(01).
            05  APEL-NOMB-EMB         PIC X(24).
            05  COD-CATEGORIA         PIC 9(01).
            05  FEC-INCL-BOLETIN      PIC 9(08) COMP-3.
            05  MOTIVO-INCL-BOLETIN   PIC 9(02).
            05  USERID-ALTA           PIC X(08).
            05  CANAL-VTA             PIC 9(01).
            05  AUTORIZADO-TC         PIC X(01).
            05  MARCA-TC              PIC X(01).
            05  CARGO                 PIC 9(01).
            05  BONIFICACION          PIC X(02).
            05  CUOTAS                PIC X(02).
            05  LINEA4                PIC X(17).
            05  LIM-COMPRAS           PIC 9(3)V99 COMP-3.
            05  LIM-CUOTAS            PIC 9(3)V99 COMP-3.
            05  LIM-ADELANTOS         PIC 9(3)V99 COMP-3.
            05  ESTADO-ACTIVACION     PIC X.
            05  NRO-TARJETA-RELAC     PIC X(16).
            05  FECHA-ACTUAL-WOMEN    PIC 9(08).
            05  FILLER                PIC X(175).
