           01 PEDT029.
               10 PECDGENT              PIC X(4).
               10 PENUMPER              PIC X(8).
               10 PESECCON              PIC S9(4)V COMP-3.
               10 PETIPCON              PIC X(2).
               10 PEIDECON              PIC X(20).
               10 PEFECFIR              PIC X(10).
               10 PEFECVEN              PIC X(10).
               10 PEFECINS              PIC X(10).
               10 PEMARDIG              PIC X(1).
               10 PEINDDAT              PIC X(1).
               10 PEUSUALT              PIC X(8).
               10 PEFECALT              PIC X(10).
               10 PEUSUMOD              PIC X(8).
               10 PETERMOD              PIC X(4).
               10 PESUCMOD              PIC X(4).
               10 PEHSTAMP              PIC X(26).
               10 PEOBSERV_LEN          PIC S9(4) COMP.
               10 PELEGSUP_OBS          PIC X(08).
               10 PEMONFIJ_OBS          PIC 9(13)V9(02).
               10 PEMONINC_OBS          PIC 9(13)V9(02).
               10 PEMONPOR_OBS          PIC 9(05)V9(02).
               10 PEMONTEN_OBS          PIC 9(13)V9(02).
               10 PEMONTOP_OBS          PIC 9(13)V9(02).
               10 PEMONEFE_OBS          PIC 9(13)V9(02).
               10 PESECPLZ_OBS          PIC 9(05).
               10 FILLER                PIC X(25).