       02  TRA.
          10 NUM-CESION            PIC X(08).                          
          10 FILLER                PIC X(16).
          10 ENTIDAD-CARGO         PIC 9(04).                          
          10 SUC-CARGO             PIC 9(04).                          
          10 FILLER                PIC X(01).
          10 COD-PROD-CARGO        PIC 9(02).                      
          10 NRO-CUENTA-CARGO      PIC 9(09).                      
          10 DIVISA-CARGO          PIC X(03).
          10 IMPORTE-CARGO         PIC S9(13)V99 COMP-3.
          10 CONCEPTO-CARGO        PIC X(04).
          10 CODIGO-CARGO          PIC X(04).
          10 ENTIDAD-ABONO         PIC 9(04).                          
          10 SUC-ABONO             PIC 9(04).                          
          10  FILLER               PIC X(01).
          10 COD-PROD-ABONO        PIC 9(02).                      
          10 NRO-CUENTA-ABONO      PIC 9(09).                      
          10 DIVISA-ABONO          PIC X(03).
          10 IMPORTE-ABONO         PIC S9(13)V99 COMP-3.
          10 CODIGO-ABONO          PIC X(04).
          10 COMPROBANTE           PIC 9(08) COMP-3.
          10 FECHA-HOY             PIC X(10).
          10 HORA-HOY              PIC X(08).
          10 CANAL                 PIC X(02).
          10 ESTADO                PIC X.
          10 TRANSAC               PIC X(04).
          10 USUARIO               PIC X(08).
          10 VAL-LIM               PIC X(01).
          10 NUP                   PIC 9(08).
          10 FECHA-VALOR           PIC X(10).
          10 TERMINAL              PIC X(4).
          10 CENTRO-CONTAB         PIC X(4).
          10 IDENT-OPER-CONTAB     PIC X(04).
          10 ID-UNICO-TRANSF       PIC X(25).
          10 ESTADO-TRANSF         PIC X(1).
          10 FILLER                PIC X(30).
          10 TIMESTAMP             PIC X(26).
