            02  RSP.                                                      
               10  LENGTH                    PIC S9(08) BINARY.           
               10  SUBJECT-CODE              PIC X(01).
               10  TENANT-ID                 PIC S9(08) BINARY.           
               10  ID                        PIC S9(03) BINARY.           
               10  PROC-MODE                 PIC X(10).
               10  COMP-EST-EXPT-ID          PIC X(05).
               10  PROC-DATE-CYMD            PIC 9(08) BINARY.
               10  CUSTOMER-ID               PIC X(20).
               10  PREV-CUSTOMER-ID          PIC X(20).
               10  ACCOUNT-ID                PIC X(20).
               10  PREV-ACCOUNT-ID           PIC X(20).
               10  CALL-TYPE                 PIC X(01).
               10  SAMPL-FTR                 PIC S9(06) BINARY.
               10  CO-PROD-TYPE              PIC 9(01).
               10  VERIFICATION-ID           PIC X(33).
               10  SP-LENGTH                 PIC S9(08) BINARY.
               10  SP-SUBJECT-CODE           PIC X(01).
               10  SP-SUBSEGMENT-CODE        PIC X(01).
               10  SP-SCORE-TYPE             PIC 9(02).
               10  SP-SCORE-METHOD           PIC X(01).
               10  SP-PERF-DEFN              PIC X(01).
               10  SP-PERF-WINDOW            PIC S9(02) BINARY.
               10  SP-MAX-DELQ               PIC 9(01).
               10  SP-GOOD-BAD-IND           PIC X(01).
               10  SP-ORIG-BAL               PIC S9(09) BINARY.
               10  SP-AMT-RECOVERED          PIC S9(09) BINARY.
               10  SP-GOOD-BAD-SCHEME        PIC 9(01).
               10  FILLER                    PIC X(17).
