          ******************************************************************
          * INGRESOS PERSONAS FISICAS                                      *
          * LARGO DEL REGISTRO = 108                                       *
          ******************************************************************
           02 PEDT036.
                   10 PECDGENT         PIC X(04).
                   10 PENUMPER         PIC X(08).
                   10 PETIPING         PIC X(03).
                   10 PEFECING         PIC X(10).
                   10 PECODMON         PIC X(03).
                   10 PEIMPING         PIC S9(18)V9(2).
                   10 PEIMPHAS         PIC S9(18)V9(2).
                   10 PEUSUALT         PIC X(08).
                   10 PEFECALT         PIC X(10).
                   10 PEUSUMOD         PIC X(08).
                   10 PETERMOD         PIC X(04).
                   10 PESUCMOD         PIC X(04).
                   10 PEHSTAMP         PIC X(26).

