           01  WAPRP035.
                   10 IDE_PGO_ORIGEN  PIC X(19).
                   10 COD_FORM_PGO  PIC S9(2)V COMP-3.
                   10 COD_MONE    PIC S9(1)V COMP-3.
                   10 NRO_INSTR   PIC X(31).
                   10 IDE_PGO_DESTINO  PIC X(19).
                   10 TPO_RELACION  PIC X(4).
                   10 NRO_EMPR_ORIGEN  PIC S9(11)V COMP-3.
                   10 NRO_DIG_ORIGEN  PIC S9(1)V COMP-3.
                   10 NRO_PROD_ORIGEN  PIC S9(3)V COMP-3.
                   10 NRO_INSTAN_ORIGEN  PIC S9(2)V COMP-3.
                   10 NRO_EMPR_DESTINO  PIC S9(11)V COMP-3.
                   10 NRO_DIG_DESTINO  PIC S9(1)V COMP-3.
                   10 NRO_PROD_DESTINO  PIC S9(3)V COMP-3.
                   10 NRO_INSTAN_DESTINO  PIC S9(2)V COMP-3.
                   10 FEC_PGO_ORIGEN  PIC X(10).
                   10 FEC_PGO_DESTINO  PIC X(10).
                   10 NRO_CUIT_CLTE  PIC S9(11)V COMP-3.
                   10 COD_EST_RELACION  PIC X(3).
                   10 MAR_DEPU_ORIGEN  PIC X(1).
                   10 MAR_DEPU_DESTINO  PIC X(1).
                   10 IDE_USER_ALTA  PIC X(10).
                   10 IDE_TERM_ALTA  PIC X(10).
                   10 TIM_ULT_MODF  PIC X(26).
                   10 IDE_USER_ULT_MODF  PIC X(10).
                   10 IDE_TERM_ULT_MODF  PIC X(5).
