      *****************************************************************
      *                                                               *
      *                                                               *
      *    GTTCCBI _ TABLA DE CODIGOS DE BIENES.                      *
      *                                                               *
      *_______________________________________________________________*
      *                                                               *
      *    LONGITUD: 164 POSICIONES.                                  *
      *    PREFIJO: CBI.                                              *
      *                                                               *
      *****************************************************************
       01  GTTCCBI.
               10  CBI_COD_ENTIDAD         PIC X(04).
               10  CBI_COD_BIEN            PIC X(03).
               10  CBI_COD_BANCLOC         PIC X(03).
               10  CBI_COD_BANCESP         PIC X(03).
               10  CBI_DES_LARGA           PIC X(50).
               10  CBI_DES_CORTA           PIC X(15).
               10  CBI_FEC_INICIO          PIC X(10).
               10  CBI_FEC_FIN             PIC X(10).
               10  CBI_TIP_DATOSCOM        PIC X(03).
               10  CBI_PER_INSCRIPC        PIC X(04).
               10  CBI_PER_TASACION        PIC X(04).
               10  CBI_PER_INSPECIO        PIC X(04).
               10  CBI_IND_PUBLICAC        PIC X(01).
               10  CBI_ENTIDAD_UMO         PIC X(04).
               10  CBI_CENTRO_UMO          PIC X(04).
               10  CBI_USERID_UMO          PIC X(08).
               10  CBI_NETNAME_UMO         PIC X(08).
               10  CBI_TIMEST_UMO          PIC X(26).

