01  TBGB001.                                                  
    10 SUSCRIPTOR           PIC X(11).                           
    10 DES-SUSCRIPTOR       PIC X(30).                           
    10 TPO-SUSCRIPTOR       PIC X(1).                            
    10 ENTIDAD              PIC X(4).                            
    10 CENTRO-ALTA          PIC X(4).                            
    10 CUENTA               PIC X(12).                           
    10 DIVISA               PIC X(3).                            
    10 ENTIDAD-UMO          PIC X(4).                            
    10 CENTRO-UMO           PIC X(4).                            
    10 USERID-UMO           PIC X(8).                            
    10 NETNAME-UMO          PIC X(8).                            
    10 TIMEST-UMO           PIC X(26). 