           01  WAPRP038.
               10 NRO_EMPR    			PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR  		PIC S9(1)V COMP-3.
               10 NRO_PROD    			PIC S9(3)V COMP-3.
               10 NRO_INSTAN  			PIC S9(2)V COMP-3.
               10 IDE_TAB_CARAC  		PIC S9(5)V COMP-3.
               10 NRO_LISTA   			PIC S9(5)V COMP-3.
               10 NRO_NUE_LISTA  		PIC S9(5)V COMP-3.
               10 FEC_VIGENCIA  		PIC X(10).
               10 IDE_USER_ALTA  		PIC X(10).
               10 IDE_TERM_ALTA  		PIC X(10).
               10 FEC_HRA_ULT_MODF  	PIC X(26).
               10 IDE_USER_ULT_MODF  	PIC X(10).
               10 IDE_TERM_ULT_MODF  	PIC X(5).
