           01 069.
               10 EMPRESA              PIC S9999V COMP-3.
               10 HAPLAN               PIC X(3).
               10 FECHA                PIC X(10).
               10 NUMCTA1              PIC X(15).
               10 NUMCTA2              PIC X(15).
               10 SIGNO                PIC X(1).
               10 ACUMSALD             PIC X(1).
               10 PORZONAA             PIC S9(3)V99 COMP-3.
               10 PORZONAB             PIC S9(3)V99 COMP-3.
               10 PORZONAC             PIC S9(3)V99 COMP-3.
