       02 COD.
         10 COD-ENTIDAD         PIC X(4).
         10 COD-TIPO            PIC X(2).
         10 COD-CODIGO          PIC X(3).
         10 DES-TEXTOLAR        PIC X(50).
         10 DES-TEXTORED        PIC X(15).
         10 ENTIDAD-UMO         PIC X(4).
         10 CENTRO-UMO          PIC X(4).
         10 USERID-UMO          PIC X(8).
         10 NETNAME-UMO         PIC X(8).
         10 TIMEST-UMO          PIC X(26).