           01  WARCE004.
                   10 IDE_PGO     PIC X(19).
                   10 COD_FORM_PGO  PIC S9(2)V COMP-3.
                   10 COD_MONE    PIC S9(1)V COMP-3.
                   10 NRO_INSTR   PIC X(31).
                   10 NRO_EMPR    PIC S9(11)V COMP-3.
                   10 NRO_DIG_EMPR  PIC S9(1)V COMP-3.
                   10 NRO_PROD    PIC S9(3)V COMP-3.
                   10 NRO_INSTAN  PIC S9(2)V COMP-3.
                   10 NRO_CLTE    PIC X(22).
                   10 FEC_ACRED   PIC X(10).
                   10 IMP         PIC S9(13)V9(2) COMP-3.
                   10 FEC_ACRED_OLD  PIC X(10).
                   10 IMP_OLD     PIC S9(13)V9(2) COMP-3.
                   10 MAR_ACRED   PIC X(1).
                   10 COD_APLIC   PIC X(4).
                   10 COD_MOT_RECHAZO  PIC X(3).
                   10 NRO_SEC_MOVIM  PIC S9(2)V COMP-3.
                   10 FEC_MOVIM   PIC X(10).
                   10 FEC_VTO_CPD  PIC X(10).
                   10 CAN_DIA_DIFE  PIC S9(4)V COMP-3.
                   10 COD_NO_A_LA_ORDEN  PIC X(3).
                   10 MAR_CONFIRMING  PIC X(1).
                   10 MAR_FLOAT   PIC X(1).
                   10 COD_EST_INSTR  PIC X(3).
                   10 FEC_EMISION_CALC  PIC X(10).
                   10 MAR_SOLI_IMPRE  PIC X(1).
                   10 FEC_EMISION  PIC X(10).
                   10 MAR_CUADRE  PIC X(1).
                   10 FEC_CUADRE  PIC X(10).
                   10 NRO_EMISION  PIC S9(8)V COMP-3.
                   10 NRO_SUC_DIST  PIC X(3).
                   10 TPO_DIST    PIC X(3).
                   10 NRO_EMPR_DIST  PIC S9(5)V COMP-3.
                   10 FEC_ALTA_ENVIO  PIC X(10).
                   10 NRO_ENVIO   PIC S9(5)V COMP-3.
                   10 FEC_TOPE_PROCESAM  PIC X(10).
                   10 NRO_CUIT_CLTE  PIC S9(11)V COMP-3.
                   10 NOM_CLTE    PIC X(30).
                   10 FEC_DEB     PIC X(10).
                   10 COD_EST_DEB  PIC X(3).
                   10 MAR_SOLI_RESCATE  PIC X(1).
                   10 FEC_GEST_RESC_BAJ  PIC X(10).
                   10 IDE_CTA_DEB_CRED  PIC X(31).
                   10 IMP_COTIZ_DL_VEND  PIC S9(13)V9(2) COMP-3.
                   10 IMP_COTIZ_DL_COMP  PIC S9(13)V9(2) COMP-3.
                   10 MAR_NEGOCIADO  PIC X(1).
                   10 FEC_VTO_EMISION  PIC X(10).
                   10 NOM_EMPR_CHEQ  PIC X(30).
                   10 MAR_INH_SOLI_IMPRE  PIC X(1).
                   10 MAR_INTERFACE  PIC X(1).
                   10 FEC_INTERFACE  PIC X(10).
                   10 COD_EST_REND  PIC X(3).
                   10 IDE_USER_ALTA  PIC X(10).
                   10 IDE_TERM_ALTA  PIC X(10).
                   10 FEC_HRA_ULT_MODF  PIC X(26).
                   10 IDE_USER_ULT_MODF  PIC X(10).
                   10 IDE_TERM_ULT_MODF  PIC X(5).
                   10 NRO_SUC_ORIG_MOVIM  PIC S9(3)V COMP-3.
                   10 MAR_ACRED_INTE  PIC X(1).
                   10 NOM_BENF_CHEQ  PIC X(60).
                   10 FEC_EST_INSTR  PIC X(10).
                   10 COD_MOT_REND       PIC X(03).
