           02 PEDT007.
               10 PECDGENT         PIC X(04).
               10 PENUMPER         PIC X(08).
               10 PENUMREL         PIC X(08).
               10 PECODREL         PIC X(03).
               10 PEPORPAR         PIC S9(03)V99 COMP-3.
               10 PEPORUTI         PIC S9(03)V99 COMP-3.
               10 PERELPRI         PIC X(01).
               10 PEUSUALT         PIC X(08).
               10 PEFECALT         PIC X(10).
               10 PEUSUMOD         PIC X(08).
               10 PETERMOD         PIC X(04).
               10 PESUCMOD         PIC X(04).
               10 PEHSTAMP         PIC X(26).
               10 PEOBSERV_LEN     PIC S9(04) COMP.
               10 PEOBSERV_TEXT    PIC X(240).