          02  NMA.
            10 ENTIDAD             PIC X(04).
            10 OFICINA             PIC X(04).
            10 CUENTA              PIC X(12).
            10 CODCONLI            PIC X(03).
            10 IMP-COMISION        PIC S9(13)V9(4) COMP-3.
            10 SALININIIF          PIC S9(13)V9(4) COMP-3.
            10 CFTEA-NIIF          PIC S9(3)V9(6)  COMP-3.
            10 IMPDEV-ACUM         PIC S9(13)V9(4) COMP-3.
            10 FEUDEV              PIC X(10).
            10 ENTIDAD-UMO      PIC X(04).
            10 CENTRO-UMO       PIC X(04).
            10 USERID-UMO       PIC X(08).
            10 NETNAME-UMO      PIC X(08).
            10 TIMEST-UMO       PIC X(26).
