       03 WAAPE684.
              05 PECONPER             PIC X(03).
              05 O-LETRA              PIC X(01).
              05 PECODACT             PIC X(08).
              05 CANTIDAD-BAL         PIC  9.
              05 VTA-TOT-ANUAL        PIC S9(13).
              05 OBS-REPETIDO         PIC X(08).
              05 OBS-CLANAE           PIC X(30).
              05 OBS-DESTINO          PIC X(24).
              05 TIPO-ERROR           PIC X(01).
              05 TIPO-ACCION          PIC X(01).
              05 FILLER               PIC X(03).
              05 ERR-BAL1             PIC X(01).
              05 ERR-BAL2             PIC X(01).
              05 ERR-BAL3             PIC X(01).
              05 OBS-BALANCE          PIC X(38).
              05 DEUDA-TOT-CLI        PIC 9(15)V99.