      ******************************************************************        
      * INTERFAZ A RIO 46                                              *        
      * DATOS DE LA MDDTCAN                                            *        
      ******************************************************************        
       02  MDEC160N.                                                            
           10 COD_ENTIGEN               PIC X(4).                      
           10 IDF_CANCELAC              PIC X(24).                     
           10 FEC_CAN_OPER              PIC X(10).                     
           10 FEC_CAN_VALO              PIC X(10).                     
           10 COD_ESTCANCE              PIC X(1).                      
           10 IND_TIPCANCE              PIC X(1).                      
           10 COD_TIPCANCE              PIC X(2).                      
           10 COD_CANAL                 PIC X(2).                      
           10 COD_CENTCANC              PIC X(4).                      
           10 COD_OFICCANC              PIC X(4).                      
           10 COD_USRCANC               PIC X(8).                      
           10 COD_DIVIORIG              PIC X(3).                      
           10 IMP_TOTCANCO              PIC 9(13)V9(4).                
           10 IMP_CAPITALO              PIC 9(13)V9(4).                
           10 IMP_INTERESO              PIC 9(13)V9(4).                
           10 IMP_IMPUESO               PIC 9(13)V9(4).                
           10 TIP_CBIOCANC              PIC 9(5)V9(8).                 
           10 NUM_BOLETO                PIC 9(15).                     
           10 IMP_TOTCANC               PIC 9(13)V9(4).                
           10 IMP_CAPITALC              PIC 9(13)V9(4).                
           10 IMP_INTERESC              PIC 9(13)V9(4).                
           10 IMP_IMPUESC               PIC 9(13)V9(4).                
           10 COD_FORMPAGO              PIC X(2).                      
           10 COD_DIVIFPGO              PIC X(3).                      
           10 COD_ENTICTA               PIC X(4).                      
           10 COD_CENTCTA               PIC X(4).                      
           10 NUM_CUENTA                PIC X(12).                     
           10 IDF_NIO_MIR               PIC X(24).                     
           10 IDF_NIO_DOS               PIC X(24).                     
           10 IDF_NIO_TRES              PIC X(24).                     
           10 NUM_PERSONA               PIC 9(8).                      
           10 NUM_QUITA                 PIC 9(11).                     
           10 NUM_PROPPAGO              PIC X(11).                     
           10 NUM_PAGOEEJJ              PIC X(11).                     
           10 NUM_PROPCIE               PIC X(18).                     
           10 NUM_BUFETE                PIC X(8).                      
           10 COD_ENTIDADP              PIC X(4).                      
           10 COD_CENTROP               PIC X(4).                      
           10 NUM_PP                    PIC 9(10).                     
           10 COD_GESTOR                PIC X(4).                      