          2 MPA.
            10 ENTIDAD              PIC X(4).
            10 CENTRO-ALTA          PIC X(4).
            10 PAQUETE              PIC X(12).
            10 PRODUCTO-PAQ         PIC X(2).
            10 SUBPRODU-PAQ         PIC X(4).
            10 ENTIDAD-INV          PIC X(4).
            10 CENTRO-INV           PIC X(4).
            10 CUENTA-INV           PIC X(12).
            10 ENTIDAD-CONTAB       PIC X(4).
            10 CENTRO-CONTAB        PIC X(4).
            10 COD-PLAN             PIC X(4).
            10 INDESTA              PIC X(1).
            10 COD-SOP-EXT          PIC X(1).
            10 PCO-ECU-FHPR         PIC X(10).
            10 FECHA-ALTA           PIC X(10).
            10 FECHA-CANCEL         PIC X(10).
            10 FECHA-UPGRADE        PIC X(10).
            10 FECHA-DOWNGR         PIC X(10).
            10 IND-INHAB-SBRG       PIC X(1).
            10 COD-ENVIO-MOV        PIC X(1).
            10 CALPAR-ENVIO-MOV     PIC X(2).
            10 ORDPAR-ENVIO-MOV     PIC S9(3) COMP-3.
            10 ENTIDAD-UMO          PIC X(4).
            10 CENTRO-UMO           PIC X(4).
            10 USERID-UMO           PIC X(8).
            10 NETNAME-UMO          PIC X(8).
            10 TIMEST-UMO           PIC X(26).