           02  PEDT211.
               10 PECDGENT             PIC X(4).
               10 PENUMPER             PIC X(8).
               10 PETIPPIC             PIC X(3).
               10 PEFECDES             PIC X(10).
               10 PENUMPIC             PIC X(18).
               10 PEFECHAS             PIC X(10).
               10 PEFECACT             PIC X(10).
               10 PEUSUALT             PIC X(8).
               10 PEFECALT             PIC X(10).
               10 PEUSUMOD             PIC X(8).
               10 PETERMOD             PIC X(4).
               10 PESUCMOD             PIC X(4).
               10 PEHSTAMP             PIC X(26).