          02 MRC.
            10 CUENTA           PIC X(12).
            10 OFICINA          PIC X(4).
            10 ENTIDAD          PIC X(4).
            10 FELIQ            PIC X(10).
            10 NIO              PIC X(24).
            10 CODCONLI         PIC X(3).
            10 COD-CONCPASO     PIC X(3).
            10 TIPOCPTO-ASOC    PIC X(1).
            10 TIPOCPTO         PIC X(1).
            10 COD-DIVISA       PIC X(3).
            10 IMP-RECUPERA     PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP-BASE         PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP-CAMBDIVL     PIC S9(6)V9(5) USAGE COMP-3.
            10 IMP-CAMBDIVI     PIC S9(6)V9(5) USAGE COMP-3.
            10 POR-ALICUOTA     PIC S9(3)V9(6) USAGE COMP-3.
            10 IND-LIQIMPUE     PIC X(1).
            10 INDRETRO            PIC X(1).
            10 FECRETRO            PIC X(10).
            10 ENTIDAD-RETRO    PIC X(4).
            10 CENTRO-RETRO     PIC X(4).
            10 USERID-RETRO     PIC X(8).
            10 NETNAME-RETRO    PIC X(8).
            10 TIMESTAMP-RETRO  PIC X(26).
            10 FEOPER              PIC X(10).
            10 FECONTA             PIC X(10).
            10 FEVALOR             PIC X(10).
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 USERID-UMO       PIC X(8).
            10 NETNAME-UMO      PIC X(8).
            10 TIMESTAMP        PIC X(26).