           01  COB.
               10  ENTIDAD         		PIC X(04).
               10  CENTRO_ALTA     		PIC X(04).
               10  CUENTA          		PIC X(12).
               10  CODIGO              	PIC X(04).
               10  MOTIVO              	PIC X(2).
               10  OBSERVA             	PIC X(40).
               10  IND_TIPALTA         	PIC X(01).
               10  FECHA_VENC          	PIC X(10).
               10  FECHA_ALTA          	PIC X(10).
               10  ENTIDAD_UMO          PIC X(04).
               10  CENTRO_UMO           PIC X(04).
               10  USERID_UMO           PIC X(08).
               10  NETNAME_UMO          PIC X(08).
               10  TIMEST_UMO           PIC X(26).