                02  WARCE001.
                   10 NRO_EMPR              PIC S9(11)V COMP-3.
                   10 NRO_DIG_EMPR          PIC S9(1)V COMP-3.
                   10 NRO_PROD              PIC S9(3)V COMP-3.
                   10 NRO_INSTAN            PIC S9(2)V COMP-3.
                   10 NRO_CLTE              PIC X(15).
                   10 TPO_CPRB              PIC X(2).
                   10 NRO_CPRB              PIC X(15).
                   10 NRO_CUO               PIC X(4).
                   10 FEC_HRA_ALTA_DEUD     PIC X(26).
                   10 NOM_CLTE              PIC X(30).
                   10 DES_DIRE              PIC X(30).
                   10 DES_LOC               PIC X(20).
                   10 COD_PREF_CPOST        PIC X(1).
                   10 NRO_CPOST             PIC S9(5)V COMP-3.
                   10 COD_UBIC_CPOST        PIC X(3).
                   10 NRO_CUIT_CLTE         PIC S9(11)V COMP-3.
                   10 ING_BRUTOS            PIC X(1).
                   10 COD_COND_IVA          PIC X(1).
                   10 FEC_1ER_VTO           PIC X(10).
                   10 IMP_1ER_VTO           PIC S9(13)V9(2) COMP-3.
                   10 FEC_2DO_VTO           PIC X(10).
                   10 IMP_2DO_VTO           PIC S9(13)V9(2) COMP-3.
                   10 FEC_HASTA_DSCTO       PIC X(10).
                   10 IMP_PRONTO_PAGO       PIC S9(13)V9(2) COMP-3.
                   10 FEC_HASTA_PUNIT       PIC X(10).
                   10 TSA_PUNI              PIC S9(4)V9(2) COMP-3.
                   10 MAR_EXCEP_3RA         PIC X(1).
                   10 COD_FORM_PGO          PIC X(10).
                   10 IMP_DESCTO            PIC S9(13)V9(2) COMP-3.
                   10 IMP_INT_DEVEN         PIC S9(13)V9(2) COMP-3.
                   10 MON_SDO_ACT           PIC S9(13)V9(2) COMP-3.
                   10 FEC_ULT_PGO           PIC X(10).
                   10 TOT_SDO_ACT           PIC S9(13)V9(2) COMP-3.
                   10 COD_CONCEPT           PIC X(3).
                   10 DES_DOC               PIC X(40).
                   10 OBS_LIBR_1ER          PIC X(18).
                   10 OBS_LIBR_2DA          PIC X(15).
                   10 OBS_LIBR_3RA          PIC X(15).
                   10 OBS_LIBR_4TA          PIC X(15).
                   10 OBS_LIBR_5TA          PIC X(15).
                   10 NRO_PROX_REND         PIC S9(5)V COMP-3.
                   10 TPO_INGRESO           PIC X(1).
                   10 FEC_ALTA              PIC X(10).
                   10 NRO_ENVIO             PIC S9(5)V COMP-3.
                   10 FEC_HRA_ULT_MODF      PIC X(26).
                   10 IDE_USER_ULT_MODF     PIC X(8).
                   10 IDE_TERM_ULT_MODF     PIC X(5).
                   10 COD_MONE              PIC S9(1)V COMP-3.
                   10 COD_CANAL_FPAGO       PIC X(30).

