
           01 WAPRP057.
                 10 NRO_ORGANISMO         PIC  9(17).
                 10 NRO_REND              PIC  9(5).
                 10 TPO_REG               PIC  X.
                 10 IDE_REG               PIC  X(19).
                 10 SEC_IDE_REG           PIC  9.
                 10 FEC_REND              PIC  X(08).
                 10 RAZ_SOC               PIC  X(30).
                 10 FILLER                         PIC  X(319).
                 10 CAN_REG               PIC  9(10).
                 10 CANT_PGOS_REND        PIC  9(10).
                 10 TOT_IMP_REND          PIC  9(13)V99.
                 10 ACUM_COM_DEVG         PIC  9(13)V99.
                 10 TOT_IMP_COM_COB       PIC  9(13)V99.
                 10 TOT_IMP_COM_DEVG      PIC  9(13)V99.
                 10 FILLER1                         PIC  X(277).
                 10 NRO_CLTE              PIC  X(22).
                 10 NOM_CLTE              PIC  X(30).
                 10 NRO_CUIT_CLTE         PIC  9(11).
                 10 FEC_PGO               PIC  X(08).
                 10 HRA_PGO               PIC  X(08).
                 10 CAN_DOC               PIC  9(02).
                 10 CAN_DOC_PDTES_ACR     PIC  9(02).
                 10 TOT_PGO               PIC  9(13)V99.
                 10 IMP_COM_EMPR          PIC  9(13)V99.
                 10 IMP_COTIZ_DL_VEND     PIC  9(13)V99.
                 10 IMP_COTIZ_DL_COMP     PIC  9(13)V99.
                 10 CANT_RETENCION        PIC  9(10).
                 10 CANT_LIQUIDACION      PIC  9(10).
                 10 FEC_ALTA_LOTE         PIC  X(08).
                 10 NRO_ENVIO             PIC  9(05).
                 10 NRO_ORIG_INF          PIC  X(19).
                 10 TOT_IMP_PUNI          PIC  9(13)V99.
                 10 TOT_BONF              PIC  9(13)V99.
                 10 COD_CANAL             PIC  X(03).
                 10 COD_SUB_CANAL         PIC  X(02).
                 10 FILLER2                         PIC  X(127).
                 10 DES_FORM_PGO          PIC  X(08).
                 10 NRO_INSTR             PIC  X(31).
                 10 IMP                   PIC  9(13)V99.
                 10 FEC_ACRED             PIC  X(08).
                 10 MAR_ACREDITACION      PIC  X.
                 10 FEC_VTO_CPD           PIC  X(8).
                 10 COD_NO_A_LA_ORDEN     PIC  9(3).
                 10 MAR_CONFIRMING        PIC  X(1).
                 10 MAR_FLOAT             PIC  X(1).
                 10 COD_EST_INSTR         PIC  X(3).
                 10 FEC_EMISION           PIC  X(8).
                 10 NRO_EMISION           PIC  X(8).
                 10 NRO_SUC_DIST          PIC  X(3).
                 10 TPO_DIST              PIC  X(3).
                 10 FEC_DEB               PIC  X(08).
                 10 COD_PAIS_CD           PIC  9(04).
                 10 COD_MONE_CD           PIC  9(01).
                 10 COD_ENT_CBU1_CD       PIC  9(04).
                 10 COD_SUC_CBU1_CD       PIC  9(04).
                 10 NRO_DV_CBU1_CD        PIC  9(01).
                 10 NRO_FIJ_CBU2_CD       PIC  9(03).
                 10 TPO_CTA_CBU2_CD       PIC  9(01).
                 10 COD_MONE_CBU2_CD      PIC  9(01).
                 10 NRO_CTA_CBU2_CD       PIC  9(11).
                 10 NRO_DV_CBU2_CD        PIC  9(01).
                 10 COD_FORM_PGO          PIC  X(02).
                 10 COD_MOT_RECHAZO       PIC  X(03).
                 10 FILLER3                         PIC  X(212).
                 10 TPO_CPRB              PIC  X(02).
                 10 NRO_CPRB              PIC  X(31).
                 10 NRO_CUO               PIC  X(04).
                 10 FEC_VTO               PIC  X(08).
                 10 TSA_PUNI              PIC  9(3)V99.
                 10 IMP_DEUDA             PIC  9(13)V99.
                 10 IMP_PUNI              PIC  9(13)V99.
                 10 IMP_DTO               PIC  9(13)V99.
                 10 IMP_PGO               PIC  9(13)V99.
                 10 OBS_LIBR_1ER          PIC  X(18).
                 10 OBS_LIBR_2DA          PIC  X(15).
                 10 OBS_LIBR_3RA          PIC  X(15).
                 10 FILLER4                         PIC  X(199).
                 10 COD_CPTO           PIC 9(5).
                 10 NRO_SEC_CPTO       PIC 9(2).
                 10 IMP_COTIZ_DL_V_CA  PIC 9(13)V9(2).
                 10 IMP_COTIZ_DL_C_CA  PIC 9(13)V9(2).
                 10 IMP_CPTO           PIC 9(13)V9(2).
                 10 IMP_CPTO_DISCR     PIC 9(13)V9(2).
                 10 IMP_IVA            PIC 9(7)V9(2).
                 10 IMP_IVA_ADIC       PIC 9(7)V9(2).
                 10 IMP_ING_BRU        PIC 9(7)V9(2).
                 10 FEC_MOVIM          PIC X(08).
                 10 FILLER5                         PIC  X(255).
                 10 TIPO_DOCU             PIC  X(03).
                 10 NRO_DOCU              PIC 9(11).
                 10 TIPO_DOCU_1           PIC  X(03).
                 10 NRO_DOCU_1            PIC 9(11).
                 10 TIPO_DOCU_2           PIC  X(03).
                 10 NRO_DOCU_2            PIC 9(11).
                 10 SUC_DIST              PIC 9(04).
                 10 TPO_RECIBO            PIC  X(03).
                 10 NRO_SECU_DOM          PIC 9(05).
                 10 FILLER6                         PIC X(303).
