           02  PEDT006.                                                                                                            
               10 PECDGENT       PIC X(4).                                    
               10 PENUMPER       PIC X(8).                                    
               10 PENUMSEC       PIC S9(3)V COMP-3.                                                                        
               10 PECODREF       PIC X(3).                                    
               10 PETIPREF       PIC X(3).                                    
               10 PEIDEPER       PIC X(20).                                   
               10 PETIPENT       PIC X(5).                                    
               10 PECODEMI       PIC X(4).                                    
               10 PEFECACS       PIC X(10).                                   
               10 PEFECBCS       PIC X(10).                                   
               10 PELIMTAR       PIC S9(16)V9(2) COMP-3.                
               10 PEPLADUR       PIC S9(3)V COMP-3.                     
               10 PEMONASI       PIC S9(16)V9(2) COMP-3.                
               10 PESALDEU       PIC S9(16)V9(2) COMP-3.                
               10 PEDESFON       PIC X(2).                                    
               10 PECRESTA       PIC X(3).                                    
               10 PECODMON       PIC X(3).                                    
               10 PECODSUC       PIC X(4).                                    
               10 PEUSUALT       PIC X(8).                                    
               10 PEFECALT       PIC X(10).                                   
               10 PEUSUMOD       PIC X(8).                                    
               10 PETERMOD       PIC X(4).                                    
               10 PESUCMOD       PIC X(4).                                    
               10 PEHSTAMP       PIC X(26).                                                                                 
               10 PEDIRACR_LEN   PIC S9(4) COMP.                   
               10 PEDIRACR_TEXT  PIC X(120).                                                                            
               10 PENOMBRE_LEN   PIC S9(4) COMP.                   
               10 PENOMBRE_TEXT  PIC X(60).                                                                            
               10 PEDETINF_LEN   PIC S9(4) COMP.                   
               10 PEDETINF_TEXT  PIC X(200).                            