          02 MVR.
            10 CUENTA              PIC X(12).
            10 OFICINA             PIC X(4).
            10 ENTIDAD             PIC X(4).
            10 FELIQ               PIC X(10).
            10 NIO                 PIC X(24).
            10 NUMREC              PIC S9(5)V USAGE COMP-3.
            10 FEOPER           PIC X(10).
            10 FECONTA          PIC X(10).
            10 FEVALOR          PIC X(10).
            10 CAPINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 IND-DESGCAPI     PIC X(1).
            10 CODCONLI-CAP     PIC X(3).
            10 IND-DESG-REAJCAP PIC X(1).
            10 IND-DESG-REAJSEG PIC X(1).
            10 INTINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 IND-DESGINTE     PIC X(1).
            10 CODCONLI-INT     PIC X(3).
            10 IND-DESGCOMI     PIC X(1).
            10 COMINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 CODCONLI-COM     PIC X(3).
            10 IND-DESGGAST     PIC X(1).
            10 GASINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 CODCONLI-GAS     PIC X(3).
            10 IND-DESGSEGU     PIC X(1).
            10 SEGINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 CODCONLI-SEG     PIC X(3).
            10 IND-DESGIMPU     PIC X(1).
            10 IMPINIRE         PIC S9(13)V9(4) USAGE COMP-3.
            10 CODCONLI-IMP     PIC X(3).
            10 POR-ALICUOTA     PIC S9(3)V9(6) USAGE COMP-3.
            10 IND-LIQIMPUE     PIC X(1).
            10 IMP-BASE         PIC S9(13)V9(4) USAGE COMP-3.
            10 FECALMORA        PIC X(10).
            10 IND-DESGMORA     PIC X(1).
            10 CODCONLI-MOR     PIC X(3).
            10 IMP-MORA         PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP-CONCOBEX     PIC S9(13)V9(4) USAGE COMP-3.
            10 CODCONLI-COBEX   PIC X(3).
            10 IND-DESGCOBE     PIC X(1).
            10 IND-DESGCPS      PIC X(1).
            10 CODCONLI-CPS     PIC X(3).
            10 IMP-CPS          PIC S9(13)V9(4) USAGE COMP-3.
            10 SALREAL          PIC S9(13)V9(4) USAGE COMP-3.
            10 IND-FORMPAGO     PIC X(1).
            10 IMP-PAGO         PIC S9(13)V9(4) USAGE COMP-3.
            10 COD-DIVI-PAGO    PIC X(3).
            10 COD-ENTCHEQU     PIC X(4).
            10 COD-OFICHEQU     PIC X(4).
            10 COD-CTACHEQU     PIC X(12).
            10 NUM-DOCCHEQU     PIC S9(13)V USAGE COMP-3.
            10 TIP-DOCCHEQU     PIC X(2).
            10 FEC-DISPCHEQU    PIC X(10).
            10 COD-PLAZA        PIC X(8).
            10 ENTIDAD-PAG      PIC X(4).
            10 CENTRO-PAG       PIC X(4).
            10 CUENTA-PAG       PIC X(12).
            10 DIGICCC1-PAG     PIC X(1).
            10 DIGICCC2-PAG     PIC X(1).
            10 COD-DIVISA          PIC X(3).
            10 IMP-CAMBDIVI        PIC S9(6)V9(5) USAGE COMP-3.
            10 SITDEUCT            PIC X(2).
            10 TIP-CONDONAR        PIC X(5).
            10 COD-EVENTO          PIC X(4).
            10 NUM-COB-CTSO        PIC S9(3)V USAGE COMP-3.
            10 INDRETRO            PIC X(1).
            10 FECRETRO            PIC X(10).
            10 ENTIDAD-RETRO    PIC X(4).
            10 CENTRO-RETRO     PIC X(4).
            10 USERID-RETRO     PIC X(8).
            10 NETNAME-RETRO    PIC X(8).
            10 TIMESTAMP-RETRO  PIC X(26).
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 USERID-UMO       PIC X(8).
            10 NETNAME-UMO      PIC X(8).
            10 TIMESTAMP-UMO    PIC X(26).