
             01  TCDT090.
                 10 TCCENTIT             PIC S9(4)V USAGE COMP-3.
                 10 COEFICI              PIC X(4).
                 10 PLAZOINI             PIC S9(5)V USAGE COMP-3.
                 10 TCFECHIN             PIC X(10).
                 10 VALOR                PIC S9(3)V9(8) USAGE COMP-3.
                 10 PLAZOFIN             PIC S9(5)V USAGE COMP-3.
                 10 TCFECHFI             PIC X(10).
                 10 ENTIDAD_UMO          PIC S9(4)V USAGE COMP-3.
                 10 CENTRO_UMO           PIC S9(4)V USAGE COMP-3.
                 10 USERID_UMO           PIC X(8).
                 10 NETNAME_UMO          PIC X(8).
                 10 TIMEST_UMO           PIC X(26).


