            02  GITCCUO.
               10 COD_ENTIGEN          PIC X(4).
               10 NUM_PERSONA          PIC X(8).
               10 COD_ENTIDAD          PIC X(4).
               10 COD_CENTRO           PIC X(4).
               10 NUM_CONTRATO         PIC X(12).
               10 COD_PRODUCTO         PIC X(2).
               10 COD_SUBPRODU         PIC X(4).
               10 COD_DIVISA           PIC X(3).
               10 NUM_SECUENCIA        PIC S9(3)V USAGE COMP-3.
               10 FEC_CUOTAPHONE       PIC X(10).
               10 CUENTA_VISA          PIC S9(10)V USAGE COMP-3.
               10 COD_MARCA_INI        PIC X(2).
               10 COD_SUBMARCA_INI     PIC X(3).
               10 COD_MARCA_SEG_INI    PIC X(2).
               10 TIP_REESTRUCT_INI    PIC X(1).
               10 COD_MARCA_ACT        PIC X(2).
               10 COD_SUBMARCA_ACT     PIC X(3).
               10 FEC_CAMBIO_SEG       PIC X(10).
               10 COD_MARCA_SEG_ACT    PIC X(2).
               10 TIP_REESTRUCT_ACT    PIC X(1).
               10 FEC_CURA             PIC X(10).
               10 FEC_EMPEORA          PIC X(10).
               10 FEC_NORMALIZA        PIC X(10).
               10 COD_CRITERIO         PIC X(8).
               10 MOTIVO_CAMBIO        PIC X(50).
               10 NUM_REE              PIC S9(3)V USAGE COMP-3.
               10 ENTIDAD_UMO          PIC X(4).
               10 CENTRO_UMO           PIC X(4).
               10 USERID_UMO           PIC X(8).
               10 NETNAME_UMO          PIC X(8).
               10 TIMEST_UMO           PIC X(26).