           02  525.                                                            
             10  NUM-POSICION         PIC X(11).
             10  NUM-ORDENJUD         PIC X(11).
             10  COD-ORDENJUD         PIC X(03).
             10  NUM-ANOAUTO          PIC X(04).
             10  NUM-JUZGADO          PIC X(11).
             10  COD-ENTIDAD          PIC X(04).
             10  COD-CENTRO           PIC X(04).
             10  NUM-CONTRATO         PIC X(12).
             10  COD-PRODUCTO         PIC X(02).
             10  COD-SUBPRODU         PIC X(04).
             10  COD-DIVISA           PIC X(03).
             10  NUM-PERSONA          PIC X(08).
             10  COD-INTERVEN         PIC X(02).
             10  NUM-ORDINTER         PIC X(03).
             10  FEC-BAJA             PIC X(10).
             10  FEC-ALTAREG          PIC X(10).
             10  FILLER               PIC X(18).
