          02  MAE.
            10 ENTIDAD            PIC X(04).
            10 OFICINA            PIC X(04).
            10 CUENTA             PIC X(12).
            10 PRODUCTO           PIC X(02).
            10 SUBPRO             PIC X(04).
            10 TIP_PRODUCTO       PIC X(02).
            10 COD_PROCEDEN       PIC X(03).
            10 DIGICCC1           PIC X(01).
            10 DIGICCC2           PIC X(01).
            10 CODIGAR            PIC X(03).
            10 CODIDES            PIC X(05).
            10 PLAZO              PIC X(04).
            10 UGYVTOME           PIC S9(7)V COMP-3.
            10 DIVISA             PIC X(03).
            10 IND_REAJDIV        PIC X(01).
            10 NUMDEC             PIC S9(01) COMP-3.
            10 INDIMAT            PIC X(01).
            10 SITPRES            PIC X(01).
            10 ENTIT              PIC X(04).
            10 OFTIT              PIC X(04).
            10 ENTITAN            PIC X(04).
            10 OFTITAN            PIC X(04).
            10 ENTELEV            PIC X(04).
            10 OFELEV             PIC X(04).
            10 ENTFORM            PIC X(04).
            10 OFFORM             PIC X(04).
            10 UGENTPRE           PIC X(04).
            10 COD_CANAL          PIC X(02).
            10 UGOFIPRE           PIC X(04).
            10 NUM_PROPUES        PIC X(20).
            10 CUENTA_PGR         PIC X(12).
            10 OFICINA_PGR        PIC X(04).
            10 ENTIDAD_PGR        PIC X(04).
            10 DIA_FACAN             PIC S9(3)  COMP-3.
            10 FEC_VCTO_PGR          PIC X(10).
            10 CAPSOLI            PIC S9(13)V9(4) COMP-3.
            10 IMPCONCE           PIC S9(13)V9(4) COMP-3.
            10 IMPDISPU           PIC S9(13)V9(4) COMP-3.
            10 SALTEOR            PIC S9(13)V9(4) COMP-3.
            10 SALREAL            PIC S9(13)V9(4) COMP-3.
            10 TIP_CAMBIO_FORM    PIC S9(06)V9(5) COMP-3.
            10 IMP_PDTEPERI       PIC S9(13)V9(4) COMP-3.
            10 SALDO_PROMEDIO     PIC S9(13)V9(4) COMP-3.
            10 IMP_INTCOMP        PIC S9(13)V9(4) COMP-3.
            10 FESOLIC            PIC X(10).
            10 FEFORMA            PIC X(10).
            10 FECAPROBA          PIC X(10).
            10 FECPRIAMO          PIC X(10).
            10 FECPRILIQ          PIC X(10).
            10 FECHA_PAGO         PIC X(10).
            10 FEFINCAR_ORIG      PIC X(10).
            10 FEVENCIN_ORIG      PIC X(10).
            10 FEULIQ_ORIG        PIC X(10).
            10 FEPROLIQ_ORIG      PIC X(10).
            10 FEULAMO_ORIG       PIC X(10).
            10 FEPROAMO_ORIG      PIC X(10).
            10 FECPRIAMO_ORIG     PIC X(10).
            10 FEC_FINDIFER_ORIG  PIC X(10).
            10 FEPROFAC           PIC X(10).
            10 FEPROSEG_ORIG      PIC X(10).
            10 FECHA_PAGO_ORIG    PIC X(10).
            10 FEFINCAR           PIC X(10).
            10 FEVENCIN           PIC X(10).
            10 FECSAL             PIC X(10).
            10 FEULIQ             PIC X(10).
            10 FEPROLIQ           PIC X(10).
            10 FEULAMO            PIC X(10).
            10 FEPROAMO           PIC X(10).
            10 FEULIES            PIC X(10).
            10 FEULAMES           PIC X(10).
            10 UGFCAREB           PIC X(10).
            10 UGFCAMOV           PIC X(10).
            10 UGFMAFOR           PIC X(10).
            10 FEC_PROXPRGA       PIC X(10).
            10 FEC_DILIGPAG       PIC X(10).
            10 FEC_FINDIFER       PIC X(10).
            10 FEC_PROX_REV       PIC X(10).
            10 FEC_ADIC_CUO       PIC X(10).
            10 FEC_PASE_CAST      PIC X(10).
            10 FEC_PASE_COBJUD    PIC X(10).
            10 FEC_BLQ_LF_MAN     PIC X(10).
            10 FEPROSEG           PIC X(10).
            10 INDLIQES           PIC X(01).
            10 INDADMES           PIC X(01).
            10 IND_COBRIMP        PIC X(01).
            10 IND_CALTER         PIC X(01).
            10 TIP_CONDALTE       PIC X(1).
            10 COD_CONDALTE       PIC X(15).
            10 UGYASASS           PIC X(01).
            10 AGENTE             PIC X(04).
            10 EMPRESA_CONV       PIC X(08).
            10 INDCUAMA           PIC X(01).
            10 UGYPAPRE           PIC X(01).
            10 IND_SOBREGIRO      PIC X(01).
            10 IND_ADMRENOV       PIC X(01).
            10 UGYEMPRE           PIC X(01).
            10 INDPOL             PIC X(01).
            10 UGCIOPRE           PIC X(01).
            10 UGCDEAMB           PIC X(01).
            10 UGYMVPRE           PIC X(01).
            10 INDCAMBIO          PIC X(01).
            10 INDFISCA           PIC X(01).
            10 INDAVEMI           PIC X(01).
            10 INDFACTU           PIC X(01).
            10 INDCARGA           PIC X(01).
            10 IND_PRESTREL       PIC X(01).
            10 IND_SOLCARTA       PIC X(01).
            10 IND_PTMOINST       PIC X(01).
            10 UGYPPAUT           PIC X(01).
            10 UGYTIMOR           PIC X(01).
            10 UGYTIINV           PIC X(01).
            10 UGYDERBO           PIC X(01).
            10 UGYCATAE           PIC X(01).
            10 UGYCGOCU           PIC X(01).
            10 UGYNVENC           PIC X(01).
            10 UGCTIVEN           PIC X(01).
            10 IND_CARTSECU       PIC X(01).
            10 IND_REESTRUC       PIC X(01).
            10 IND_ROTATIVO       PIC X(01).
            10 IND_CARGOAUT       PIC X(01).
            10 IND_COSEGCUO       PIC X(01).
            10 IND_CONVERT        PIC X(01).
            10 IND_LIQVAR         PIC X(01).
            10 IND_PLAMAMEN       PIC X(01).
            10 IND_VENDIDA        PIC X(01).
            10 IND_BLQ_LF_AUT     PIC X(01).
            10 IND_BLQ_LF_MAN     PIC X(01).
            10 IND_CAPINTER       PIC X(01).
            10 IND_REC_CUO_CAPIT  PIC X(01).
            10 IND_COB_GANE       PIC X(01).
            10 IND_TIT_EJE_VAL    PIC X(01).
            10 IND_CALCUO_DOS_T   PIC X(01).
            10 IND_CBOTASA_ANT    PIC X(01).
            10 IND_ACEP_DESP_PLZ  PIC X(01).
            10 CUENTA_VIN      PIC X(12).
            10 CENTRO_VIN      PIC X(04).
            10 ENTIDAD_VIN     PIC X(04).
            10 DIGICCC1_VIN    PIC X(01).
            10 DIGICCC2_VIN    PIC X(01).
            10 DIVISA_VIN         PIC X(03).
            10 PRODUCTO_VIN       PIC X(02).
            10 SUBPRO_VIN         PIC X(04).
            10 SUBSUJET           PIC X(03).
            10 HACEMTUT           PIC X(04).
            10 PEARENEG           PIC X(03).
            10 UGQFIMIN           PIC S9(03)V COMP-3.
            10 POR_COBERMIN       PIC S9(03)V9(6) COMP-3.
            10 INDDEUPE           PIC X(01).
            10 ACUIMPA            PIC S9(13)V9(4) COMP-3.
            10 FEAPLARE           PIC X(10).
            10 FEC_ULTIMPAG       PIC X(10).
            10 ENTMOROS           PIC X(04).
            10 OFIMOROS           PIC X(04).
            10 FECSIT             PIC X(10).
            10 FECSITOB           PIC X(10).
            10 FECSITSU           PIC X(10).
            10 FEC_SITDE491       PIC X(10).
            10 UGFSOPRE           PIC X(10).
            10 UGFPAMOR           PIC X(10).
            10 SITDEUOB           PIC X(02).
            10 SITDEUSU           PIC X(02).
            10 SITDEUCT           PIC X(02).
            10 COD_SITOBJ491      PIC X(02).
            10 INDACPRO           PIC X(01).
            10 UGYPAFDO           PIC X(01).
            10 UGIMPFDO           PIC S9(13)V9(4) COMP-3.
            10 UGIPROIM           PIC S9(13)V9(4) COMP-3.
            10 UGIORINT           PIC S9(13)V9(4) COMP-3.
            10 FEC_SUSPDEVE       PIC X(10).
            10 IND_COMUIMPA       PIC X(01).
            10 CODCICLO           PIC X(02).
            10 FECPROCOM          PIC X(10).
            10 IND_PTMCOBEX       PIC X(01).
            10 FEC_ACELERACION    PIC X(10).
            10 NUM_COB_CTSO       PIC S9(3)V USAGE COMP-3.
            10 FEC_RECDEUDA       PIC X(10).
            10 IND_ORI_SUSPDEVE   PIC X(1).
            10 TIP_CAMB_SUSPDEVE  PIC S9(6)V9(5)  COMP-3.
            10 TIP_CAMB_PASECAST  PIC S9(6)V9(5)  COMP-3.
            10 FEC_DESACELERA     PIC X(10).
            10 IMP_SALACEL        PIC S9(13)V9(4) COMP-3.
            10 CPS_SALACEL        PIC S9(13)V9(4) COMP-3.
            10 MOR_SALACEL        PIC S9(13)V9(4) COMP-3.
            10 FEC_CALC_MORA      PIC X(10).
            10 IMP_CPSACEL_FAC    PIC S9(13)V9(4) COMP-3.
            10 IMP_MORACEL_FAC    PIC S9(13)V9(4) COMP-3.
            10 IND_AFECTO_SALTEOR PIC X(1).
            10 INT_DEV_ACE        PIC S9(13)V9(4) COMP-3.
            10 SITSUB_COBEX       PIC X(2).
            10 UGCREFEM           PIC X(03).
            10 PORDISPO           PIC S9(03)V9(6) COMP-3.
            10 NUMRECIB           PIC S9(05)V     COMP-3.
            10 CONT_IRREGPRE      PIC S9(03)V     COMP-3.
            10 TAE                PIC S9(03)V9(6) COMP-3.
            10 UGPITTAE           PIC S9(03)V9(6) COMP-3.
            10 UGYTRI             PIC S9(03)V9(6) COMP-3.
            10 CONT_MDISPOSI      PIC S9(03)V     COMP-3.
            10 IND_CLASEPRO       PIC X(01).
            10 COD_CABECERA       PIC X(12).
            10 UGISDEJE           PIC S9(13)V9(4) COMP-3.
            10 IND_EMIPAGBL       PIC X(01).
            10 FEC_PROXRECO       PIC X(10).
            10 FEC_PROXRECO_ORI   PIC X(10).
            10 FEC_SOLIEJEC       PIC X(10).
            10 NUM_RENOSOLI       PIC S9(03)V     COMP-3.
            10 COD_MOTIVCAN       PIC X(01).
            10 COD_SITCOB         PIC X(03).
            10 UGCDIPAG           PIC S9(02)V     COMP-3.
            10 IND_PREMIO_ACT     PIC X(01).
            10 TIPPAGARE          PIC X(01).
            10 UGNINFAC           PIC S9(5)   COMP-3.
            10 CUENTA_ABO      PIC X(12).
            10 CENTRO_ABO      PIC X(04).
            10 ENTIDAD_ABO     PIC X(04).
            10 DIGICCC1_ABO    PIC X(01).
            10 DIGICCC2_ABO    PIC X(01).
            10 PROD_ABONO      PIC X(02).
            10 SUBPRO_ABONO    PIC X(04).
            10 DIVISA_ABO      PIC X(03).
            10 FEC_ABONO       PIC X(10).
            10 IND_FINIQUITO   PIC X(01).
            10 FEC_PREFINIQ    PIC X(10).
            10 IMP_OPCOMPRA    PIC S9(13)V9(4) COMP-3.
            10 POR_OPCOMPRA    PIC S9(03)V9(6) COMP-3.
            10 FEC_PROTTOCRES  PIC X(10).
            10 SDO_BALLOON     PIC S9(13)V9(4) COMP-3.
            10 NUM_CUOBALLO    PIC S9(03)V     COMP-3.
            10 SALRESIDUAL     PIC S9(13)V9(4) COMP-3.
            10 SALRETCERO      PIC S9(13)V9(4) COMP-3.
            10 FEC_ULTVENCU    PIC X(10).
            10 FEC_PROENVCU    PIC X(10).
            10 FEC_PRIREDUC    PIC X(10).
            10 FPROXRED        PIC X(10).
            10 FPROXRED_ORIG   PIC X(10).
            10 IMP_RED_PER     PIC S9(13)V9(4) COMP-3.
            10 SALINTCAP       PIC S9(13)V9(4) COMP-3.
            10 SALINTDESCAP    PIC S9(13)V9(4) COMP-3.
            10 UGFPAVDA        PIC X(10).
            10 TIP_CAMBIO_PAVDA  PIC S9(6)V9(5) COMP-3.
            10 ACUM_DIFERIDOS  PIC S9(13)V9(4) COMP-3.
            10 DES_DIFERIDOS   PIC S9(13)V9(4) COMP-3.
            10 SDOVALPTE       PIC S9(13)V9(4) COMP-3.
            10 FEC_ULTRECO        PIC X(10).
            10 LINEA_OPERAC       PIC X(20).
            10 FEC_SUSPDEVE_ESP   PIC X(10).
            10 FEC_SUSPDEVE_RIES  PIC X(10).
            10 FEC_SUSPDEVE_MOR   PIC X(10).
            10 FEULREC_PAGANT     PIC X(10).
            10 IMP_INMOVILIZADO   PIC S9(13)V9(4) COMP-3.
            10 FECHA_ULT_RENOV    PIC X(10).
            10 SALDO_MIN_AUTOM    PIC S9(13)V9(4) COMP-3.
            10 FEULIQ_SEG         PIC X(10).
            10 FEULIQ_SEG_ORIG    PIC X(10).
            10 IND_COBCOM         PIC X(01).
            10 IND_INSTRU         PIC X(01).
            10 TIPO_PREMIO        PIC X(03).
            10 ENTIDAD_UMO     PIC X(04).
            10 CENTRO_UMO      PIC X(04).
            10 USERID_UMO      PIC X(08).
            10 NETNAME_UMO     PIC X(08).
            10 TIMESTAMP       PIC X(26).