           01  WAPRP062.
               10 COD_TAB_FORM_PGO      PIC S9(5)V COMP-3.
               10 COD_MONE              PIC S9(1)V COMP-3.
               10 COD_PROD              PIC S9(3)V COMP-3.
               10 DES_TAB_FORM_PGO      PIC X(20).
               10 DES_FORM_PGO          PIC X(90).
               10 FEC_HRA_ULT_MODF      PIC X(26).
               10 IDE_USER_ULT_MODF     PIC X(10).
               10 IDE_TERM_ULT_MODF     PIC X(5).
