            02  TCDT080.
              10 CDDIVISS        PIC X(3).
              10 CDDIVBCT        PIC X(2).
              10 CDDIVBE         PIC S9(3)V COMP-3.
              10 TCSIMBOL        PIC X(5).
              10 FHCONTRA        PIC X(10).
              10 FHVALOR         PIC X(10).
              10 CODPAIS         PIC X(3).
              10 NBDIVIC         PIC X(20).
              10 NBDIVIN         PIC X(20).
              10 CTUNICAM        PIC S9(3)V COMP-3.
              10 NUMORCAM        PIC X(2).
              10 INDCOTDI        PIC X(1).
              10 INDCOTBI        PIC X(1).
              10 INDDECIM        PIC X(1).
              10 CORPREFC        PIC X(11).
              10 CORPREFT        PIC X(11).
              10 CORPREFR        PIC X(11).
              10 FHBAJA          PIC X(10).
              10 FILLER          PIC X(01).
              10 ULTMOD          PIC X(26).
              10 BANCULMO        PIC S9(4)V COMP-3.
              10 OFICULMO        PIC S9(4)V COMP-3.
              10 NUMTER          PIC X(4).
              10 USULTMOD        PIC X(8).
              10 DENBIMIN        PIC S9(6)V COMP-3.