          ****************************************************************
          *  EMPRESA     :   BANCO RIO                                   *
          *  SISTEMA     :   CAMPA#AS                                    *
          *  COPY        :   INPUT_OUTPUT SCREENING                      *
          *  LONGITUD    :   200                                         *
          *  FECHA VERS.1:   04/02/2003                                  *
          *  PROVEEDOR   :                                               *
          *  PROGRAMADOR :   ALICIA CALVO                                *
          *  DESCRIPCION :   INTERFASE DE COMUNICACIäN B D MARKETING     *
          ****************************************************************

           01 WACAM500.
               10 TIPO_DOC               	 PIC X(02).
               10 NRO_DOC                	 PIC X(11).
               10 FEC_NACIMIENTO         	 PIC X(10).
               10 MAR_SEXO               	 PIC X(01).
               10 NRO_EMPRESA            	 PIC X(05).
               10 CUIT_PREFIJO           	 PIC X(02).
               10 CUIT_NRO               	 PIC X(08).
               10 CUIT_DV                	 PIC X(01).
               10 EST_CAMP                   PIC X(02).
               10 PERS_CONDICION             PIC X(03).
               10 NUP                        PIC X(08).
               10 APELLIDO                   PIC X(30).
               10 NOMBRE                     PIC X(30).
               10 MARCA_PAQ                  PIC X(01).
               10 COD_PROD_02            	 PIC X(01).
               10 COD_PROD_03            	 PIC X(01).
               10 COD_PROD_04            	 PIC X(01).
               10 COD_PROD_10            	 PIC X(01).
               10 COD_PROD_06            	 PIC X(01).
               10 COD_PROD_08            	 PIC X(01).
               10 COD_PROD_14            	 PIC X(01).
               10 COD_PROD_20            	 PIC X(01).
               10 COD_PROD_21            	 PIC X(01).
               10 COD_PROD_37            	 PIC X(01).
               10 COD_PROD_38            	 PIC X(01).
               10 COD_PROD_3X            	 PIC X(01).
               10 COD_PROD_40            	 PIC X(01).
               10 COD_PROD_41            	 PIC X(01).
               10 COD_PROD_42            	 PIC X(01).
               10 COD_PROD_70            	 PIC X(01).
               10 COD_PROD_71            	 PIC X(01).
               10 SUC_BANELCO                PIC X(04).
               10 SITU_AFIR_RIO              PIC X(03).
               10 SITU_AFIR_BCRA             PIC X(03).
               10 SITU_CACS                  PIC X(02).
               10 COD_MARCA_GYS              PIC X(02).
               10 SITU_AIGE                  PIC X(02).
               10 COD_VERAZ                  PIC X(03).
               10 FEC_VERAZ                  PIC X(10).
               10 ESPACIO_USER               PIC X(22).
               10 FECHA_PROCESO              PIC X(10).
               10 FILLER                     PIC X(08).
