           01  WARCE005.
                   10 IDE_PGO     PIC X(19).
                   10 TPO_CPRB    PIC X(2).
                   10 NRO_CPRB    PIC X(31).
                   10 NRO_CUO     PIC X(4).
                   10 NRO_EMPR    PIC S9(11)V COMP-3.
                   10 NRO_DIG_EMPR  PIC S9(1)V COMP-3.
                   10 NRO_PROD    PIC S9(3)V COMP-3.
                   10 NRO_INSTAN  PIC S9(2)V COMP-3.
                   10 NRO_CLTE    PIC X(22).
                   10 FEC_VTO     PIC X(10).
                   10 SDO_ANT     PIC S9(13)V9(2) COMP-3.
                   10 FEC_PGO_ANT  PIC X(10).
                   10 TSA_PUNITORIOS  PIC S9(3)V9(2) COMP-3.
                   10 IMP_DIF_VTO  PIC S9(13)V9(2) COMP-3.
                   10 IMP_PUNI    PIC S9(13)V9(2) COMP-3.
                   10 IMP_DTO     PIC S9(13)V9(2) COMP-3.
                   10 IMP_PGO     PIC S9(13)V9(2) COMP-3.
                   10 OBS_LIBR_1ER  PIC X(18).
                   10 OBS_LIBR_2DA  PIC X(15).
                   10 OBS_LIBR_3RA  PIC X(15).
                   10 COD_MONE    PIC S9(1)V COMP-3.
                   10 FEC_HRA_ULT_MODF  PIC X(26).
                   10 IDE_USER_ULT_MODF  PIC X(10).
                   10 IDE_TERM_ULT_MODF  PIC X(5).
