          02 ACU.
            10 ENTIDAD              PIC X(04).
            10 CENTRO-ALTA          PIC X(04).
            10 CUENTA               PIC X(12).
            10 DIVISA               PIC X(3).
            10 SECUENCIA            PIC S9(5) COMP-3.
            10 TIPO-ACUERDO         PIC X(1).
            10 ESTADO               PIC X(1).
            10 LIMITE               PIC S9(13)V9(2) USAGE COMP-3.
            10 LIMITE-RENOV         PIC S9(13)V9(2) USAGE COMP-3.
            10 PERIOD-LIQ           PIC X(1).
            10 TIPO-LIQ             PIC X(3).
            10 CLASE-LIQ            PIC X(1).
            10 DIA-LIQ              PIC X(2).
            10 PRIORIDAD            PIC S9(5) COMP-3.
            10 TARIFA               PIC X(4).
            10 CLASE-TAF            PIC X(1).
            10 TIPO-INTERES         PIC S9(3)V9(5) USAGE COMP-3.
            10 COEFICI              PIC X(4).
            10 PUNTOS               PIC S9(3)V9(5) USAGE COMP-3.
            10 TIPOINT-INC-SBRG     PIC S9(3)V9(5) USAGE COMP-3.
            10 TASA-MAX-CONV        PIC X(4).
            10 IMPORTE-CAMBIO       PIC S9(13)V9(2) USAGE COMP-3.
            10 LIMITE-ORI           PIC S9(13)V9(2) USAGE COMP-3.
            10 INTE-DEVDEUD         PIC S9(13)V9(2) USAGE COMP-3.
            10 REFER-LIQ            PIC S9(9) COMP-3.
            10 IND-RENAUTO          PIC X(1).
            10 IND-INTV-SAL-DIA     PIC X(1).
            10 IND-PET-LIQ          PIC X(1).
            10 TIPO-VTO             PIC X(01).
            10 NUM-VTO              PIC S9(5) COMP-3.
            10 DIAS-USO             PIC S9(5) COMP-3.
            10 DIAS-DESP-PRO        PIC S9(3) COMP-3.
            10 FECHA-ULTREN         PIC X(10).
            10 FECHA-INICIO         PIC X(10).
            10 FECHA-VCTO           PIC X(10).
            10 FECHA-ULTLIQ         PIC X(10).
            10 FECHA-UPRO-LIQ       PIC X(10).
            10 FECHA-PROLIQ         PIC X(10).
            10 FECHA-PROC-LIQ       PIC X(10).
            10 ENTIDAD-UMO          PIC X(4).
            10 CENTRO-UMO           PIC X(4).
            10 USERID-UMO           PIC X(8).
            10 NETNAME-UMO          PIC X(8).
            10 TIMEST-UMO           PIC X(26).