           01  WAPRP030.
               10 IDE_PGO                   PIC X(19).
               10 NRO_EMPR                  PIC S9(11)V COMP-3.
               10 NRO_DIG_EMPR              PIC S9(1)V COMP-3.
               10 NRO_PROD                  PIC S9(3)V COMP-3.
               10 NRO_INSTAN                PIC S9(2)V COMP-3.
               10 TPO_DOC                   PIC X(3).
               10 NRO_DOC                   PIC S9(11)V COMP-3.
               10 TPO_DOC_1                 PIC X(3).
               10 NRO_DOC_1                 PIC S9(11)V COMP-3.
               10 TPO_DOC_2                 PIC X(3).
               10 NRO_DOC_2                 PIC S9(11)V COMP-3.
               10 NRO_SUC_DIST              PIC S9(4)V COMP-3.
               10 TPO_RECIBO                PIC X(3).
               10 NRO_SECU_DOM              PIC S9(5)V COMP-3.
               10 IDE_USER_ALTA             PIC X(10).
               10 IDE_TERM_ALTA             PIC X(10).
               10 FEC_HRA_ULT_MODF          PIC X(26).
               10 IDE_USER_ULT_MODF         PIC X(10).
               10 IDE_TERM_ULT_MODF         PIC X(5).
