           01  120.
               10 EMPRESA              PIC S9999V USAGE COMP-3.
               10 ESTAEMP              PIC X(1).
               10 FEALT                PIC X(11).
               10 FEULMOD              PIC X(11).
               10 FECAN                PIC X(11).
               10 FECONT               PIC X(11).
               10 FEVALC               PIC X(11).
               10 ACIDEFA              PIC S9999V USAGE COMP-3.
               10 ACIDEFM              PIC S9999V USAGE COMP-3.
               10 MCIDEFM              PIC S99V USAGE COMP-3.
               10 ACIPAR               PIC S9999V USAGE COMP-3.
               10 MCIPAR               PIC S99V USAGE COMP-3.
               10 ACIPREA              PIC S9999V USAGE COMP-3.
               10 ACIPREM              PIC S9999V USAGE COMP-3.
               10 MCIPREM              PIC S99V USAGE COMP-3.
               10 AVOLHIS              PIC S9999V USAGE COMP-3.
               10 MVOLHIS              PIC S99V USAGE COMP-3.
               10 ACECPREA             PIC S9999V USAGE COMP-3.
               10 ACECPREM             PIC S9999V USAGE COMP-3.
               10 MCECPREM             PIC S99V USAGE COMP-3.
               10 HANCTSMD             PIC X(15).
               10 HANCTSMH             PIC X(15).
               10 HANCTSDD             PIC X(15).
               10 HANCTSHD             PIC X(15).
               10 HANCOIND             PIC X(15).
               10 HANCOINH             PIC X(15).
               10 HANCOIDD             PIC X(15).
               10 HANCOIHD             PIC X(15).
               10 HANQDFOD             PIC X(15).
               10 HANQDFOH             PIC X(15).
               10 HANQDFDD             PIC X(15).
               10 HANQDFHD             PIC X(15).
               10 CTACAJ               PIC X(15).
               10 CTACAJDD             PIC X(15).
               10 HANCORED             PIC X(15).
               10 HANCOREH             PIC X(15).
               10 HANCORDD             PIC X(15).
               10 HANCORHD             PIC X(15).
               10 HANTRORD             PIC X(15).
               10 HANTRORH             PIC X(15).
               10 HANTRODD             PIC X(15).
               10 HANTROHD             PIC X(15).
               10 HANCIORD             PIC X(15).
               10 HANCIORH             PIC X(15).
               10 HANCIODD             PIC X(15).
               10 HANCIOHD             PIC X(15).
               10 PECIDEFA             PIC X(1).
               10 PECIDEFM             PIC X(1).
               10 PECIPARM             PIC X(1).
               10 PECIPREA             PIC X(1).
               10 PECIPREM             PIC X(1).
               10 PECICEA              PIC X(1).
               10 PECICEM              PIC X(1).
               10 HANPESUS             PIC X(1).
               10 CTRLCIE              PIC X(1).
               10 CONTAB               PIC S9999V USAGE COMP-3.
               10 HANCNAUT             PIC S9999V USAGE COMP-3.
               10 INFORM               PIC S9999V USAGE COMP-3.
               10 HACCLACC             PIC X(6).
               10 HACIDIOM             PIC X(1).
               10 TRSABADO             PIC X(1).
               10 TRATFEST             PIC X(1).
               10 HATDGCLO             PIC X(1).
               10 HAFITM               PIC X(10).
               10 HAFFTM               PIC X(11).
               10 HAFITA               PIC X(11).
               10 HAFFTA               PIC X(11).
               10 HANCTTP              PIC X(16).
               10 HANCTQE              PIC X(15).
               10 HANCTGRD             PIC X(15).
               10 HANCTPRD             PIC X(15).
               10 HANCNEST             PIC S9999V USAGE COMP-3.
               10 HANCTCIE             PIC X(15).
               10 HANCTINT             PIC X(15).
               10 HANCTPOS             PIC X(15).
               10 HANCTPOD             PIC X(15).
               10 CODDIV               PIC X(3).
               10 HAPORTC              PIC S999V99999 USAGE COMP-3.
               10 HAVALCTA             PIC X(1).
               10 HAFINHAB             PIC X(1).
               10 HAISCAMA             PIC S9999V USAGE COMP-3.
               10 CECIPRE              PIC S9999V USAGE COMP-3.
               10 INCUFOR              PIC X(1).
               10 INCOSOB              PIC X(1).
               10 ULTASOFI             PIC S999999999V USAGE COMP-3.
               10 INDTRDIV             PIC X(1).
               10 INDSIGSAL            PIC S9  COMP-3.
               10 HALIMRECH            PIC S9(9) COMP-3.
               10 FEULTBAT             PIC X(11).
               10 TIPODIV              PIC X(1).
               10 TIPOCAMB             PIC X(1).