	      01 PTMOSQ.
            10 MAE_ENTIDAD                  PIC X(04).
            10 MAE_OFICINA                  PIC X(04).        
            10 MAE_CUENTA                   PIC X(12).        
            10 MAE_PRODUCTO                 PIC X(02).        
            10 MAE_SUBPRO                   PIC X(04).        
            10 MAE_TIP_PRODUCTO             PIC X(02).        
            10 MAE_COD_PROCEDEN             PIC X(03).        
            10 MAE_DIGICCC1                 PIC X(01).        
            10 MAE_DIGICCC2                 PIC X(01).        
            10 MAE_CODIGAR                  PIC X(03).        
            10 MAE_CODIDES                  PIC X(05).        
            10 MAE_PLAZO                    PIC X(04).        
            10 MAE_UGYVTOME                 PIC S9(7)V COMP-3.       
            10 MAE_DIVISA                   PIC X(03).        
            10 MAE_IND_REAJDIV              PIC X(01).        
            10 MAE_NUMDEC                   PIC S9(01) COMP-3.       
            10 MAE_INDIMAT                  PIC X(01).        
            10 MAE_SITPRES                  PIC X(01).        
            10 MAE_ENTIT                    PIC X(04).        
            10 MAE_OFTIT                    PIC X(04).        
            10 MAE_ENTITAN                  PIC X(04).        
            10 MAE_OFTITAN                  PIC X(04).        
            10 MAE_ENTELEV                  PIC X(04).        
            10 MAE_OFELEV                   PIC X(04).        
            10 MAE_ENTFORM                  PIC X(04).        
            10 MAE_OFFORM                   PIC X(04).        
            10 MAE_UGENTPRE                 PIC X(04).        
            10 MAE_COD_CANAL                PIC X(02).        
            10 MAE_UGOFIPRE                 PIC X(04).        
            10 MAE_NUM_PROPUES              PIC X(20).        
            10 MAE_CUENTA_PGR               PIC X(12).        
            10 MAE_OFICINA_PGR              PIC X(04).        
            10 MAE_ENTIDAD_PGR              PIC X(04).        
            10 MAE_DIA_FACAN                PIC S9(3) COMP-3.        
            10 MAE_FEC_VCTO_PGR             PIC X(10).        
            10 MAE_CAPSOLI                  PIC S9(13)V9(4) COMP-3.  
            10 MAE_IMPCONCE                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_IMPDISPU                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALTEOR                  PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALREAL                  PIC S9(13)V9(4) COMP-3.  
            10 MAE_TIP_CAMBIO_FORM          PIC S9(06)V9(5) COMP-3.  
            10 MAE_IMP_PDTEPERI             PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALDO_PROMEDIO           PIC S9(13)V9(4) COMP-3.  
            10 MAE_IMP_INTCOMP              PIC S9(13)V9(4) COMP-3.  
            10 MAE_FESOLIC                  PIC X(10).        
            10 MAE_FEFORMA                  PIC X(10).        
            10 MAE_FECAPROBA                PIC X(10).        
            10 MAE_FECPRIAMO                PIC X(10).        
            10 MAE_FECPRILIQ                PIC X(10).        
            10 MAE_FECHA_PAGO               PIC X(10).        
            10 MAE_FEFINCAR_ORIG            PIC X(10).        
            10 MAE_FEVENCIN_ORIG            PIC X(10).        
            10 MAE_FEULIQ_ORIG              PIC X(10).        
            10 MAE_FEPROLIQ_ORIG            PIC X(10).        
            10 MAE_FEULAMO_ORIG             PIC X(10).        
            10 MAE_FEPROAMO_ORIG            PIC X(10).        
            10 MAE_FECPRIAMO_ORIG           PIC X(10).        
            10 MAE_FEC_FINDIFER_ORIG        PIC X(10).        
            10 MAE_FEPROFAC                 PIC X(10).        
            10 MAE_FEPROSEG_ORIG            PIC X(10).        
            10 MAE_FECHA_PAGO_ORIG          PIC X(10).        
            10 MAE_FEFINCAR                 PIC X(10).        
            10 MAE_FEVENCIN                 PIC X(10).        
            10 MAE_FECSAL                   PIC X(10).        
            10 MAE_FEULIQ                   PIC X(10).        
            10 MAE_FEPROLIQ                 PIC X(10).        
            10 MAE_FEULAMO                  PIC X(10).        
            10 MAE_FEPROAMO                 PIC X(10).        
            10 MAE_FEULIES                  PIC X(10).        
            10 MAE_FEULAMES                 PIC X(10).        
            10 MAE_UGFCAREB                 PIC X(10).        
            10 MAE_UGFCAMOV                 PIC X(10).        
            10 MAE_UGFMAFOR                 PIC X(10).        
            10 MAE_FEC_PROXPRGA             PIC X(10).        
            10 MAE_FEC_DILIGPAG             PIC X(10).        
            10 MAE_FEC_FINDIFER             PIC X(10).        
            10 MAE_FEC_PROX_REV             PIC X(10).        
            10 MAE_FEC_ADIC_CUO             PIC X(10).        
            10 MAE_FEC_PASE_CAST            PIC X(10).        
            10 MAE_FEC_PASE_COBJUD          PIC X(10).        
            10 MAE_FEC_BLQ_LF_MAN           PIC X(10).        
            10 MAE_FEPROSEG                 PIC X(10).        
            10 MAE_INDLIQES                 PIC X(01).        
            10 MAE_INDADMES                 PIC X(01).        
            10 MAE_IND_COBRIMP              PIC X(01).        
            10 MAE_IND_CALTER               PIC X(01).        
            10 MAE_TIP_CONDALTE             PIC X(01).         
            10 MAE_COD_CONDALTE             PIC X(15).        
            10 MAE_UGYASASS                 PIC X(01).        
            10 MAE_AGENTE                   PIC X(04).        
            10 MAE_EMPRESA_CONV             PIC X(08).        
            10 MAE_INDCUAMA                 PIC X(01).        
            10 MAE_UGYPAPRE                 PIC X(01).        
            10 MAE_IND_SOBREGIRO            PIC X(01).        
            10 MAE_IND_ADMRENOV             PIC X(01).        
            10 MAE_UGYEMPRE                 PIC X(01).        
            10 MAE_INDPOL                   PIC X(01).        
            10 MAE_UGCIOPRE                 PIC X(01).        
            10 MAE_UGCDEAMB                 PIC X(01).        
            10 MAE_UGYMVPRE                 PIC X(01).        
            10 MAE_INDCAMBIO                PIC X(01).        
            10 MAE_INDFISCA                 PIC X(01).        
            10 MAE_INDAVEMI                 PIC X(01).        
            10 MAE_INDFACTU                 PIC X(01).        
            10 MAE_INDCARGA                 PIC X(01).        
            10 MAE_IND_PRESTREL             PIC X(01).        
            10 MAE_IND_SOLCARTA             PIC X(01).        
            10 MAE_IND_PTMOINST             PIC X(01).        
            10 MAE_UGYPPAUT                 PIC X(01).        
            10 MAE_UGYTIMOR                 PIC X(01).        
            10 MAE_UGYTIINV                 PIC X(01).        
            10 MAE_UGYDERBO                 PIC X(01).        
            10 MAE_UGYCATAE                 PIC X(01).        
            10 MAE_UGYCGOCU                 PIC X(01).        
            10 MAE_UGYNVENC                 PIC X(01).        
            10 MAE_UGCTIVEN                 PIC X(01).        
            10 MAE_IND_CARTSECU             PIC X(01).        
            10 MAE_IND_REESTRUC             PIC X(01).        
            10 MAE_IND_ROTATIVO             PIC X(01).        
            10 MAE_IND_CARGOAUT             PIC X(01).        
            10 MAE_IND_COSEGCUO             PIC X(01).        
            10 MAE_IND_CONVERT              PIC X(01).        
            10 MAE_IND_LIQVAR               PIC X(01).        
            10 MAE_IND_PLAMAMEN             PIC X(01).        
            10 MAE_IND_VENDIDA              PIC X(01).        
            10 MAE_IND_BLQ_LF_AUT           PIC X(01).        
            10 MAE_IND_BLQ_LF_MAN           PIC X(01).        
            10 MAE_IND_CAPINTER             PIC X(01).        
            10 MAE_IND_REC_CUO_CAPIT        PIC X(01).        
            10 MAE_IND_COB_GANE             PIC X(01).        
            10 MAE_IND_TIT_EJE_VAL          PIC X(01).        
            10 MAE_IND_CALCUO_DOS_T         PIC X(01).        
            10 MAE_IND_CBOTASA_ANT          PIC X(01).        
            10 MAE_IND_ACEP_DESP_PLZ        PIC X(01).        
            10 MAE_CUENTA_VIN               PIC X(12).        
            10 MAE_CENTRO_VIN               PIC X(04).        
            10 MAE_ENTIDAD_VIN              PIC X(04).        
            10 MAE_DIGICCC1_VIN             PIC X(01).        
            10 MAE_DIGICCC2_VIN             PIC X(01).        
            10 MAE_PRODUCTO_VIN             PIC X(02).        
            10 MAE_DIVISA_VIN               PIC X(03).        
            10 MAE_SUBPRO_VIN               PIC X(04).        
            10 MAE_SUBSUJET                 PIC X(03).        
            10 MAE_HACEMTUT                 PIC X(04).        
            10 MAE_PEARENEG                 PIC X(03).        
            10 MAE_UGQFIMIN                 PIC S9(03)V COMP-3.      
            10 MAE_POR_COBERMIN             PIC S9(03)V9(6) COMP-3.  
            10 MAE_INDDEUPE                 PIC X(01).        
            10 MAE_ACUIMPA                  PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEAPLARE                 PIC X(10).        
            10 MAE_FEC_ULTIMPAG             PIC X(10).        
            10 MAE_ENTMOROS                 PIC X(04).        
            10 MAE_OFIMOROS                 PIC X(04).        
            10 MAE_FECSIT                   PIC X(10).        
            10 MAE_FECSITOB                 PIC X(10).        
            10 MAE_FECSITSU                 PIC X(10).        
            10 MAE_FEC_SITDE491             PIC X(10).        
            10 MAE_UGFSOPRE                 PIC X(10).        
            10 MAE_UGFPAMOR                 PIC X(10).        
            10 MAE_SITDEUOB                 PIC X(02).        
            10 MAE_SITDEUSU                 PIC X(02).        
            10 MAE_SITDEUCT                 PIC X(02).        
            10 MAE_COD_SITOBJ491            PIC X(02).        
            10 MAE_INDACPRO                 PIC X(01).        
            10 MAE_UGYPAFDO                 PIC X(01).        
            10 MAE_UGIMPFDO                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_UGIPROIM                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_UGIORINT                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEC_SUSPDEVE             PIC X(10).        
            10 MAE_IND_COMUIMPA             PIC X(01).        
            10 MAE_CODCICLO                 PIC X(02).        
            10 MAE_FECPROCOM                PIC X(10).        
            10 MAE_IND_PTMCOBEX             PIC X(01).        
            10 MAE_FEC_ACELERACION          PIC X(10).        
            10 MAE_NUM_COB_CTSO             PIC S9(3)V COMP-3.       
            10 MAE_FEC_RECDEUDA             PIC X(10).        
            10 MAE_IND_ORI_SUSPDEVE         PIC X(01).         
            10 MAE_TIP_CAMB_SUSPDEVE        PIC S9(6)V9(5) COMP-3.   
            10 MAE_TIP_CAMB_PASECAST        PIC S9(6)V9(5) COMP-3.   
            10 MAE_FEC_DESACELERA           PIC X(10).        
            10 MAE_IMP_SALACEL              PIC S9(13)V9(4) COMP-3.  
            10 MAE_CPS_SALACEL              PIC S9(13)V9(4) COMP-3.  
            10 MAE_MOR_SALACEL              PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEC_CALC_MORA            PIC X(10).        
            10 MAE_IMP_CPSACEL_FAC          PIC S9(13)V9(4) COMP-3.  
            10 MAE_IMP_MORACEL_FAC          PIC S9(13)V9(4) COMP-3.  
            10 MAE_IND_AFECTO_SALTEOR       PIC X(01).         
            10 MAE_INT_DEV_ACE              PIC S9(13)V9(4) COMP-3.  
            10 MAE_SITSUB_COBEX             PIC X(02).         
            10 MAE_UGCREFEM                 PIC X(03).        
            10 MAE_PORDISPO                 PIC S9(03)V9(6) COMP-3.  
            10 MAE_NUMRECIB                 PIC S9(05)V COMP-3.      
            10 MAE_CONT_IRREGPRE            PIC S9(03)V COMP-3.      
            10 MAE_TAE                      PIC S9(03)V9(6) COMP-3.  
            10 MAE_UGPITTAE                 PIC S9(03)V9(6) COMP-3.  
            10 MAE_UGYTRI                   PIC S9(03)V9(6) COMP-3.  
            10 MAE_CONT_MDISPOSI            PIC S9(03)V COMP-3.      
            10 MAE_IND_CLASEPRO             PIC X(01).        
            10 MAE_COD_CABECERA             PIC X(12).        
            10 MAE_UGISDEJE                 PIC S9(13)V9(4) COMP-3.  
            10 MAE_IND_EMIPAGBL             PIC X(01).        
            10 MAE_FEC_PROXRECO             PIC X(10).        
            10 MAE_FEC_PROXRECO_ORI         PIC X(10).        
            10 MAE_FEC_SOLIEJEC             PIC X(10).        
            10 MAE_NUM_RENOSOLI             PIC S9(03)V COMP-3.      
            10 MAE_COD_MOTIVCAN             PIC X(01).        
            10 MAE_COD_SITCOB               PIC X(03).        
            10 MAE_UGCDIPAG                 PIC S9(02)V COMP-3.      
            10 MAE_IND_PREMIO_ACT           PIC X(01).        
            10 MAE_TIPPAGARE                PIC X(01).        
            10 MAE_UGNINFAC                 PIC S9(5) COMP-3.        
            10 MAE_CUENTA_ABO               PIC X(12).        
            10 MAE_CENTRO_ABO               PIC X(04).        
            10 MAE_ENTIDAD_ABO              PIC X(04).        
            10 MAE_DIGICCC1_ABO             PIC X(01).        
            10 MAE_DIGICCC2_ABO             PIC X(01).        
            10 MAE_PROD_ABONO               PIC X(02).        
            10 MAE_SUBPRO_ABONO             PIC X(04).        
            10 MAE_DIVISA_ABO               PIC X(03).        
            10 MAE_FEC_ABONO                PIC X(10).        
            10 MAE_IND_FINIQUITO            PIC X(01).        
            10 MAE_FEC_PREFINIQ             PIC X(10).        
            10 MAE_IMP_OPCOMPRA             PIC S9(13)V9(4) COMP-3.  
            10 MAE_POR_OPCOMPRA             PIC S9(03)V9(6) COMP-3.  
            10 MAE_FEC_PROTTOCRES           PIC X(10).        
            10 MAE_SDO_BALLOON              PIC S9(13)V9(4) COMP-3.  
            10 MAE_NUM_CUOBALLO             PIC S9(03)V COMP-3.      
            10 MAE_SALRESIDUAL              PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALRETCERO               PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEC_ULTVENCU             PIC X(10).        
            10 MAE_FEC_PROENVCU             PIC X(10).        
            10 MAE_FEC_PRIREDUC             PIC X(10).        
            10 MAE_FPROXRED                 PIC X(10).        
            10 MAE_FPROXRED_ORIG            PIC X(10).        
            10 MAE_IMP_RED_PER              PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALINTCAP                PIC S9(13)V9(4) COMP-3.  
            10 MAE_SALINTDESCAP             PIC S9(13)V9(4) COMP-3.  
            10 MAE_UGFPAVDA                 PIC X(10).        
            10 MAE_TIP_CAMBIO_PAVDA         PIC S9(6)V9(5) COMP-3.   
            10 MAE_ACUM_DIFERIDOS           PIC S9(13)V9(4) COMP-3.  
            10 MAE_DES_DIFERIDOS            PIC S9(13)V9(4) COMP-3.  
            10 MAE_SDOVALPTE                PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEC_ULTRECO              PIC X(10).        
            10 MAE_LINEA_OPERAC             PIC X(20).        
            10 MAE_FEC_SUSPDEVE_ESP         PIC X(10).        
            10 MAE_FEC_SUSPDEVE_RIES        PIC X(10).        
            10 MAE_FEC_SUSPDEVE_MOR         PIC X(10).        
            10 MAE_FEULREC_PAGANT           PIC X(10).        
            10 MAE_IMP_INMOVILIZADO         PIC S9(13)V9(4) COMP-3.  
            10 MAE_FECHA_ULT_RENOV          PIC X(10).        
            10 MAE_SALDO_MIN_AUTOM          PIC S9(13)V9(4) COMP-3.  
            10 MAE_FEULIQ_SEG               PIC X(10).        
            10 MAE_FEULIQ_SEG_ORIG          PIC X(10).        
            10 MAE_IND_COBCOM               PIC X(01).        
            10 MAE_IND_INSTRU               PIC X(01).        
            10 MAE_TIPO_PREMIO              PIC X(03).        
            10 MAE_ENTIDAD_UMO              PIC X(04).        
            10 MAE_CENTRO_UMO               PIC X(04).        
            10 MAE_USERID_UMO               PIC X(08).        
            10 MAE_NETNAME_UMO              PIC X(08).        
            10 MAE_TIMESTAMP                PIC X(26).        
            10 PTM1_PERINT                  PIC X(04).        
            10 PTM1_PERCAP                  PIC X(04).        
            10 PTM1_INDINANT                PIC X(01).        
            10 PTM1_NUM_MAXRENOV            PIC 9(03) COMP-3.        
            10 PTM1_ENTSUB                  PIC X(04).        
            10 PTM1_CONSUB                  PIC X(03).        
            10 PTM1_TIPOAPLI_INI            PIC S9(03)V9(6) COMP-3.  
            10 PTM1_TIPOAPLI_HOY            PIC S9(03)V9(6) COMP-3.  
            10 PTM1_COD_REFEREN1            PIC X(04).        
            10 PTM1_TIP_CORRECC1            PIC X(01).        
            10 PTM1_TAS_CORRECC1            PIC S9(03)V9(6) COMP-3.  
            10 PTM1_ESTADO                  PIC X(01).        
            10 PTM1_IND_TIPOTTO             PIC X(01).        
            10 PTM1_IND_TTOFECH             PIC X(01).        
            10 PTM1_TASA_REFER_APLI         PIC S9(03)V9(06).
            10 PTM1_COD_CLAREVIS            PIC X(03).        
            10 PTM1_IND_TASA_COMB           PIC X(01).        
            10 PTM1_PERFIJO_TASA_COMB       PIC X(04).        
            10 PTM1_IND_PERFIJO_TASA_COMB   PIC X(01).        
            10 PTM1_UGCPECTI                PIC X(04).        
            10 PTM1_UGPINREB                PIC S9(03)V9(6) COMP-3.  
            10 PTM1_UGPINACT                PIC S9(03)V9(6) COMP-3.  
            10 PTM1_UGNPLPEN                PIC S9(09) COMP-3.       
            10 PTM1_UGNPLVEN                PIC S9(09) COMP-3.       
            10 PTM1_UGNPLINI                PIC S9(05) COMP-3.       
            10 PTM1_UGFULVTO                PIC X(10).        
            10 PTM1_UGFPRVTO                PIC X(10).        
            10 PTM1_UGIQUOTA                PIC S9(13)V9(4) COMP-3.  
            10 PTM1_UGPQSACT                PIC S9(03)V9(6) COMP-3.  
            10 PTM1_UGPISACT                PIC S9(03)V9(6) COMP-3.  
            10 PTM1_UGIQUINS                PIC S9(13)V9(4) COMP-3.  
            10 PTM1_UGISBACT                PIC S9(13)V9(4) COMP-3.  
            10 PTM1_UGIQUOTA_INI            PIC S9(13)V9(4) COMP-3.  
            10 PTM1_CUENTA_REL              PIC X(12).        
            10 PTM1_OFICINA_REL             PIC X(04).        
            10 PTM1_ENTIDAD_REL             PIC X(04).        
            10 PTM1_TIP_PRODUCTO            PIC X(02).        
            10 PTM1_TEXTORED                PIC X(15).        
            10 PTM1_IND_EJEFORZ             PIC X(01).        
            10 PTM1_IND_TIPOAPLI            PIC X(01).        
            10 PTM1_CODTIAMO                PIC X(01).        
            10 PTM1_IND_TIPOTASA            PIC X(01).        
            10 PTM1_DIA_PAGO                PIC S9(03)V COMP-3.      
            10 PTM1_PER_REVISIAC            PIC X(04).        
            10 PTM1_FEC_PROREVAC            PIC X(10).        
            10 PTM1_FEC_ULTREVAC            PIC X(10).        
            10 PTM1_NUM_REVISIONES          PIC S9(05) COMP-3.       
            10 PTM1_TAS_CORRECAC            PIC S9(03)V9(6) COMP-3.  
            10 PTM1_UGTDICAL                PIC X(01).        
            10 PTM1_DIAS_PERIODO            PIC X(01).        
            10 FILLER                       PIC X(094).       
            10 PTM1_MARCA_FORM_CANC         PIC X(01).        
            10 PTM1_MARCA_CAMBIO_SALDO      PIC X(01).        
            10 PTM1_IND_INCIDENCIA          PIC X(01).        
            10 PTM1_PENUMPER                PIC X(08).        
            10 PTM1_PETIPDOC                PIC X(02).        
            10 PTM1_PEDESTIPDOC             PIC X(30).        
            10 PTM1_PENUMDOC                PIC X(11).        
            10 PTM1_PENOMPER                PIC X(40).        
            10 PTM1_PEPRIAPE                PIC X(20).        
            10 PTM1_PESEGAPE                PIC X(20).        
            10 PTM1_PETIPPER                PIC X(01).        
            10 PTM1_PECALPAR                PIC X(02).        
            10 PTM1_PEORDPAR                PIC 9(03).        
            10 PTM1_PEESTCIV                PIC X(01).        
            10 PTM1_PESEXPER                PIC X(01).        
            10 PTM1_PEFECNAC                PIC X(10).        
            10 PTM1_PENACPER                PIC X(03).        
            10 PTM1_PECODACT                PIC X(08).        
            10 PTM1_PETIPDOC2               PIC X(02).        
            10 PTM1_PENUMDOC2               PIC X(11).        
            10 PTM1_PENOMCAL                PIC X(50).        
            10 PTM1_PENUMBLO                PIC X(10).        
            10 PTM1_OBSERV                  PIC X(100).       
            10 PTM1_PECODPOS                PIC X(08).        
            10 PTM1_PEDESLOC                PIC X(30).        
            10 PTM1_PECODPRV                PIC X(02).        
            10 PTM1_PENOMLOC                PIC X(07).        
            10 PTM1_PEPRETEL                PIC X(03).        
            10 PTM1_PECARTEL                PIC X(04).        
            10 PTM1_PENUMTEL                PIC X(08).        
            10 PTM1_PEBANCAP                PIC X(02).        
            10 PTM1_PEDIVISI                PIC X(02).        
            10 PTM1_PETEALEA                PIC X(04).        
            10 PTM1_PEEJECUE                PIC X(04).        
            10 PTM1_PEJEFARE                PIC X(04).        
            10 PTM1_PEGERENT                PIC X(04).        
            10 PTM1_PEMAREMP                PIC X(01).        
            10 PTM1_PERESIVA                PIC X(02).        
            10 PTM1_PETIPTEL                PIC X(01).        
            10 PTM1_PEINDSPY                PIC X(01).        
            10 PTM1_PERESIVA_CCC            PIC X(02).        
            10 PTM1_PEDESCMN                PIC X(30).        
            10 FILLER2                      PIC X(49).        
            10 ADI1_TIPOGAR_INDEX_INI       PIC X(01).        
            10 ADI1_COEFICI_INDEX_INI       PIC X(04).        
            10 ADI1_FECCAL_INDEX_INI        PIC X(10).        
            10 ADI1_VALCOEF1_INDEX_INI      PIC S9(03)V9(08) COMP-3. 
            10 ADI1_VALCOEF2_INDEX_INI      PIC S9(03)V9(08) COMP-3. 
            10 ADI1_FACTOR_INDEX_INI        PIC S9(03)V9(06) COMP-3. 
            10 ADI1_FECCAL_INDEX_ULT        PIC X(10).        
            10 ADI1_VALCOEF1_INDEX_ULT      PIC S9(03)V9(08) COMP-3. 
            10 ADI1_VALCOEF2_INDEX_ULT      PIC S9(03)V9(08) COMP-3. 
            10 ADI1_FACTOR_INDEX_ULT        PIC S9(03)V9(06) COMP-3. 
            10 ADI1_IMPAJUST_SAL_ULT        PIC S9(13)V9(04) COMP-3. 
            10 ADI1_IMPAJUST_SAL_ACUM       PIC S9(13)V9(04) COMP-3. 
            10 ADI1_CODCONLI_AJUSAL         PIC X(03).        
            10 ADI1_COEFICI_INDEX_ACT       PIC X(04).       
            10 ADI1_SALDO_AJUSTE            PIC S9(13)V9(04) COMP-3. 
            10 ADI1_RUBRO_CAP_AJUSTE        PIC X(08).        
            10 ADI1_RUBRO_NVO_CAP_AJUSTE    PIC X(15).        
            10 ADI1_RUB_10_CAP_AJUSTE       PIC X(08).        
            10 ADI1_RUB_10_NVO_CAP_AJUSTE   PIC X(15).        
            10 ADI1_RUB_20_CAP_AJUSTE       PIC X(08).        
            10 ADI1_RUB_20_NVO_CAP_AJUSTE   PIC X(15).        
            10 ADI1_RUBRO_SAL_AJUSTE        PIC X(08).        
            10 ADI1_RUBRO_NVO_SAL_AJUSTE    PIC X(15).        
            10 ADI1_RUB_10_SAL_AJUSTE       PIC X(08).        
            10 ADI1_RUB_10_NVO_SAL_AJUSTE   PIC X(15).        
            10 ADI1_RUB_20_SAL_AJUSTE       PIC X(08).        
            10 ADI1_RUB_20_NVO_SAL_AJUSTE   PIC X(15).        
            10 ADI1_RUBRO_CAPITAL7          PIC 9(07).        
            10 ADI1_RUBRO_CAPITAL_DIGITO    PIC 9(01).        
            10 ADI1_NVO_RUBRO_K             PIC X(15).        
            10 ADI1_RUB_10_CAPITAL7         PIC 9(07).        
            10 ADI1_RUB_10_CAPITAL_DIGITO   PIC 9(01).        
            10 ADI1_NVO_RUB_10_K            PIC X(15).        
            10 ADI1_RUB_20_CAPITAL7         PIC 9(07).        
            10 ADI1_RUB_20_CAPITAL_DIGITO   PIC 9(01).        
            10 ADI1_NVO_RUB_20_K            PIC X(15).        
            10 ADI1_RUBRO_INTERES7          PIC 9(07).        
            10 ADI1_RUBRO_INTERES_DIGITO    PIC 9(01).        
            10 ADI1_NVO_RUBRO_INTDEV        PIC X(15).        
            10 ADI1_RUB_10_INTERES7         PIC 9(07).        
            10 ADI1_RUB_10_INTERES_DIGITO   PIC 9(01).        
            10 ADI1_NVO_RUB_10_INTDEV       PIC X(15).        
            10 ADI1_RUB_20_INTERES7         PIC 9(07).        
            10 ADI1_RUB_20_INTERES_DIGITO   PIC 9(01).        
            10 ADI1_NVO_RUB_20_INTDEV       PIC X(15).        
            10 ADI1_INT_DOCUMENT            PIC S9(13)V9(04) COMP-3. 
            10 ADI1_INT_DOCUMENT_SAL        PIC S9(13)V9(04) COMP-3. 
            10 ADI1_RUBRO_INT_DOCUMENT      PIC X(08).        
            10 ADI1_NVO_RUBRO_INT_DOCUMENT  PIC X(15).        
            10 ADI1_RUB_10_INT_DOCUMENT     PIC X(08).        
            10 ADI1_NVO_RUB_10_INT_DOCUMENT PIC X(15).        
            10 ADI1_RUB_20_INT_DOCUMENT     PIC X(08).        
            10 ADI1_NVO_RUB_20_INT_DOCUMENT PIC X(15).        
            10 ADI1_RUBRO_INT_COMPENSA      PIC X(08).        
            10 ADI1_NVO_RUBRO_INT_COMPENSA  PIC X(15).        
            10 ADI1_APLICACION_RAD          PIC X(04).        
            10 ADI1_SUCURSAL_RAD            PIC 9(03).        
            10 ADI1_TIPO_CTA_RAD            PIC X(01).        
            10 ADI1_NRO_CTA_RAD             PIC 9(13).        
            10 ADI1_PAIS_RE                 PIC X(03).        
            10 ADI1_CFTNA_ORI               PIC S9(03)V9(06) COMP-3. 
            10 ADI1_CFTNA_SIMP_ORI          PIC S9(03)V9(06) COMP-3. 
            10 ADI1_CFTNA_ACT               PIC S9(03)V9(06) COMP-3. 
            10 ADI1_CFTNA_SIMP_ACT          PIC S9(03)V9(06) COMP-3. 
            10 ADI1_IND_MIPYME              PIC X(01).        
            10 FILLER3                      PIC X(40).        