           01  WAPRP007.
               10 COD_TAB_PRE          PIC S9(5) COMP-3.
               10 COD_PROD             PIC S9(3) COMP-3.
               10 DES_TAB_PRE          PIC X(20).
               10 IMP_COM_DOC          PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_MIN_DOC      PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_MAX_DOC      PIC S9(13)V9(2) COMP-3.
               10 COM_TRN              PIC S9(13)V9(2) COMP-3.
               10 COM_MIN_TRN          PIC S9(13)V9(2) COMP-3.
               10 COM_MAX_TRN          PIC S9(13)V9(2) COMP-3.
               10 PORM_COM             PIC S9(4)V9(5)  COMP-3.
               10 IMP_BLTA_REC_BAS     PIC S9(13)V9(2) COMP-3.
               10 PORM_USO_CANL_DOC    PIC S9(4)V9(5)  COMP-3.
               10 IMP_USO_CANL_DOC     PIC S9(13)V9(2) COMP-3.
               10 PORM_USO_ADIC        PIC S9(4)V9(5)  COMP-3.
               10 IMP_COM_USO_ADIC     PIC S9(13)V9(2) COMP-3.
               10 PORM_USO_CANL_TRN    PIC S9(4)V9(5)  COMP-3.
               10 IMP_USO_CANL_TRN     PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_NO_FINAN     PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_DOC_3RA      PIC S9(13)V9(2) COMP-3.
               10 IMP_MIN_DOC_3RA      PIC S9(13)V9(2) COMP-3.
               10 IMP_MAX_DOC_3RA      PIC S9(13)V9(2) COMP-3.
               10 IMP_COM_TRN_3RA      PIC S9(13)V9(2) COMP-3.
               10 IMP_MIN_TRN_3RA      PIC S9(13)V9(2) COMP-3.
               10 IMP_MAX_TRN_3RA      PIC S9(13)V9(2) COMP-3.
               10 PORM_3RA             PIC S9(4)V9(5)  COMP-3.
               10 IMP_RECAR_NO_CLTE    PIC S9(13)V9(2) COMP-3.
               10 PORM_RECAR_NO_CLTE   PIC S9(4)V9(5)  COMP-3.
               10 PORM_CANL_DOC_3RA    PIC S9(4)V9(5)  COMP-3.
               10 IMP_CANL_DOC_3RA     PIC S9(13)V9(2) COMP-3.
               10 PORM_USO_ADIC_3RA    PIC S9(4)V9(5)  COMP-3.
               10 IMP_USO_ADIC_3RA     PIC S9(13)V9(2) COMP-3.
               10 PORM_CANL_TRN_3RA    PIC S9(4)V9(5)  COMP-3.
               10 IMP_CANL_TRN_3RA     PIC S9(13)V9(2) COMP-3.
               10 IMP_NO_FINAN_3RA     PIC S9(13)V9(2) COMP-3.
               10 FEC_HRA_ULT_MODF     PIC X(26).
               10 IDE_USER_ULT_MODF    PIC X(8).
               10 IDE_TERM_ULT_MODF    PIC X(5).
