       02  NCN.
          10 ENTIDAD             PIC X(04).
          10 OFICINA             PIC X(04).
          10 CUENTA              PIC X(12).
          10 FELIQ               PIC X(10).
          10 NUMREC              PIC S9(5)V USAGE COMP-3.
          10 FEFIDEV             PIC X(10).
          10 SDO-NIIF-PREFAC     PIC S9(13)V9(4) COMP-3.
          10 IMP-INT-NIIF        PIC S9(13)V9(4) COMP-3.
          10 SDO-NIIF-POSTFAC    PIC S9(13)V9(4) COMP-3.
          10 INT-DEV-NIIF        PIC S9(13)V9(4) COMP-3.
          10 INT-DIF-DEV         PIC S9(13)V9(4) COMP-3.
          10 FECODEV             PIC X(10).
          10 ENTIDAD-UMO      PIC X(04).
          10 CENTRO-UMO       PIC X(04).
          10 USERID-UMO       PIC X(08).
          10 NETNAME-UMO      PIC X(08).
          10 TIMEST-UMO       PIC X(26).