       03 WAAPE685.
              05 ISEC4110-IMP-DEUDA-T         PIC   9(15)V9(02).
              05 ISEC4110-IMP-DEUDA-P         PIC   9(15)V9(02).
              05 ISEC4110-IMP-DEUDA-M         PIC   9(15)V9(02).