           01 BIL.
                10 ENTIDAD           PIC X(4).
                10 CENTRO_ALTA       PIC X(4).
                10 CUENTA            PIC X(12).
                10 DIVISA            PIC X(3).
                10 FECHA_COMI        PIC X(10).
                10 NUMER_MOV         PIC S9(9)V USAGE COMP-3.
                10 CODIGO_OPER       PIC X(4).
                10 CENTRO_APERT      PIC X(4).
                10 CONCEPTO          PIC X(4).
                10 DESC_CONCEPTO     PIC X(30).
                10 FECHA_DEPO        PIC X(10).
                10 IMP_TOTAL_DEPO    PIC S9(14)V9(2) USAGE COMP-3.
                10 IMP_DEPO_BAJA_DEN PIC S9(14)V9(2) USAGE COMP-3.
                10 BASE_CALCULO      PIC S9(14)V9(2) USAGE COMP-3.
                10 IMP_COM_DEPO      PIC S9(14)V9(2) USAGE COMP-3.
                10 SUCURSAL_DEPO     PIC X(4).
                10 CANAL_INGRESO     PIC X(2).
                10 ENTIDAD_UMO       PIC X(4).
                10 CENTRO_UMO        PIC X(4).
                10 USERID_UMO        PIC X(8).
                10 NETNAME_UMO       PIC X(8).
                10 TIMEST_UMO        PIC X(26).