******************************************************************
* NOMBRE ARCHIVO......: WAMAS851
* DESCRIPCION.........: MAESTRO DE CUENTAS (FILTRADA DE LA XMAS01)
* ORGANIZACION........: KSDS
* LONGITUD DE REGISTRO: 328 CARACTERES
******************************************************************
 01  WAMAS851-RECORD.
     03 WAMAS851-TIPO-CUENTA        PIC 9(01).
     03 WAMAS851-CUENTA-TC          PIC 9(11).
     03 WAMAS851-CTA-AUT-MC-DV      PIC 9(01).
     03 WAMAS851-COD-SUCURSAL       PIC 9(03).
     03 WAMAS851-REL-APLICACION     PIC X(04).
     03 WAMAS851-REL-COD-SUC        PIC 9(03).
     03 WAMAS851-REL-TIPO-CTA       PIC 9(01).
     03 WAMAS851-REL-NRO-CTA        PIC 9(12).
     03 WAMAS851-REL-NRO-FIRM       PIC 9(02).
     03 WAMAS851-COD-PRODUCTO       PIC X(01).
     03 WAMAS851-COD-CATEGORIA      PIC 9(01).
     03 WAMAS851-ESTADO-CUENTA      PIC 9(02).
     03 WAMAS851-FEC-BAJA           PIC 9(08).
     03 WAMAS851-MOTIVO-BAJA        PIC 9(02).
     03 WAMAS851-FECHA-ALTA         PIC 9(08).
     03 WAMAS851-NRO-SOLICITUD      PIC 9(06).
     03 WAMAS851-ULT-MODIF-FEC      PIC 9(08).
     03 WAMAS851-ULT-MODIF-ORIG     PIC X(03).
     03 WAMAS851-ULT-MODIF-HORA     PIC 9(06).
     03 WAMAS851-ULT-MODIF-USERID   PIC X(08).
     03 WAMAS851-ULT-MODIF-JNUM     PIC 9(04).
     03 WAMAS851-CARTERA            PIC 9(01).
     03 WAMAS851-APEL-NOMB-EMBOZADO PIC X(24).
     03 WAMAS851-DOMIC-CALLE        PIC X(30).
     03 WAMAS851-DOMIC-NRO          PIC X(05).
     03 WAMAS851-DOMIC-PISO         PIC X(02).
     03 WAMAS851-DOMIC-DEPTO        PIC X(03).
     03 WAMAS851-DOMIC-COD-POSTAL   PIC 9(06).
     03 WAMAS851-DOMIC-LOCALIDAD    PIC X(20).
     03 WAMAS851-DOMIC-COD-PCIA     PIC 9(02).
     03 WAMAS851-TIPO-DOMIC-CORRESP PIC X(01).
     03 WAMAS851-TELEFONO           PIC 9(10).
     03 WAMAS851-TELEFONO-CONTACTO  PIC 9(10).
     03 WAMAS851-CARGO-PORC-BONIF   PIC 9(03).
     03 WAMAS851-CARGO-CUOTAS       PIC 9(02).
     03 WAMAS851-CARGO-MB           PIC 9(01).
     03 WAMAS851-GARANTIA           PIC 9(01).
     03 WAMAS851-NO-RENOV-MOTIVO    PIC 9(01).
     03 WAMAS851-NO-RENOV-FECHA     PIC 9(08).
     03 WAMAS851-PORC-BONIF-ATM     PIC 9(03).
     03 WAMAS851-GRUPO-AFINIDAD     PIC 9(06).
     03 WAMAS851-CAMPANIA-ID        PIC X(06).
     03 WAMAS851-CAMPANIA-NRO-SHOT  PIC 9(02).
     03 WAMAS851-CANAL-VTA          PIC 9(01).
     03 WAMAS851-CBIO-SUC-CTA-MC    PIC 9(03).
     03 WAMAS851-COD-SUC-CTA-MC-ANT PIC 9(03).
     03 WAMAS851-CBIO-CART          PIC 9(01).
     03 WAMAS851-CBIO-LIQ           PIC 9(01).
     03 WAMAS851-CARTERA-ANT        PIC 9(01).
     03 WAMAS851-DA-APLICACION      PIC X(04).
     03 WAMAS851-DA-COD-SUC         PIC 9(03).
     03 WAMAS851-DA-TIPO-CTA        PIC 9(01).
     03 WAMAS851-DA-NRO-CTA         PIC 9(07).
     03 WAMAS851-DA-NRO-FIRM        PIC 9(02).
     03 WAMAS851-TIPO-PAQUETE       PIC X(04).
     03 WAMAS851-DUR-TARJ           PIC 9(02).
     03 WAMAS851-NRO-CTA-EMP        PIC 9(07).
     03 WAMAS851-NRO-CTA-2          PIC 9(07).
     03 WAMAS851-VECES-EN-BOLETIN   PIC 9(03).
     03 WAMAS851-DATOS-GA-ADIC      PIC 9(01).
     03 WAMAS851-IMPRIME-EMP        PIC 9(01).
     03 WAMAS851-USERID-ALTA        PIC X(08).
     03 WAMAS851-TELE-NUEVO-DDN     PIC X(04).
     03 WAMAS851-TELE-NUEVO         PIC X(08).
     03 WAMAS851-MARCA-TC           PIC X(01).
     03 WAMAS851-BC-EMPRESA         PIC X(04).
     03 WAMAS851-BC-PLANTA          PIC X(03).
     03 WAMAS851-BANCO-SEGURO       PIC X(04).
     03 WAMAS851-CTRL-LIM-TARJ      PIC X(01).
     03 WAMAS851-TIPO-TARJETA       PIC X(01).