
         01  S01.
             03  TIPO-CUENTA           PIC 9(01).
             03  CUENTA-TC             PIC 9(11).
             03  CTA-AUT-MC-DV             PIC 9(01).
             03  COD-SUCURSAL              PIC 9(03).
             03  REL-APLICACION        PIC X(04).
             03  REL-COD-SUC           PIC 9(03).
             03  REL-TIPO-CTA          PIC 9(01).
             03  REL-NRO-CTA           PIC 9(13) COMP-3.
             03  REL-NRO-FIRM          PIC 9(02).
             03  COD-PRODUCTO              PIC X(01).
             03  COD-CATEGORIA             PIC 9(01).
             03  ESTADO-CUENTA             PIC 9(02).
             03  FEC-BAJA              PIC 9(08) COMP-3.
             03  MOTIVO-BAJA           PIC 9(02).
             03  FECHA-ALTA            PIC 9(08) COMP-3.
             03  NRO-SOLICITUD         PIC 9(11) COMP-3.
             03  ULT-MODIF-FEC         PIC 9(08) COMP-3.
             03  ULT-MODIF-ORIG        PIC X(03).
             03  ULT-MODIF-HORA        PIC 9(06).
             03  ULT-MODIF-USERID      PIC X(08).
             03  ULT-MODIF-JNUM        PIC 9(04).
             03  CARTERA                   PIC 9(01).
             03  APEL-NOMB-EMBOZADO        PIC X(24).
             03  SEC-DOMICILIO             PIC X(3).
             03  FEC-CBIO-CART             PIC 9(08).
             03  MARCA-INHAB-CL            PIC X(1).
             03  FILLER                            PIC X(57).
             03  SEC-TELEFONO              PIC X(3).
             03  FILLER                            PIC X(17).
             03  CARGO-PORC-BONIF      PIC 9(03).
             03  CARGO-CUOTAS          PIC 9(02).
             03  CARGO-MB              PIC 9(01).
             03  GARANTIA                  PIC 9(01).
             03  NO-RENOV-MOTIVO           PIC 9(01).
             03  NO-RENOV-FECHA            PIC 9(08) COMP-3.
             03  PORC-BONIF-ATM            PIC 9(03).
             03  GRUPO-AFINIDAD            PIC 9(06).
             03  CAMPANIA-ID           PIC X(06).
             03  CAMPANIA-NRO-SHOT     PIC 9(02).
             03  CANAL-VTA                 PIC 9(01).
             03  CBIO-SUC-CTA-MC           PIC 9(03).
             03  COD-SUC-CTA-MC-ANT        PIC 9(03).
             03  CBIO-CART             PIC 9(01).
             03  CBIO-LIQ              PIC 9(01).
             03  CARTERA-ANT               PIC 9(01).
             03  DA-APLICACION         PIC X(04).
             03  DA-COD-SUC            PIC 9(03).
             03  DA-TIPO-CTA           PIC 9(01).
             03  DA-NRO-CTA            PIC 9(07).
             03  DA-NRO-FIRM           PIC 9(02).
             03  TIPO-PAQUETE              PIC X(04).
             03  DUR-TARJ                  PIC 9(02).
             03  NRO-CTA-EMP               PIC 9(07) COMP-3.
             03  NRO-CTA-2                 PIC 9(07) COMP-3.
             03  VECES-EN-BOLETIN          PIC 9(03).
             03  DATOS-GA-ADIC             PIC 9(01).
             03  IMPRIME-EMP               PIC 9(01).
             03  USERID-ALTA               PIC X(08).
             03  FILLER                            PIC  X(12).
             03  MARCA-TC                  PIC X(01).
             03  BC-EMPRESA                PIC X(04).
             03  BC-PLANTA                 PIC X(03).
             03  BANCO-SEGURO              PIC X(04).
             03  CTRL-LIM-TARJ             PIC X.
             03  TIPO-TARJETA              PIC X.
             03  FILLER                            PIC X(07).
             03  MOD-LIM-MEN                  PIC 9(11)V99.
             03  MOD-MAX-REC                  PIC 9(11)V99.
             03  MAR-REC-PPAL                 PIC X(2).
             03  TAR-REC-PPAL                 PIC X(16).
             03  MAR-REC-SEC                  PIC X(2).
             03  TAR-REC-SEC                  PIC X(16).
             03  LIM-COMPRAS-UTIL             PIC 999V99.
             03  LIM-CUOTAS-UTIL              PIC 999V99.
             03  LIM-ADELANTOS-UTIL           PIC 999V99.
             03  FILLER                               PIC X(123).
