            02  TCDTRAC.
               10  COD_ACO_AFIP		   PIC X(08).
               10  COD_ACO_CSF97	   PIC X(08).
               10  COD_ACO_CSF10	   PIC X(08).
               10  COD_ACO_BCRA		   PIC X(08).
               10  FLG_REG_PCP		   PIC X(01).
               10  ENTIDAD_UMO		   PIC X(04).
               10  CENTRO_UMO		   PIC X(04).
               10  USERID_UMO		   PIC X(08).
               10  NETNAME_UMO	 	   PIC X(08).
               10  TIMEST_UMO		   PIC X(26).