01  WACNL801.                                               
03 WACNL801-TIPO-CLIENTE             PIC X(1).
03 WACNL801-SUCURSAL-CUENTA          PIC 9(3).
03 WACNL801-SUCURSAL-MAQUINA         PIC 9(3).
03 WACNL801-CANAL                    PIC X(5).
03 WACNL801-MAQUINA                  PIC X(5).
03 WACNL801-FECHA-AMD                PIC 9(8).
03 WACNL801-HORA                     PIC 9(6).
05 WACNL801-TRANSACCION           PIC 9(6).
03 WACNL801-SERVICIO-ADOM            PIC 9(3).
03 WACNL801-ORI-REV                  PIC X(1).
03 WACNL801-FECHA-AMD-PROCESO        PIC 9(8).
03 WACNL801-MARCA-PERSONA            PIC X(1).
03 WACNL801-NUP                      PIC X(8).
03 WACNL801-USUARIO                  PIC X(8).
03 WACNL801-IMPORTE                  PIC 9(12)V99.
03 WACNL801-DIVISA                   PIC X(3).
03 WACNL801-CANT-CHEQUES             PIC 9(3).
03 WACNL801-PRODUCTO                 PIC X(2).
03 WACNL801-SUBPRODUCTO              PIC X(4).
03 WACNL801-TIPO-OPERACION           PIC X(1).
03 WACNL801-DATOS                    PIC X(57).