          02  WTRI0010.
            10 COD_SUC_MORA                    PIC 9(04).
            10 NRO_CTA_MORA                    PIC 9(12).
            10 COD_PROD_MORA                   PIC X(02).
            10 COD_SUBPR_MORA                  PIC X(04).
            10 COD_MONE_MORA                   PIC X(03).
            10 COD_SUC                         PIC 9(04).
            10 NRO_CTA                         PIC 9(12).
            10 COD_PROD                        PIC X(02).
            10 COD_SUBPR                       PIC X(04).
            10 COD_MONE                        PIC X(03).
            10 FEC_INI_MORA                    PIC X(10).
            10 FEC_FALLIDO                     PIC X(10).
            10 FEC_INI_IMPG                    PIC X(10).
            10 SDO_ORIGEN_MORA                 PIC S9(13)V9(02).
            10 SDO_CAPITAL                     PIC S9(13)V9(02).
            10 SDO_INTERESES                   PIC S9(13)V9(02).
            10 SDO_IMPUESTOS                   PIC S9(13)V9(02).
            10 SDO_AJUSTES                     PIC S9(13)V9(02).
            10 SDO_SEGUROS                     PIC S9(13)V9(02).
            10 SDO_COMISIONES                  PIC S9(13)V9(02).
            10 SDO_TOT_MORA                    PIC S9(13)V9(02).
            10 MON_PGO_CAPITAL                 PIC S9(13)V9(02).
            10 MON_PGO_OTR_CCPTOS              PIC S9(13)V9(02).
            10 MON_PGO_TOT_MORA                PIC S9(13)V9(02).
            10 MON_INCR_DEUDA                  PIC S9(13)V9(02).
            10 COD_ESTADO                      PIC X(02).
            10 FEC_BAJA_MORA                   PIC X(10).
            10 COD_MOT_BAJA_MORA               PIC X(02).
            10 FEC_PGO_MORA                    PIC X(10).
            10 FILLER                          PIC X(12).
