           01  470.
               10 EMPRESA              PIC S9999V USAGE COMP-3.
               10 HAPLAN               PIC X(3).
               10 NUMCTARE             PIC X(15).
               10 DECTAREL             PIC X(65).
               10 DECTARER             PIC X(35).
               10 INDIC                PIC X(1).
               10 FEALT                PIC X(11).
               10 FEULMOD              PIC X(11).
               10 USULMOD              PIC X(8).
               10 TERULMOD             PIC X(4).
               10 HORULMOD             PIC X(9).