
        02  RCD.
            10 CUENTA           PIC X(12).
            10 OFICINA          PIC X(4).
            10 ENTIDAD          PIC X(4).
            10 FELIQ            PIC X(10).
            10 CODCONLI         PIC X(3).
            10 COD-CONCPASO     PIC X(3).
            10 TIPOCPTO-ASOC    PIC X(1).
            10 TIPOCPTO         PIC X(1).
            10 COD-DIVISA       PIC X(3).
            10 TIP-CAMBIO-LIQ   PIC S9(6)V9(5) USAGE COMP-3.
            10 INT-ACEL-FAC     PIC S9(13)V9(4) USAGE COMP-3.
            10 INT-ACEL-REC     PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP-FACTURAD     PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP-RECUPERA     PIC S9(13)V9(4) USAGE COMP-3.
            10 NUM-SEGURO       PIC S9(9)V USAGE COMP-3.
            10 POR-ALICUOTA     PIC S9(3)V9(6) USAGE COMP-3.
            10 IND-LIQIMPUE     PIC X(1).
            10 IMP-BASE         PIC S9(13)V9(4) USAGE COMP-3.
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 USERID-UMO       PIC X(8).
            10 NETNAME-UMO      PIC X(8).
            10 TIMESTAMP        PIC X(26).