           01  WAPRP053.
               10 NRO_LISTA         PIC S9(5)V COMP-3.
               10 NRO_PROD          PIC S9(3)V COMP-3.
               10 DES_CARAC_PAGO    PIC X(20).
               10 MAR_CNTRL_SECU    PIC X(1).
               10 MAR_AUTZ          PIC X(1).
               10 NRO_EMPR_DISTR    PIC S9(5)V COMP-3.
               10 FEC_HRA_ULT_MODF  PIC X(26).
               10 IDE_USER_ULT_MODF  PIC X(10).
               10 IDE_TERM_ULT_MODF  PIC X(5).
               10 COD_TRAT_FEC       PIC X(03).
               10 MAR_EXENTA_IIBB    PIC X.
