           01  WAPRP043.
               10 NRO_LISTA             PIC S9(5)V COMP-3.
               10 NRO_PROD              PIC S9(3)V COMP-3.
               10 DES_CARAC_REND        PIC X(20).
               10 COD_MED_REND          PIC X(2).
               10 MAR_LST_REND          PIC X(1).
               10 COD_ENVI_REND_SIN     PIC X(1).
               10 COD_PER_REND          PIC X(1).
               10 FEC_HRA_ULT_MODF      PIC X(26).
               10 IDE_USER_ULT_MODF     PIC X(10).
               10 IDE_TERM_ULT_MODF     PIC X(5).
               10 COD_DEST_REND         PIC X(2) .
               10 MAR_REND_AJUSTE       PIC X(1) .
               10 COD_INF_DATANET       PIC X(3) .
