           01  WASPE050.
               10 NROEMPRAREC           PIC X(5).
               10 NROEMPR               PIC S9(11)V COMP-3.
               10 NRODIGEMPR            PIC S9(1)V COMP-3.
               10 NROPROD               PIC S9(3)V COMP-3.
               10 NROINSTAN             PIC S9(2)V COMP-3.
               10 FECMIGRACION          PIC X(10).
               10 IDEUSERALTA           PIC X(10).
               10 IDETERMALTA           PIC X(5).
               10 FECALTA               PIC X(10).
               10 TIMULTMODF            PIC X(26).
               10 IDEUSERULTMODF        PIC X(10).
               10 IDETERMULTMODF        PIC X(5).
