           02  527.
             10  COD-ENTIGEN      PIC  X(04).                          
             10  NUM-POSICION     PIC  X(11).                          
             10  NUM-ORDENJUD     PIC  X(11).                          
             10  COD-ORDENJUD     PIC  X(03).                          
             10  NUM-ANOAUTO      PIC  X(04).                          
             10  NUM-JUZGADO      PIC  X(11).                          
             10  TIP-PROCEJUD     PIC  X(01).                          
             10  IMP-RECLAMAD     PIC  9(13)V9(4).                     
             10  NUM-BUFETE       PIC  X(08).                          
             10  IND-SUSPPROC     PIC  X(01).                          
             10  FEC-SUSPPROC     PIC  X(10).                          
             10  FEC-ALTAREG      PIC  X(10).                          
             10  FEC-BAJA         PIC  X(10).                          
             10  FILLER           PIC  X(19).
