
          01 EXP.
            10 ENTIDAD          PIC X(4).
            10 IMPUESTO         PIC X(8).
            10 FECHA-VIG-INICIO PIC X(10).
            10 CONJUNTO         PIC S9(9) USAGE COMP.
            10 CONDICION        PIC X(18).
            10 FECHA-VIG-FIN    PIC X(10).
            10 OPERANDO-1       PIC X(2).
            10 VALOR-ALFA-1     PIC X(20).
            10 VALOR-NUME-1     PIC S9(13)V9(5) USAGE COMP-3.
            10 OPERANDO-2       PIC X(2).
            10 VALOR-ALFA-2     PIC X(20).
            10 VALOR-NUME-2     PIC S9(13)V9(5) USAGE COMP-3.
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 NETNAME-UMO      PIC X(8).
            10 USERID-UMO       PIC X(8).
            10 TIMEST-UMO       PIC X(26).