           01  WAPRP042.
               10 NRO_LISTA           PIC S9(5)V COMP-3.
               10 NRO_PROD            PIC S9(3)V COMP-3.
               10 DES_CARACT_DEUDA    PIC X(20).
               10 COD_CUO             PIC S9(1)V COMP-3.
               10 TPO_VTO             PIC S9(1)V COMP-3.
               10 MAR_LIM_CHEQ        PIC X(1).
               10 MAR_DTO             PIC X(1).
               10 MAR_PUNI            PIC X(1).
               10 CAN_DIA_LAT         PIC S9(3)V COMP-3.
               10 FEC_HRA_ULT_MODF    PIC X(26).
               10 IDE_USER_ULT_MODF   PIC X(10).
               10 IDE_TERM_ULT_MODF   PIC X(5).
               10 MAR_CARGA_MANUAL    PIC X(1).
               10 MAR_FACT_ELECT      PIC X(1).
               10 PUBLICA_DEBIN       PIC X(1).
               10 MAR_GEN_CVU         PIC X(1).
