           02  PEDT084.
                 10 PECDGENT    PIC X(4).
                 10 PENUMPER    PIC X(8).
                 10 PERELOFI    PIC X(3).
                 10 PENUMPUE    PIC X(4).
                 10 PESECREL    PIC S9(3)V COMP-3.
                 10 PEUSUALT    PIC X(8).
                 10 PEFECALT    PIC X(10).
                 10 PEUSUMOD    PIC X(8).
                 10 PETERMOD    PIC X(4).
                 10 PESUCMOD    PIC X(4).
                 10 PEHSTAMP    PIC X(26).
