           02  RVC.
               10 CUENTA           	PIC X(12).
               10 OFICINA          	PIC X(4).
               10 ENTIDAD          	PIC X(4).
			   10 CODCONLI            PIC X(3).
			   10 FECOVALI            PIC X(10).
               10 NUM_SECUENCIA       PIC S9(3)V COMP-3.
			   10 FEFIVALI            PIC X(10).
			   10 PZO_VIGENCIA        PIC X(4).
               10 FEC_PROAVIAC     	PIC X(10).
               10 FEC_PROREVAC     	PIC X(10).
               10 FEC_PROAVIAC_O   	PIC X(10).
               10 FEC_PROREVAC_O   	PIC X(10).
               10 FEC_ULTAVIAC     	PIC X(10).
               10 FEC_ULTREVAC     	PIC X(10).
               10 FEC_ULTREVAC_O   	PIC X(10).
               10 NUM_REVISIONES   	PIC S9(5)V COMP-3.
               10 TIPODIAS         	PIC X(1).
               10 DIA_PAGO         	PIC S9(3)V COMP-3.
               10 PER_REVISIAC     	PIC X(4).
               10 TAS_CORRECAC     	PIC S9(3)V9(6) COMP-3.
               10 TIP_REDONDEO     	PIC X(1).
               10 NUM_REDONDEO     	PIC S9(5)V9(6) COMP-3.
               10 COD_CLAREVIS     	PIC X(3).
               10 IND_AJUSINHA     	PIC X(1).
               10 COD_MOTIVO       	PIC X(1).
               10 IND_MODREVIS     	PIC X(1).
               10 COD_DIVISA       	PIC X(3).
               10 IMPMINI          	PIC S9(13)V9(4) COMP-3.
               10 IMPMAXI          	PIC S9(13)V9(4) COMP-3.
			   10 ENTIDAD_UMO         PIC X(4).
			   10 CENTRO_UMO          PIC X(4).
			   10 USERID_UMO          PIC X(8).
			   10 NETNAME_UMO         PIC X(8).
			   10 TIMEST_UMO          PIC X(26).
