           01 680.
               10 EMPRESA              PIC S9999V USAGE COMP-3.
               10 HAPLAN               PIC X(3).
               10 NUCTABCRA            PIC X(15).
               10 TICTA                PIC X(1).
               10 TICTAORD             PIC X(1).
               10 TOTALCON             PIC X(1).
