        05 REG-IBECADSF.                                                       
           10 PERIODO            PIC X(06).                                     
           10 NUM-EJECUCION      PIC 9(01).                                     
           10 ID-INTERFASE       PIC X(02).                                     
           10 NUM-PERSONA        PIC X(08).                                     
           10 COD-ENTIDAD        PIC X(04).                                     
           10 COD-CENTRO         PIC X(04).                                     
           10 NUM-CONTRATO       PIC X(12).                                     
           10 COD-PRODUCTO       PIC X(02).                                     
           10 COD-SUBPRODU       PIC X(04).                                     
           10 COD-DIVISA         PIC X(03).                                     
           10 NUM-IDENTIFICACION PIC 9(05).                                     
           10 TIP-DOC            PIC X(02).                                     
           10 NUM-DOCUMENTO      PIC X(11).                                     
           10 FEC-ALTA-CONTRATO  PIC X(10).                                     
           10 FEC-VTO-CTO        PIC X(10).                                     
           10 MCA-MIPYME-CLI     PIC X(02).                                     
           10 MCA-MIPYME-CTO     PIC X(01).                                     
           10 TIPO-CLIENTE       PIC X(01).                                     
           10 SEGMENTO           PIC X(02).                                     
           10 COD-DEST-FONDOS    PIC X(05).                                     
           10 COD-CONCEPTO       PIC X(02).                                     
           10 TIPO-GTIA          PIC X(01).                                     
           10 COD-GTIA           PIC X(02).                                     
           10 TIPO-CARTERA       PIC X(01).                                     
           10 FAMILIA-RUBRO      PIC X(01).                                     
           10 SIT-BCRA           PIC X(02).                                     
           10 COD-RUBRO-ALTAIR   PIC X(15).                                     
           10 COD-RUBRO-BCRA     PIC X(15).                                     
           10 COD-RUBRO-CARGABAL PIC X(15).                                     
           10 FEC-PRIM-INC       PIC X(10).                                     
           10 DIAS-ATRASO        PIC 9(04).                                     
           10 TRAMO              PIC X(01).                                     
           10 SIGNO-1            PIC X(01).                                     
           10 IMP-DEUDA          PIC X(17).                                     
           10 SIGNO-2            PIC X(01).                                     
           10 IMP-PREV           PIC X(17).                                     
           10 SIGNO-3            PIC X(01).                                     
           10 MONTO-ORIGINAL     PIC X(17).                                     
           10 TASA               PIC X(01).                                     
           10 SIGNO-4            PIC X(01).                                     
           10 VALOR-TASA-OPER    PIC X(05).                                     
           10 TIPO-PAQUETE       PIC X(04).                                     
           10 PROD-PAQUETE       PIC X(02).                                     
           10 SPROD-PAQUETE      PIC X(04).                                     
           10 PROD-ORIGINAL      PIC X(02).                                     
           10 SPROD-ORIGINAL     PIC X(04).                                     
           10 FEC-UPGRADE-PAQ    PIC X(10).                                     
           10 FEC-ALTA-PROD      PIC X(10).                                     
           10 FEC-VTO-PROD       PIC X(10).                                     
           10 MARCA-ALTAIR       PIC X(02).                                     
           10 SUBMARCA-ALTAIR    PIC X(04).                                     
           10 FEC-ING-MORIA      PIC X(10).                                     
           10 FEC-ING-EMERIX     PIC X(10).                                     
           10 FEC-PRIM-CUOTA     PIC X(10).                                     
           10 PLAZO              PIC 9(05).                                     
           10 COD-PROCED         PIC X(03).                                     
           10 COD-CANAL          PIC X(02).                                     
           10 COD-SUC-ORIGEN     PIC X(04).                                     
           10 NUM-CAMPANIA       PIC X(06).                                     
           10 NUM-SHOT           PIC 9(02).                                     
	       10 MARCA-CASTIGO-CONTRATO        PIC X(01).                          
	       10 MARCA-CASTIGO-CLIENTE         PIC X(01).