           01  PEDT018.
               10 PECDGENT              PIC X(4).
               10 PENUMPER              PIC X(8).
               10 PESECCON              PIC S9(3)V.
               10 PETIPCON              PIC X(2).
               10 PEACCCON              PIC X(2).
               10 PEPRAPEC              PIC X(20).
               10 PESGAPEC              PIC X(20).
               10 PENOMCON              PIC X(40).
               10 PETIDOCC              PIC X(2).
               10 PENUDOCC              PIC X(11).
               10 PECONPRI              PIC X(1).
               10 PENOMSEC              PIC X(30).
               10 PECARCON              PIC X(2).
               10 PEDEPCON              PIC X(3).
               10 PESECDOM              PIC S9(3)V.
               10 PETELCON              PIC X(10).
               10 PENUMINT              PIC X(20).
               10 PEEMAILC              PIC X(50).
               10 PEMARPER              PIC X(1).
               10 PEUSUALT              PIC X(8).
               10 PEFECALT              PIC X(10).
               10 PEUSUMOD              PIC X(8).
               10 PETERMOD              PIC X(4).
               10 PESUCMOD              PIC X(4).
               10 PEHSTAMP              PIC X(26).
               10 PEOBSCON_LEN          PIC S9(4).
               10 PEOBSCON_TEXT         PIC X(250).
               10 PEPRETEL              PIC X(7).