      ******************************************************************00000100
      * TXT DE COBRANZAS                                                00000200
      ******************************************************************00000300
           02 MDEC0430.                                                 00000400
                10 COD_GESTOR                PIC X(4).                  00000600
                10 FILLER_01                 PIC X(1).                  00000700
                10 NOMBRE_GESTOR             PIC X(60).                 00000800
                10 FILLER_02                 PIC X(1).                  00000900
                10 COD_ENTIDAD               PIC X(4).                  00001000
                10 FILLER_03                 PIC X(1).                  00001100
                10 COD_CENTRO                PIC X(4).                  00001200
                10 FILLER_04                 PIC X(1).                  00001300
                10 NUM_CONTRATO              PIC X(12).                 00001400
                10 FILLER_05                 PIC X(1).                  00001500
                10 COD_PRODUCTO              PIC X(2).                  00001600
                10 FILLER_06                 PIC X(1).                  00001700
                10 COD_SUBPRODU              PIC X(4).                  00001800
                10 FILLER_07                 PIC X(1).                  00001900
                10 COD_DIVISA                PIC X(3).                  00002000
                10 FILLER_08                 PIC X(1).                  00002100
                10 IDF_CANCELAC              PIC X(24).                 00002200
                10 FILLER_09                 PIC X(1).                  00002300
JP3007          10 COD_TIPCANCE              PIC X(02).                 00002400
JP3007          10 FILLER_10                 PIC X(1).                  00002500
                10 COD_ESTADO                PIC X(2).                  00002600
                10 FILLER_11                 PIC X(1).                  00002700
                10 COD_CLASEPRO              PIC X(2).                  00002800
                10 FILLER_12                 PIC X(1).                  00002900
                10 FEC_CAN_OPER              PIC X(10).                 00003000
                10 FILLER_13                 PIC X(1).                  00003100
                10 FEC_CAN_VALO              PIC X(10).                 00003200
                10 FILLER_14                 PIC X(1).                  00003300
                10 COD_CENTCANC              PIC X(4).                  00003400
                10 FILLER_15                 PIC X(1).                  00003500
                10 COD_USRCANC               PIC X(8).                  00003600
                10 FILLER_16                 PIC X(1).                  00003700
                10 IMP_TOTCANCO              PIC X(14).                 00003800
                10 FILLER_17                 PIC X(1).                  00003900
                10 IMP_CAPITALO              PIC X(14).                 00004000
                10 FILLER_18                 PIC X(1).                  00004100
                10 IMP_INTERESO              PIC X(14).                 00004200
                10 FILLER_19                 PIC X(1).                  00004300
                10 IMP_IMPUESO               PIC X(14).                 00004400
                10 FILLER_20                 PIC X(1).                  00004500
                10 NUM_PERSONA               PIC X(8).                  00004600
                10 FILLER_21                 PIC X(1).                  00004700
                10 NOMBRE_CLIENTE            PIC X(60).                 00004800
                10 FILLER_22                 PIC X(1).                  00004900
                10 NUM_BUFETE                PIC X(8).                  00005000
                10 FILLER_23                 PIC X(1).                  00005100
                10 NOMBRE_BUFETE             PIC X(60).                 00005200
                10 FILLER_24                 PIC X(1).                  00005300
                10 NUM_PP                    PIC X(10).                 00005400
                10 FILLER_25                 PIC X(1).                  00005500
                10 IND_PDTEPROC              PIC X(1).                  00005600
                10 FILLER_26                 PIC X(1).                  00005700
                10 NUM_POSICION              PIC X(11).                 00005800
                10 FILLER_27                 PIC X(1).                  00005900
                10 NUM_ORDENJUD              PIC X(11).                 00006000
                10 FILLER_28                 PIC X(1).                  00006100
                10 COD_ORDENJUD              PIC X(3).                  00006200
                10 FILLER_29                 PIC X(1).                  00006300
                10 NUM_ANOAUTO               PIC X(4).                  00006400
                10 FILLER_30                 PIC X(1).                  00006500
                10 NUM_JUZGADO               PIC X(11).                 00006600
                10 FILLER_31                 PIC X(1).                  00006700
JP0112          10 NUM_GARANTIA              PIC X(09).                 00006800
                10 FILLER_32                 PIC X(1).                  00006900
JP1412          10 COD_GARANTIA              PIC X(03).                 00007000
                10 FILLER_33                 PIC X(1).                  00007100
                10 IND_SITUCONT              PIC X(001).                00007200
                10 FILLER_34                 PIC X(1).                  00007300
                10 COD_MARCONTR              PIC X(002).                00007400
                10 FILLER_35                 PIC X(1).                  00007500
                10 COD_SUBMARCA              PIC X(002).                00007600
                10 FILLER_36                 PIC X(1).                  00007700
                10 IND_BLOQUEO               PIC X(001).                00007800
                10 FILLER_37                 PIC X(1).                  00007900
                10 TIP_PROCEJUD              PIC X(001).                00008000
                10 FILLER_38                 PIC X(1).                  00008100
                10 IMP_CANCCTO               PIC X(14).                 00008200
                10 FILLER_39                 PIC X(1).                  00008300
                10 IMP_CANCGASC              PIC X(14).                 00008400
                10 FILLER_40                 PIC X(1).                  00008500
      *____   TOTALES POR IDF/CONTRATO/RECIBO.                          00008600
              10 TOTAL_CONTABLE                  PIC X(14).             00008800
              10 FILLER_41                       PIC X(1).              00008900
              10 TOTAL_NO_CONTABLE               PIC X(14).             00009000
              10 FILLER_42                       PIC X(1).              00009100
              10 SOBRE_DEVENGADO.                                       00009200
                    20 IMPDEV_CAPITAL            PIC X(14).             00009400
                    20 FILLER_43                 PIC X(1).              00009500
                    20 IMPDEV_INTERES            PIC X(14).             00009600
                    20 FILLER_44                 PIC X(1).              00009700
                    20 IMPDEV_AJUSTE             PIC X(14).             00009800
                    20 FILLER_45                 PIC X(1).              00009900
                    20 IMPUDEV_IVA1              PIC X(14).             00010100
                    20 FILLER_46                 PIC X(1).              00010200
                    20 IMPUDEV_IVA2              PIC X(14).             00010300
                    20 FILLER_47                 PIC X(1).              00010400
                    20 IMPUDEV_ING_B             PIC X(14).             00010500
                    20 FILLER_48                 PIC X(1).              00010600
                    20 IMPUDEV_IMP_E             PIC X(14).             00010700
                    20 FILLER_49                 PIC X(1).              00010800
                    20 IMPUDEV_OTRO              PIC X(14).             00010900
                    20 FILLER_50                 PIC X(1).              00011000
                    20 IMPUDEV_TOTAL             PIC X(14).             00011100
                    20 FILLER_51                 PIC X(1).              00011200
                    20 IMPERC_COMISION           PIC X(14).             00011500
                    20 FILLER_52                 PIC X(1).              00011600
                    20 IMPERC_SEG_VIDA           PIC X(14).             00011700
                    20 FILLER_53                 PIC X(1).              00011800
                    20 IMPERC_SEG_INCE           PIC X(14).             00011900
                    20 FILLER_54                 PIC X(1).              00012000
                    20 IMPERC_SEG_TOTAL          PIC X(14).             00012100
                    20 FILLER_55                 PIC X(1).              00012200
                    20 IMPERC_GASTOS_MORIA                              00012300
                                                 PIC X(14).             00012400
                    20 FILLER_56                 PIC X(1).              00012500
                    20 IMPERC_GASTOS_UG          PIC X(14).             00012600
                    20 FILLER_57                 PIC X(1).              00012700
                    20 IMPERC_INT_CPS            PIC X(14).             00012800
                    20 FILLER_58                 PIC X(1).              00012900
                    20 IMPERC_INT_MOR            PIC X(14).             00013000
                    20 FILLER_59                 PIC X(1).              00013100
                    20 IMPERC_AJUSTE             PIC X(14).             00013200
                    20 FILLER_60                 PIC X(1).              00013300
                    20 IMPERC_INTERES            PIC X(14).             00013400
                    20 FILLER_61                 PIC X(1).              00013500
                    20 IMPUPERC_IVA1             PIC X(14).             00013700
                    20 FILLER_62                 PIC X(1).              00013800
                    20 IMPUPERC_IVA2             PIC X(14).             00013900
                    20 FILLER_63                 PIC X(1).              00014000
                    20 IMPUPERC_ING_B            PIC X(14).             00014100
                    20 FILLER_64                 PIC X(1).              00014200
                    20 IMPUPERC_IMP_E            PIC X(14).             00014300
                    20 FILLER_65                 PIC X(1).              00014400
                    20 IMPUPERC_OTRO             PIC X(14).             00014500
                    20 FILLER_66                 PIC X(1).              00014600
                    20 IMPUPERC_TOTAL            PIC X(14).             00014700
                    20 FILLER_67                 PIC X(1).              00014800
JP3007*     05 FILLER_68                         PIC X(422).            00014900
JP3007      05 FILLER_69                         PIC X(419).            00015000