          02  RFR.
            10 CUENTA-NUEVA     PIC X(12).
            10 OFICINA-NUEVA  PIC X(4).
            10 ENTIDAD-NUEVA  PIC X(4).
            10 PROD-NUEVO       PIC X(2).
            10 SUBPRO-NUEVO     PIC X(4).
            10 UNANY          PIC X(4).
            10 UCLAVEAN         PIC X(20).
            10 UFTRASP            PIC X(10).
            10 ENTIDAD-UMO      PIC X(4).
            10 CENTRO-UMO       PIC X(4).
            10 USERID-UMO       PIC X(8).
            10 NETNAME-UMO      PIC X(8).
            10 TIMEST-UMO       PIC X(26).
