	      01 PTCOSQ.
            10 ENTIDAD               PIC X(04).
            10 OFICINA               PIC X(04).
            10 CUENTA                PIC X(12).
            10 PRODUCTO              PIC X(02).
            10 SUBPRO                PIC X(04).
            10 DIVISA                PIC X(03).
            10 CANT_DIA_IMP          PIC 9(04).
            10 CANT_REC_IMP          PIC 9(04).
            10 FEC_PRIMER_IMP        PIC X(10).
            10 CAPITAL_VENCIDO       PIC S9(13)V9(4) COMP-3.
            10 CAPITAL_AJUST_VENC    PIC S9(13)V9(4) COMP-3.
            10 INTERES_VENCIDO       PIC S9(13)V9(4) COMP-3.
            10 COMISION_VENCIDO      PIC S9(13)V9(4) COMP-3.
            10 SEGUROS_VENCIDO       PIC S9(13)V9(4) COMP-3.
            10 IMPUESTOS_VENCIDO     PIC S9(13)V9(4) COMP-3.
            10 GASTOS_VENCIDO        PIC S9(13)V9(4) COMP-3.
            10 OTROS_CONCEP          PIC S9(13)V9(4) COMP-3.
            10 CAPITAL_MES           PIC S9(13)V9(4) COMP-3.
            10 CAPITAL_AJUST_MES     PIC S9(13)V9(4) COMP-3.
            10 INTERESE_MES          PIC S9(13)V9(4) COMP-3.
            10 SEGUROS_MES           PIC S9(13)V9(4) COMP-3.
            10 IMPUESTOS_MES         PIC S9(13)V9(4) COMP-3.
            10 GASTOS_MES            PIC S9(13)V9(4) COMP-3.
            10 COMISIONES_MES        PIC S9(13)V9(4) COMP-3.
            10 OTROS_MES             PIC S9(13)V9(4) COMP-3.
            10 FECHA_ULT_COBRO       PIC X(10).
            10 NRO_CUOT_COBRO        PIC 9(04).
            10 CANT_REC_MES          PIC 9(04).
            10 CAPITAL_CAN_MES       PIC S9(13)V9(4) COMP-3.
            10 CAP_AJUST_CAN_MES     PIC S9(13)V9(4) COMP-3.
            10 INTERESE_CAN_MES      PIC S9(13)V9(4) COMP-3.
            10 SEGUROS_CAN_MES       PIC S9(13)V9(4) COMP-3.
            10 IMPUESTOS_CAN_MES     PIC S9(13)V9(4) COMP-3.
            10 GASTOS_CAN_MES        PIC S9(13)V9(4) COMP-3.
            10 COMISIONES_CAN_MES    PIC S9(13)V9(4) COMP-3.
            10 COMISIONES_FORM       PIC S9(13)V9(4) COMP-3.
            10 COMISIONES_OTRO_EV    PIC S9(13)V9(4) COMP-3.
            10 FILLER                           PIC X(150).