          02 PRO.
             10 ENTIDAD      PIC X(4).  
             10 PRODUCTO      PIC X(2).  
             10 SUBPRO      PIC X(4).  
             10 FECOVALI      PIC X(10).  
             10 FEFIVALI      PIC X(10).  
             10 COD-ESTPROD      PIC X(1).  
             10 TEXTORED      PIC X(15).  
             10 TEXTOLAR      PIC X(50).  
             10 COD-DIVISA      PIC X(3).  
             10 TIP-PRODUCTO      PIC X(2).  
             10 COD-GRUPOPRO      PIC X(4).  
             10 IND-MOD-OPER      PIC X(1).  
             10 NIVCONCE      PIC X(1).  
             10 IND-CTAOBLIG      PIC X(1).  
             10 UGQFIMIN      PIC S9(3)V USAGE COMP-3.
             10 UGYPREMP      PIC X(1).  
             10 IND-CLASEPRO      PIC X(1).  
             10 IND-FINIQUIT      PIC X(1).  
             10 IND-SUJREVCO      PIC X(1).  
             10 IND-CANCAUTO      PIC X(1).  
             10 IND-EJECFORZ      PIC X(1).  
             10 NUM-DIAS-PAGOEJ      PIC S9(3)V USAGE COMP-3.
             10 COD-PRELACION      PIC X(3).  
             10 MODCOBRO      PIC X(1).  
             10 PLZ-MIN-ENTREGAS      PIC X(4).  
             10 IND-REVOLVENTE      PIC X(1).  
             10 IMPMAXGE      PIC S9(13)V9(4) USAGE COMP-3.
             10 DIV-IMPMAXGE      PIC X(3).  
             10 IMP-MINGEN      PIC S9(13)V9(4) USAGE COMP-3.
             10 POR-MAXCONC      PIC S9(3)V9(6) USAGE COMP-3.
             10 POR-MAXCUOT      PIC S9(3)V9(6) USAGE COMP-3.
             10 IMP-MININGR      PIC S9(13)V9(4) USAGE COMP-3.
             10 NUM-EDADMIN      PIC S9(3)V USAGE COMP-3.
             10 NUM-EDADMAX      PIC S9(3)V USAGE COMP-3.
             10 CUPOTOPR      PIC S9(13)V9(4) USAGE COMP-3.
             10 CUPODIPR      PIC S9(13)V9(4) USAGE COMP-3.
             10 PLAZOMIN      PIC X(4).  
             10 PLAZOMAX      PIC X(4).  
             10 PLAZOMAX-RENOV      PIC X(4).  
             10 UGCCAMIN      PIC X(4).  
             10 UGCCAMAX      PIC X(4).  
             10 NUM-DIAS-ABONO      PIC S9(3)V USAGE COMP-3.
             10 IND-AMPLAVAL      PIC X(1).  
             10 INDCUOFI      PIC X(1).  
             10 IND-CUPOREVO      PIC X(1).  
             10 IND-COBPARC      PIC X(1).  
             10 IMPMIPAR      PIC S9(13)V9(4) USAGE COMP-3.
             10 IND-CUOANTIC      PIC X(1).  
             10 IND-APLRETEN      PIC X(1).  
             10 IND-CARGOAUT      PIC X(1).  
             10 INDISSU      PIC X(1).  
             10 NUM-MAXDISPO      PIC S9(3)V USAGE COMP-3.
             10 PORDISPO      PIC S9(3)V9(6) USAGE COMP-3.
             10 IMP-MINDISPO      PIC S9(13)V9(4) USAGE COMP-3.
             10 IMP-MAXDISPO      PIC S9(13)V9(4) USAGE COMP-3.
             10 IND-RENOVPLA      PIC X(1).  
             10 INDENTAN      PIC X(1).  
             10 IND-MINENTANTIC      PIC X(1).  
             10 IMPMINEA      PIC S9(13)V9(4) USAGE COMP-3.
             10 POR-MINEA      PIC S9(3)V9(6) USAGE COMP-3.
             10 NUM-MINEA      PIC S9(3)V USAGE COMP-3.
             10 IND-IMPAVOL      PIC X(1).  
             10 IND-ADMPRORR      PIC X(1).  
             10 IND-ADMRENOV      PIC X(1).  
             10 IND-CONDES      PIC X(1).  
             10 IND-ADMCANAL      PIC X(1).  
             10 IND-ADMSEGME      PIC X(1).  
             10 IND-ADMSUBVE      PIC X(1).  
             10 IND-ADMEMPRE      PIC X(1).  
             10 IND-ADMAGENT      PIC X(1).  
             10 IND-ADMPAQUE      PIC X(1).  
             10 IND-ADMCAMPA      PIC X(1).  
             10 IND-COBRZAEX      PIC X(1).  
             10 IND-CARAUT-CBE      PIC X(1).  
             10 IND-ARRENDAM      PIC X(1).  
             10 IMP-MINTIMBR      PIC S9(13)V9(4) USAGE COMP-3.
             10 IMP-MINGIRO      PIC S9(13)V9(4) USAGE COMP-3.
             10 IMP-MAXCUOTA      PIC S9(13)V9(4) USAGE COMP-3.
             10 NUM-CUOMIN      PIC S9(7)V USAGE COMP-3.
             10 NUM-CUOMAX      PIC S9(7)V USAGE COMP-3.
             10 NUM-CUORED      PIC S9(7)V USAGE COMP-3.
             10 IND-CAPINTER      PIC X(1).  
             10 IND-ADMCUEXT      PIC X(1).  
             10 IND-PREMIO      PIC X(1).  
             10 IND-DESGL-MVTOS      PIC X(1).  
             10 IND-CADIC      PIC X(1).  
             10 NUM-MAX-PAG-ADI      PIC S9(4)V USAGE COMP-3.
             10 POR-MAX-PAG-ADI      PIC S9(3)V9(6) USAGE COMP-3.
             10 DIA-FACAN      PIC S9(3) COMP-3. 
             10 IND-CALCUO-DOS-T      PIC X(1).  
             10 IND-ENDOSO      PIC X(1).  
             10 SALDO-MIN-AUTOM      PIC S9(13)V9(4) COMP-3. 
             10 NUMDEC      PIC S9(1) COMP-3. 
             10 COD-CTG-RTT      PIC X(02).  
             10 COD-STC-CTB      PIC X(02).  
             10 ENTIDAD-UMO      PIC X(4).  
             10 CENTRO-UMO      PIC X(4).  
             10 USERID-UMO      PIC X(8).  
             10 NETNAME-UMO      PIC X(8).  
             10 TIMEST-UMO      PIC X(26).  
             10 IND-INDEXADO      PIC X(1).  
             10 COEFICI-INDEX      PIC X(4).  
             10 COEFICI-VISUAL      PIC X(4).  