      ******************************************************************
      *             DESCRIPCION DE LOS CAMPOS DE LA COPY.              *
      *     DISEO ARCHIVO DE CONTRATOS REFINANCIADOS EN PLAN DE PAGO  *
      ******************************************************************
           02  MOEC1800.
               10  FEC-CAN-OPER            PIC X(010).
               10  FILLER_01               PIC X(001).
               10  COD-DIVIORIG            PIC X(003).
               10  FILLER_02               PIC X(001).
               10  IMP-TOTCANCO            PIC X(010).
               10  FILLER_03               PIC X(001).
               10  COD-GESTOR              PIC X(004).
               10  FILLER_04               PIC X(001).
               10  COD-CENTROP             PIC X(004).
               10  FILLER_05               PIC X(001).
               10  NUM-PP                  PIC 9(010).
               10  FILLER_06               PIC X(001).
               10  NUM-PERSONA             PIC X(008).
               10  FILLER_07               PIC X(001).
               10  NOMBRE-CLIENTE          PIC X(100).
               10  FILLER_08               PIC X(001).
               10  COD-CENTRO              PIC X(004).
               10  FILLER_09               PIC X(001).
               10  NUM-CONTRATO            PIC X(012).
               10  FILLER_10               PIC X(001).
               10  COD-PRODUCTO            PIC X(002).
               10  FILLER_11               PIC X(001).
               10  COD-SUBPRODU            PIC X(004).
               10  FILLER_12               PIC X(001).
               10  COD-DIVISA              PIC X(003).
               10  FILLER_13               PIC X(001).
               10  NUM-BUFETE              PIC X(008).
               10  FILLER_14               PIC X(001).
               10  COD-CENTRO-PP           PIC X(004).
               10  FILLER_15               PIC X(001).
               10  IMP-TOTPP               PIC X(010).
               10  FILLER_16               PIC X(001).
               10  IMP-CUOTA0              PIC X(010).
               10  FILLER_17               PIC X(001).
               10  FEC-PAGO                PIC X(010).
               10  FILLER_18               PIC X(001).
               10  COD-ENTIDADR            PIC X(004).
               10  FILLER_19               PIC X(001).
               10  COD-CENTROR             PIC X(004).
               10  FILLER_20               PIC X(001).
               10  NUM-CONTRATR            PIC X(012).
               10  FILLER_21               PIC X(001).
               10  COD-PRODUCTR            PIC X(002).
               10  FILLER_22               PIC X(001).
               10  COD-SUBPRODR            PIC X(004).
               10  FILLER_23               PIC X(001).
               10  COD-ESTADO              PIC X(001).
               10  FILLER_24               PIC X(001).
               10  COD-ESTADO-MD           PIC X(002).
               10  FILLER_25               PIC X(001).
               10  FEC-RECONOCI            PIC X(010).
               10  FILLER_26               PIC X(001).
               10  FEC-VTOCUO0             PIC X(0010).