           01 PEDT075.
               10 PECDGENT         PIC X(4).
               10 PENUMCON         PIC X(12).
               10 PECODOFI         PIC X(4).
               10 PECODENT         PIC X(4).
               10 PECODPRO         PIC X(2).
               10 PECODSUB         PIC X(4).
               10 PECODMON         PIC X(3).
               10 PENUMSUB         PIC X(20).
               10 PEDESCRI         PIC X(30).
               10 PESUCOPE         PIC X(4).
               10 PEOFIOPE         PIC X(4).
               10 PECANVEN         PIC X(3).
               10 PEOFIVEN         PIC X(4).
               10 PEOFICOM         PIC X(4).
               10 PESDOANT         PIC S9(16)V9(2) USAGE COMP-3.
               10 PESDOPRO         PIC S9(16)V9(2) USAGE COMP-3.
               10 PEFECINI         PIC X(10).
               10 PEFECTER         PIC X(10).
               10 PEESTOPE         PIC X(1).
               10 PEFECEST         PIC X(10).
               10 PEMOTEST         PIC X(2).
               10 PESUBEST         PIC X(2).
               10 PECOPYDT         PIC X(8).
               10 PEUSUALT         PIC X(8).
               10 PEFECALT         PIC X(10).
               10 PEUSUMOD         PIC X(8).
               10 PETERMOD         PIC X(4).
               10 PESUCMOD         PIC X(4).
               10 PEHSTAMP         PIC X(26).
               10 PEINFDET_LEN     PIC S9(4) USAGE COMP.
               10 PEINFDET_TEXT    PIC X(120).