           01  PEDT083.
               10 PECDGENT    PIC X(4).
               10 PENUMPER    PIC X(8).
               10 PESECNOM    PIC S9(3)V USAGE COMP-3.
               10 PETIPUSO    PIC X(3).
               10 PENUMCON    PIC X(12).
               10 PECODOFI    PIC X(4).
               10 PECODENT    PIC X(4).
               10 PECODPRO    PIC X(2).
               10 PECODSUB    PIC X(4).
               10 PEUSUALT    PIC X(8).
               10 PEFECALT    PIC X(10).
               10 PEUSUMOD    PIC X(8).
               10 PETERMOD    PIC X(4).
               10 PESUCMOD    PIC X(4).
               10 PEHSTAMP    PIC X(26).