           02  PEDT014.                                                                                                          
               10 PECDGENT         PIC X(04).                           
               10 PENUMPER         PIC X(08).                           
               10 PESECINF         PIC S9(3)V COMP-3.                                                             
               10 PECODINF         PIC X(05).                           
               10 PEVALPER         PIC S9(16)V9(2) COMP-3.        
               10 PEVALBAN         PIC S9(16)V9(2) COMP-3.        
               10 PEIMPREL         PIC S9(16)V9(2) COMP-3.        
               10 PEBIEGRA         PIC X(01).                           
               10 PENUMROL         PIC X(15).                           
               10 PEFECADQ         PIC X(10).                           
               10 PESUPCUB         PIC X(10).                           
               10 PEGASALQ         PIC S9(16)V9(2) COMP-3.        
               10 PEINGALQ         PIC S9(16)V9(2) COMP-3.        
               10 PEMARAUT         PIC X(20).                           
               10 PEMODAUT         PIC X(20).                           
               10 PEANTBIE         PIC X(03).                           
               10 PERELPRO         PIC X(03).                           
               10 PEINMVEN         PIC X(01).                           
               10 PECUOPRE         PIC S9(16)V9(2) COMP-3.        
               10 PEDEUPEN         PIC S9(16)V9(2) COMP-3.        
               10 PEOFICAR         PIC X(04).                           
               10 PEINDCON         PIC X(01).                           
               10 PEINDBIE         PIC X(01).                           
               10 PEGASSEG         PIC S9(16)V9(2) COMP-3.        
               10 PEGASIMP         PIC S9(16)V9(2) COMP-3.        
               10 PEGASEXP         PIC S9(16)V9(2) COMP-3.        
               10 PEGASOTR         PIC S9(16)V9(2) COMP-3.        
               10 PEANOROD         PIC X(10).                           
               10 PENOMTEN         PIC X(20).                           
               10 PETENFON         PIC X(01).                           
               10 PECODMON         PIC X(03).                           
               10 PEIMPPAT         PIC S9(16)V9(2) COMP-3.        
               10 PEUSUALT         PIC X(08).                           
               10 PEFECALT         PIC X(10).                           
               10 PEFECMOD         PIC X(10).                           
               10 PEUSUMOD         PIC X(08).                           
               10 PETERMOD         PIC X(04).                           
               10 PESUCMOD         PIC X(04).                           
               10 PEHSTAMP         PIC X(26).                                                                      
               10 PEOBSERV_LEN     PIC S9(4) COMP.                
               10 PEOBSERV_TEXT    PIC X(180).                                                                                                                                                   
               10 PEDOMDCL_LEN     PIC S9(4) COMP.                
               10 PEDOMDCL_TEXT    PIC X(100).                      