01  BGTCBAN.                                  
                                              
    05 BAN-CLAVE.                             
       10 BAN-PLAN                  PIC X(04).
       10 BAN-CONCEPTO              PIC X(04).
       10 BAN-TITULARIDAD           PIC X(02).
       10 BAN-RED                   PIC X(04).
       10 BAN-FECHA-DESDE           PIC X(10).
                                              
    05 BAN-DATOS.                             
       10 BAN-FECHA-HASTA           PIC X(10).
       10 BAN-COMISION              PIC X(04).
                                              
    05 BAN-STAMP.                             
       10 BAN-ENTIDAD-UMO           PIC X(04).
       10 BAN-CENTRO-UMO            PIC X(04).
       10 BAN-USERID-UMO            PIC X(08).
       10 BAN-NETNAME-UMO           PIC X(08).
       10 BAN-TIMEST-UMO            PIC X(26).