	      01 RPE.
            10 CUENTA           PIC X(12).
            10 OFICINA          PIC X(4).
            10 ENTIDAD          PIC X(4).
            10 COD_EVENTO       PIC X(4).
            10 CODCONLI         PIC X(3).
            10 FEOPER           PIC X(10).
            10 ENTIDAD_CONT     PIC X(4).
            10 OFICINA_CONT     PIC X(4).
            10 PRODUCTO         PIC X(2).
            10 SUBPROD          PIC X(4).
            10 IND_CLASEPRO     PIC X(1).
            10 FECONTA          PIC X(10).
            10 FEINILIQ         PIC X(10).
            10 FEFINLIQ         PIC X(10).
            10 FEC_SUSPDEVE     PIC X(10).
            10 FEC_EXTORNO      PIC X(10).
            10 IMP_PERIODIFI    PIC S9(13)V9(4) USAGE COMP-3.
            10 IMP_CONTRAVALOR  PIC S9(13)V9(4) USAGE COMP-3.
            10 COD_DIVISA       PIC X(3).
            10 INDINANT         PIC X(1).
            10 ENTIDAD_UMO      PIC X(4).
            10 CENTRO_UMO       PIC X(4).
            10 USERID_UMO       PIC X(8).
            10 NETNAME_UMO      PIC X(8).
            10 TIMESTAMP        PIC X(26).