        ******************************************************************
        * NOMBRE DEL OBJETO : ZBTCAPF                                    *
        ******************************************************************
           02  ZBDTAPF.
            10 ENTIDAD       	PIC  X(04).
            10 CENTRO_ALTA   	PIC  X(04).
            10 CUENTA        	PIC  X(12).
            10 SECUENCIA        PIC  S9(5)V COMP-3.
            10 SECUENCIA_REN    PIC  S9(5)V COMP-3.
            10 NUP              PIC  X(08).
            10 CONTEO           PIC  S9(13)V9(4) COMP-3.
            10 MARCA_GTIA       PIC  X(01).
            10 IND_TASA_REG     PIC  X(01).
            10 OBSERVACIONES    PIC  X(250).
            10 ENTIDAD_UMO_A    PIC  X(04).
            10 CENTRO_UMO_A     PIC  X(04).
            10 USERID_UMO_A     PIC  X(08).
            10 NETNAME_UMO_A    PIC  X(08).
            10 TIMEST_UMO_A     PIC  X(26).
            10 ENTIDAD_UMO      PIC  X(04).
            10 CENTRO_UMO       PIC  X(04).
            10 USERID_UMO       PIC  X(08).
            10 NETNAME_UMO      PIC  X(08).
            10 TIMEST_UMO       PIC  X(26).
        ******************************************************************
        * LONGITUD TOTAL DEL REGISTRO EN BYTES : 395                     *
        ******************************************************************
