      ******************************************************************        
      * INTERFAZ A RIO 46                                              *        
      * DATOS DE LOS CONTRATOS                                         *        
      ******************************************************************        
           02  MDEC1610.                                                        
               10 COD_ENTIGEN          PIC X(04).             
               10 COD_ENTIDAD          PIC X(04).             
               10 COD_CENTRO           PIC X(04).             
               10 NUM_CONTRATO         PIC X(12).             
               10 COD_PRODUCTO         PIC X(02).             
               10 COD_SUBPRODU         PIC X(04).             
               10 COD_DIVISA           PIC X(03).             
               10 FEC_INGRESO          PIC X(10).             
               10 FEC_INISITIR         PIC X(10).             
               10 COD_TIPOTASA         PIC X(1).              
               10 INT_TASA             PIC 9(3)V9(5).         
               10 COD_TASA             PIC X(4).              
               10 COD_ESTADO           PIC X(2).              
               10 FEC_CASTIGO          PIC X(10).             
               10 COD_ORIGCAST         PIC X(2).              
               10 FEC_ABSEGUIM         PIC X(10).             
               10 FEC_ABTOTAL          PIC X(10).             
               10 COD_GARANTIA         PIC X(03).     
               10 NUM_PERSONA          PIC X(08).     
               10 TIP_DOCUMENTO        PIC X(02).     
               10 NUM_DOCUMENTO        PIC X(11).     
               10 NUCTA                PIC X(15).     
               10 TIP_PERSONA          PIC X(01).     
               10 SEX_PERSONA          PIC X(01).     
               10 TOT_CAPITAL          PIC 9(13)V9(4).
               10 TOT_AJUCAPUG         PIC 9(13)V9(4).
               10 TOT_INTERES          PIC 9(13)V9(4).
               10 SDO_INTEDOCU         PIC 9(13)V9(4).
               10 TOT_IMPUESTO         PIC 9(13)V9(4).
               10 COD_MARCONTR         PIC X(02).     
               10 COD_SMARCONT         PIC X(02).     
               10 COD_MOTBAJAC         PIC X(2).      
               10 NUM_BUFETE           PIC X(08).     
               10 COD_BANCA            PIC X(3).      
               10 COD_SECTOR           PIC X(3).      
               10 COD_OFICONT          PIC X(4).      
               10 FEC_APERTURA         PIC X(10).     
               10 COD_CLASEPRO         PIC X(2).      
               10 COD_SUBCLPRO         PIC X(1).      
               10 FEC_ULTLQINT         PIC X(10).     
               10 FEC_ULTLQESP         PIC X(10).     
               10 FEC_ULTAMORT         PIC X(10).     
               10 FEC_VTO              PIC X(10).     
               10 COD_CLAREVIS         PIC X(3).      
               10 DIA_CALENDAR         PIC X(1).      
               10 TIP_AMORTIZA         PIC X(1).      
               10 TIP_PRODUCTO         PIC X(2).      
               10 COD_INSTRU           PIC X(1).      
               10 COD_DESTFOND         PIC X(5).      
               10 IMP_CONCEDID         PIC 9(13)V9(4).
               10 COD_PLAZO            PIC X(4).      
               10 PER_AMORTCAP         PIC X(4).      
               10 PER_INTERES          PIC X(4).      
               10 NUM_PLAZOPEN         PIC 9(9).      
               10 FEC_ULTFACTU         PIC X(10).     
               10 TIP_PREMIO           PIC X(3).      
               10 POR_PREMIO           PIC 9(3)V9(6). 
               10 COD_COEFINDE         PIC X(3).      
               10 COD_PROCEDEN         PIC X(2).      
               10 TIP_TITULARI         PIC X(1).      
               10 NUP_PLANSLDO         PIC X(8).      
               10 FEC_PREVISION        PIC X(10).     
               10 FEC_INFVERAZ         PIC X(10).     
               10 COD_REFINANC         PIC X(1).      
               10 IND_ALTAIR           PIC X(1).      
               10 IND_CONVERSI         PIC X(1).      
               10 IND_QUITA            PIC X(1).      
               10 COD_TIPADMIN         PIC X(1).      
               10 IMP_CASTIGO          PIC 9(13)V9(4).
               10 IMP_DEUDAING         PIC 9(13)V9(4).
               10 IMP_DEUDAEGR         PIC 9(13)V9(4).
               10 NUM_CTAINT           PIC X(015).    
               10 NUM_CTAAJU           PIC X(015).    
               10 FEC_BAJA             PIC X(10).     
               10 FILLER               PIC X(194).             