           02  PEDT009.
               10 PECDGENT         PIC X(04).
               10 PENUMPER         PIC X(08).
               10 PESECSIT         PIC S9(3)V COMP-3.
               10 PEFECINI         PIC X(10).
               10 PEFECFIN         PIC X(10).
               10 PEPERING         PIC X(01).
               10 PERESIVA         PIC X(02).
               10 PECONIVA         PIC X(01).
               10 PECEREXC         PIC X(01).
               10 PEFECINE         PIC X(10).
               10 PEFECVEE         PIC X(10).
               10 PERESGAN         PIC X(01).
               10 PECERNOR         PIC X(01).
               10 PEPORNOR         PIC S9(03)V9(02) COMP-3.
               10 PEFECINC         PIC X(10).
               10 PEFECVEC         PIC X(10).
               10 PECEREXE         PIC X(01).
               10 PEAJUINF         PIC X(01).
               10 PETIPINB         PIC X(03).
               10 PENUMINB         PIC X(20).
               10 PEMAREMP         PIC X(01).
               10 PEMAREMD         PIC X(01).
               10 PEMARVIG         PIC X(01).
               10 PEMARAUT         PIC X(01).
               10 PEULTPRE         PIC X(06).
               10 PEMARRET         PIC X(01).
               10 PECOARET         PIC X(01).
               10 PEPACFIS         PIC X(01).
               10 PEAGERET         PIC X(01).
               10 PECERARE         PIC X(01).
               10 PEPOREXC         PIC S9(03)V9(2) COMP-3.
               10 PEDNRPRE         PIC X(08).
               10 PEMARCA1         PIC X(01).
               10 PEMARCA2         PIC X(01).
               10 PEMARCA3         PIC X(01).
               10 PEMARCA4         PIC X(01).
               10 PEMARCA5         PIC X(01).
               10 PEUSUALT         PIC X(08).
               10 PEFECALT         PIC X(10).
               10 PEUSUMOD         PIC X(08).
               10 PETERMOD         PIC X(04).
               10 PESUCMOD         PIC X(04).
               10 PEHSTAMP         PIC X(26).