           01  PEDT027.
               10 PECDGENT    PIC X(4).
               10 PENUMPER    PIC X(8).
               10 PENOMTAB    PIC X(7).
               10 PESECCAM    PIC S9(3)V USAGE COMP-3.
               10 PETIPCAM    PIC X(2).
               10 PEUSUALT    PIC X(8).
               10 PEFECALT    PIC X(10).
               10 PEUSUMOD    PIC X(8).
               10 PETERMOD    PIC X(4).
               10 PESUCMOD    PIC X(4).
               10 PEHSTAMP    PIC X(26).
               10 PEESTANT_LEN  PIC S9(4) USAGE COMP.
               10 PEESTANT_TEXT  PIC X(500).
               10 PEESTDES_LEN  PIC S9(4) USAGE COMP.
               10 PEESTDES_TEXT  PIC X(500).